readme.org
#+TITLE: Luca's literate Emacs config
#+STARTUP: content
#+PROPERTY: header-args:emacs-lisp :tangle ./init.el
# #+SETUPFILE: https://fniessen.github.io/org-html-themes/org/theme-readtheorg.setup

* Introduction
** This file
This file (~readme.org~) is my literate emacs configuration. 
Every time I save the file, the code blocks get tangled.
By default, they get tangled (in sequence) to ~./init.el~.
Some blocks override this default (e.g. see the section [[*early-init.el][early-init.el]]).

This file also is exported to HTML.
The template used is "readtheorg" from [[https://github.com/fniessen/org-html-themes][org-html-themes]] .

NOTE: the code blocks in the sections marked with TODO have ~:tangle no~ in their header args so they are not tangled to my ~init.el~.
** Why vanilla?
I used [[https://github.com/hlissner/doom-emacs][DOOM emacs]] for an year and I was an happy user.
One day I woke up with the wish to understand Emacs a little more.

After about a week (12/01/2021) I had restored my configuration and in the process I understood better concepts such as:
- hooks
- minor and major modes
- advices
  
It is still a long journey but I am glad I started it.
** Structure of this configuration
- In the second section some optimization of startup time, mostly stolen from smart people.
- In the third section we bootstrap ~straight~ and  ~use-package~, our package managers
- In the fourth section we configure ~emacs~ with sane defaults and extend some its core features (e.g. ~help-mode~)
- In the fifth section we set up ~general~, which we use to manage our keybindings and lazy loading of packages. Afterwards we configure ~evil~, for modal editing.
- The remaining sections declare my personal configuration of UI and core packages, leveraging the great tools described in this list.
* Startup
