readme.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-01-17 Sun 15:55 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Luca's literate Emacs config</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Luca Cambiaghi" />
</head>
<body>
<div id="preamble" class="status">
<div id="toggle-theme">dark theme</div><div id="toggle-toc">&#9776;</div>
</div>
<div id="content">
<h1 class="title">Luca's literate Emacs config</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgb946bc0">1. Introduction</a>
<ul>
<li><a href="#org8bcf94a">1.1. This file</a></li>
<li><a href="#orga506393">1.2. Why vanilla?</a></li>
<li><a href="#orgd772e20">1.3. Structure of this configuration</a></li>
</ul>
</li>
<li><a href="#orgb780fa6">2. Startup</a>
<ul>
<li><a href="#org193d269">2.1. early-init.el</a></li>
<li><a href="#org551ac5c">2.2. Startup optimization</a></li>
</ul>
</li>
<li><a href="#orgf2b83f8">3. Package manager</a>
<ul>
<li><a href="#org7058cdd">3.1. bootstrap straight and straight-use-package</a></li>
<li><a href="#org77cd3e0">3.2. straight lockfile</a></li>
<li><a href="#org4bea2c7">3.3. Enable use-package statistics</a></li>
</ul>
</li>
<li><a href="#org4d99f09">4. Emacs</a>
<ul>
<li><a href="#org75253e7">4.1. Sane defaults</a></li>
<li><a href="#org7bebe20">4.2. macOS</a></li>
<li><a href="#org94e6870">4.3. Garbage collector magic hack</a></li>
<li><a href="#orgbbcb9c2">4.4. helpful</a></li>
<li><a href="#orge487ca4">4.5. eldoc</a></li>
<li><a href="#org0287556">4.6. exec path from shell</a></li>
<li><a href="#org2fddd2a">4.7. no littering</a></li>
</ul>
</li>
<li><a href="#org4c2e827">5. Keybindings</a>
<ul>
<li><a href="#org119742f">5.1. general</a></li>
<li><a href="#orge4a2e0b">5.2. evil mode</a></li>
<li><a href="#org326a508">5.3. which-key</a></li>
</ul>
</li>
<li><a href="#org79b96b3">6. UI</a>
<ul>
<li><a href="#orge60ca02">6.1. all the icons</a></li>
<li><a href="#org4a48368">6.2. doom modeline</a></li>
<li><a href="#org0c4200f">6.3. Fancy titlebar for macOS</a></li>
<li><a href="#org62b47df">6.4. Modus themes</a></li>
<li><a href="#orgc093eef">6.5. dashboard</a></li>
<li><a href="#org6c7ba6e">6.6. centaur tabs</a></li>
<li><a href="#org040c8f2">6.7. centered cursor mode</a></li>
<li><a href="#org11e8161">6.8. hide mode line</a></li>
<li><a href="#org8c20a7d">6.9. popup management</a></li>
<li><a href="#orgc922c15">6.10. winum</a></li>
<li><a href="#org3e29391">6.11. transpose frame</a></li>
<li><a href="#org06f01d9">6.12. persistent scratch</a></li>
<li><a href="#org54604fd">6.13. olivetti mode</a></li>
</ul>
</li>
<li><a href="#orgc955f1a">7. Completion framework</a>
<ul>
<li><a href="#orge40b989">7.1. selectrum</a></li>
<li><a href="#orgf2b729a">7.2. prescient</a></li>
<li><a href="#org9238fbf">7.3. marginalia</a></li>
<li><a href="#orga2ebbb1">7.4. embark</a></li>
<li><a href="#org16f8080">7.5. <span class="todo TODO">TODO</span> embark-consult</a></li>
<li><a href="#orga411173">7.6. consult</a></li>
</ul>
</li>
<li><a href="#org85c8123">8. Core packages</a>
<ul>
<li><a href="#org05da2f7">8.1. project</a>
<ul>
<li><a href="#orgf51b49f">8.1.1. projectile</a></li>
<li><a href="#org2223ac8">8.1.2. perspective</a></li>
</ul>
</li>
<li><a href="#orgba97886">8.2. git</a>
<ul>
<li><a href="#orgb7d2bdb">8.2.1. magit</a></li>
<li><a href="#org62841fd">8.2.2. <span class="todo TODO">TODO</span> forge</a></li>
<li><a href="#orgbfceeb8">8.2.3. git-timemachine</a></li>
<li><a href="#org46e580d">8.2.4. git-gutter</a></li>
<li><a href="#orgb142637">8.2.5. hydra-smerge</a></li>
</ul>
</li>
<li><a href="#org3d2bcf4">8.3. hydra</a></li>
<li><a href="#orgb7013f7">8.4. Highlight indentation guides</a></li>
<li><a href="#org1f7b3cc">8.5. rainbow parenthesis</a></li>
<li><a href="#orgb8e9902">8.6. syntax highlighting</a></li>
<li><a href="#orga2a0a0f">8.7. company-mode</a></li>
<li><a href="#orgdaadd7b">8.8. <span class="todo TODO">TODO</span> company box</a></li>
<li><a href="#orgc892934">8.9. envrc</a></li>
<li><a href="#org615435a">8.10. yasnippet</a></li>
<li><a href="#org103f49b">8.11. evil-multicursor</a></li>
<li><a href="#org70c4429">8.12. evil-nerd-commenter</a></li>
<li><a href="#org8c6baeb">8.13. evil-surround</a></li>
<li><a href="#orge0efcde">8.14. undo fu</a></li>
<li><a href="#org681fc69">8.15. vterm</a></li>
<li><a href="#orgd7aa025">8.16. dired</a></li>
<li><a href="#org3f15995">8.17. restart-emacs</a></li>
</ul>
</li>
<li><a href="#org5ac3b37">9. Org mode</a>
<ul>
<li><a href="#org453e54f">9.1. org mode configuration</a></li>
<li><a href="#org1c162ef">9.2. better bullets</a></li>
<li><a href="#orgfbe72c5">9.3. todo highlight</a></li>
<li><a href="#org50e3f4c">9.4. org babel</a></li>
<li><a href="#org1188c06">9.5. ob-async</a></li>
<li><a href="#org0888139">9.6. ob-jupyter</a></li>
<li><a href="#orgc49bc1e">9.7. exporters</a></li>
<li><a href="#org045ca17">9.8. org-tree-slide</a></li>
<li><a href="#orgfd267ab">9.9. evil-org-mode</a></li>
<li><a href="#orgfcf8dab">9.10. org-html-themify</a></li>
</ul>
</li>
<li><a href="#org4eb8250">10. Programming languages</a>
<ul>
<li><a href="#orgb676243">10.1. lsp mode</a></li>
<li><a href="#org97438c0">10.2. dap-mode</a></li>
<li><a href="#org09ec5c2">10.3. Python</a>
<ul>
<li><a href="#orgcd37cf4">10.3.1. python mode</a></li>
<li><a href="#orged19ee5">10.3.2. lsp-pyright</a></li>
<li><a href="#orgacbcf93">10.3.3. pytest</a></li>
<li><a href="#orgb25f5b2">10.3.4. flymake</a></li>
<li><a href="#org430d114">10.3.5. jupyter</a></li>
<li><a href="#orgc9ad385">10.3.6. auto-import</a></li>
</ul>
</li>
<li><a href="#org3f5607f">10.4. R</a>
<ul>
<li><a href="#org322e435">10.4.1. ess</a></li>
</ul>
</li>
<li><a href="#orgf511180">10.5. emacs-lisp</a>
<ul>
<li><a href="#org383c154">10.5.1. elisp-mode</a></li>
<li><a href="#org31456d0">10.5.2. evil-lisp state</a></li>
</ul>
</li>
<li><a href="#org763f646">10.6. Nix</a>
<ul>
<li><a href="#org644e335">10.6.1. nix mode</a></li>
</ul>
</li>
<li><a href="#org3b45733">10.7. Clojure</a>
<ul>
<li><a href="#org2d58209">10.7.1. Clojure mode</a></li>
<li><a href="#orgce4137c">10.7.2. Cider</a></li>
<li><a href="#org9b429e7">10.7.3. ob-clojure</a></li>
<li><a href="#org5073a58">10.7.4. evil-cleverparens</a></li>
<li><a href="#org01132cd">10.7.5. aggressive-indent</a></li>
</ul>
</li>
<li><a href="#org33ca1c5">10.8. markdown</a>
<ul>
<li><a href="#orgc3161f3">10.8.1. markdown-mode</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgb4cd338">11. <span class="todo TODO">TODO</span> missing / to fix</a>
<ul>
<li><a href="#org0029231">11.1. Missing</a>
<ul>
<li><a href="#orge001b15">11.1.1. Make different font configurations (toggle big font)</a></li>
<li><a href="#org9c0d749">11.1.2. org-encrypt</a></li>
</ul>
</li>
<li><a href="#org2c8e6ed">11.2. Half done</a>
<ul>
<li><a href="#orgcef2419">11.2.1. <span class="todo TODO">TODO</span> ox-reveal</a></li>
<li><a href="#org155e548">11.2.2. <span class="todo TODO">TODO</span> scimax utilities for ob-jupyter</a></li>
</ul>
</li>
<li><a href="#org5bb8b43">11.3. To fix</a>
<ul>
<li><a href="#org169891f">11.3.1. <code>evil-scroll-down</code> throwing error when <code>centaur-tabs-mode</code> is active</a></li>
<li><a href="#org1ff6fd5">11.3.2. <code>lsp-find-definition</code> not being bound to <code>gd</code></a></li>
<li><a href="#org3d24c5c">11.3.3. <code>org-ellipsis</code> not shown in heading when <code>git-gutter-fringe-mode</code> is active</a></li>
<li><a href="#org221f2e5">11.3.4. <code>em</code> not working</a></li>
<li><a href="#org226b4d8">11.3.5. <code>helpful-variable</code> sometimes throws syntax error</a></li>
<li><a href="#org5ccd4de">11.3.6. <code>switch-to-prev-buffer</code> twice in a row should behave like <code>cmd+tab</code></a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-orgb946bc0" class="outline-2">
<h2 id="orgb946bc0"><span class="section-number-2">1</span> Introduction</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org8bcf94a" class="outline-3">
<h3 id="org8bcf94a"><span class="section-number-3">1.1</span> This file</h3>
<div class="outline-text-3" id="text-1-1">
<p>
This file (<code>readme.org</code>) is my literate emacs configuration. 
Every time I save the file, the code blocks get tangled.
By default, they get tangled (in sequence) to <code>./init.el</code>.
Some blocks override this default (e.g. see the section <a href="#org193d269">early-init.el</a>).
</p>

<p>
This file also is exported to HTML.
The template used is "readtheorg" from <a href="https://github.com/fniessen/org-html-themes">org-html-themes</a> .
</p>

<p>
NOTE: the code blocks in the sections marked with TODO have <code>:tangle no</code> in their header args so they are not tangled to my <code>init.el</code>.
</p>
</div>
</div>
<div id="outline-container-orga506393" class="outline-3">
<h3 id="orga506393"><span class="section-number-3">1.2</span> Why vanilla?</h3>
<div class="outline-text-3" id="text-1-2">
<p>
I used <a href="https://github.com/hlissner/doom-emacs">DOOM emacs</a> for an year and I was an happy user.
One day I woke up with the wish to understand Emacs a little more.
</p>

<p>
After about a week (12/01/2021) I had restored my configuration and in the process I understood better concepts such as:
</p>
<ul class="org-ul">
<li>hooks</li>
<li>minor and major modes</li>
<li>advices</li>
</ul>

<p>
It is still a long journey but I am glad I started it.
</p>
</div>
</div>
<div id="outline-container-orgd772e20" class="outline-3">
<h3 id="orgd772e20"><span class="section-number-3">1.3</span> Structure of this configuration</h3>
<div class="outline-text-3" id="text-1-3">
<ul class="org-ul">
<li>In the second section some optimization of startup time, mostly stolen from smart people.</li>
<li>In the third section we bootstrap <code>straight</code> and  <code>use-package</code>, our package managers</li>
<li>In the fourth section we configure <code>emacs</code> with sane defaults and extend some its core features (e.g. <code>help-mode</code>)</li>
<li>In the fifth section we set up <code>general</code>, which we use to manage our keybindings and lazy loading of packages. Afterwards we configure <code>evil</code>, for modal editing.</li>
<li>The remaining sections declare my personal configuration of UI and core packages, leveraging the great tools described in this list.</li>
</ul>
</div>
</div>
</div>
