readme.html
<div id="outline-container-orgb780fa6" class="outline-2">
<h2 id="orgb780fa6"><span class="section-number-2">2</span> Startup</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-org193d269" class="outline-3">
<h3 id="org193d269"><span class="section-number-3">2.1</span> early-init.el</h3>
<div class="outline-text-3" id="text-2-1">
<p>
Taken from DOOM's early init
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: var(--clr-comment-delimiter); background-color: var(--bg-comment-delimiter);">;; </span><span style="color: #f0ce43;">NOTE</span><span style="color: var(--clr-comment); background-color: var(--bg-comment);">: early-init.el is now generated from readme.org.  Please edit that file instead</span>

<span style="color: var(--clr-comment-delimiter); background-color: var(--bg-comment-delimiter);">;; </span><span style="color: var(--clr-comment); background-color: var(--bg-comment);">Defer garbage collection further back in the startup process</span>
<span style="color: #ffffff;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">setq</span> gc-cons-threshold most-positive-fixnum
      gc-cons-percentage 0.6<span style="color: #ffffff;">)</span>

<span style="color: var(--clr-comment-delimiter); background-color: var(--bg-comment-delimiter);">;; </span><span style="color: var(--clr-comment); background-color: var(--bg-comment);">In Emacs 27+, package initialization occurs before `</span><span style="color: var(--clr-constant); background-color: var(--bg-constant);">user-init-file</span><span style="color: var(--clr-comment); background-color: var(--bg-comment);">' is</span>
<span style="color: var(--clr-comment-delimiter); background-color: var(--bg-comment-delimiter);">;; </span><span style="color: var(--clr-comment); background-color: var(--bg-comment);">loaded, but after `</span><span style="color: var(--clr-constant); background-color: var(--bg-constant);">early-init-file</span><span style="color: var(--clr-comment); background-color: var(--bg-comment);">'. Doom handles package initialization, so</span>
<span style="color: var(--clr-comment-delimiter); background-color: var(--bg-comment-delimiter);">;; </span><span style="color: var(--clr-comment); background-color: var(--bg-comment);">we must prevent Emacs from doing it early!</span>
<span style="color: #ffffff;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">setq</span> package-enable-at-startup nil<span style="color: #ffffff;">)</span>
<span style="color: var(--clr-comment-delimiter); background-color: var(--bg-comment-delimiter);">;; </span><span style="color: var(--clr-comment); background-color: var(--bg-comment);">Do not allow loading from the package cache (same reason).</span>
<span style="color: #ffffff;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">setq</span> package-quickstart nil<span style="color: #ffffff;">)</span>

<span style="color: var(--clr-comment-delimiter); background-color: var(--bg-comment-delimiter);">;; </span><span style="color: var(--clr-comment); background-color: var(--bg-comment);">Prevent the glimpse of un-styled Emacs by disabling these UI elements early.</span>
<span style="color: #ffffff;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">push</span> '<span style="color: #ff62d4;">(</span>menu-bar-lines . 0<span style="color: #ff62d4;">)</span> default-frame-alist<span style="color: #ffffff;">)</span>
<span style="color: #ffffff;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">push</span> '<span style="color: #ff62d4;">(</span>tool-bar-lines . 0<span style="color: #ff62d4;">)</span> default-frame-alist<span style="color: #ffffff;">)</span>
<span style="color: #ffffff;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">push</span> '<span style="color: #ff62d4;">(</span>vertical-scroll-bars<span style="color: #ff62d4;">)</span> default-frame-alist<span style="color: #ffffff;">)</span>

<span style="color: var(--clr-comment-delimiter); background-color: var(--bg-comment-delimiter);">;; </span><span style="color: var(--clr-comment); background-color: var(--bg-comment);">Resizing the Emacs frame can be a terribly expensive part of changing the</span>
<span style="color: var(--clr-comment-delimiter); background-color: var(--bg-comment-delimiter);">;; </span><span style="color: var(--clr-comment); background-color: var(--bg-comment);">font. By inhibiting this, we easily halve startup times with fonts that are</span>
<span style="color: var(--clr-comment-delimiter); background-color: var(--bg-comment-delimiter);">;; </span><span style="color: var(--clr-comment); background-color: var(--bg-comment);">larger than the system default.</span>
<span style="color: #ffffff;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">setq</span> frame-inhibit-implied-resize t<span style="color: #ffffff;">)</span>

<span style="color: var(--clr-comment-delimiter); background-color: var(--bg-comment-delimiter);">;; </span><span style="color: var(--clr-comment); background-color: var(--bg-comment);">Disable GUI elements</span>
<span style="color: #ffffff;">(</span>menu-bar-mode -1<span style="color: #ffffff;">)</span>
<span style="color: #ffffff;">(</span>tool-bar-mode -1<span style="color: #ffffff;">)</span>
<span style="color: #ffffff;">(</span>scroll-bar-mode -1<span style="color: #ffffff;">)</span>
<span style="color: #ffffff;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">setq</span> inhibit-splash-screen t<span style="color: #ffffff;">)</span>
<span style="color: #ffffff;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">setq</span> use-file-dialog nil<span style="color: #ffffff;">)</span>

<span style="color: var(--clr-comment-delimiter); background-color: var(--bg-comment-delimiter);">;; </span><span style="color: var(--clr-comment); background-color: var(--bg-comment);">Prevent unwanted runtime builds in gccemacs (native-comp); packages are</span>
<span style="color: var(--clr-comment-delimiter); background-color: var(--bg-comment-delimiter);">;; </span><span style="color: var(--clr-comment); background-color: var(--bg-comment);">compiled ahead-of-time when they are installed and site files are compiled</span>
<span style="color: var(--clr-comment-delimiter); background-color: var(--bg-comment-delimiter);">;; </span><span style="color: var(--clr-comment); background-color: var(--bg-comment);">when gccemacs is installed.</span>
<span style="color: #ffffff;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">setq</span> comp-deferred-compilation nil<span style="color: #ffffff;">)</span>
</pre>
</div>
</div>
</div>
