readme.org
** Startup optimization
Taken from DOOM's init
#+BEGIN_SRC emacs-lisp
  ;; NOTE: init.el is now generated from readme.org.  Please edit that file instead
  ;; repeating here in case early-init.el is not loaded with chemacs

  (setq gc-cons-threshold most-positive-fixnum
        gc-cons-percentage 0.6)
  (setq package-enable-at-startup nil)
  (setq comp-deferred-compilation nil)

  ;; `file-name-handler-alist' is consulted on every `require', `load' and various
  ;; path/io functions. You get a minor speed up by nooping this. However, this
  ;; may cause problems on builds of Emacs where its site lisp files aren't
  ;; byte-compiled and we're forced to load the *.el.gz files (e.g. on Alpine)
  (unless (daemonp)
    (defvar doom--initial-file-name-handler-alist file-name-handler-alist)
    (setq file-name-handler-alist nil)
    ;; Restore `file-name-handler-alist' later, because it is needed for handling
    ;; encrypted or compressed files, among other things.
    (defun doom-reset-file-handler-alist-h ()
      ;; Re-add rather than `setq', because changes to `file-name-handler-alist'
      ;; since startup ought to be preserved.
      (dolist (handler file-name-handler-alist)
        (add-to-list 'doom--initial-file-name-handler-alist handler))
      (setq file-name-handler-alist doom--initial-file-name-handler-alist))
    (add-hook 'emacs-startup-hook #'doom-reset-file-handler-alist-h)
    (add-hook 'after-init-hook #'(lambda ()
                                   ;; restore after startup
                                   (setq gc-cons-threshold 16777216
                                         gc-cons-percentage 0.1)))
    )
  ;; Ensure Doom is running out of this file's directory
  (setq user-emacs-directory (file-name-directory load-file-name))
#+END_SRC

* Package manager
