readme.html

<div id="outline-container-org551ac5c" class="outline-3">
<h3 id="org551ac5c"><span class="section-number-3">2.2</span> Startup optimization</h3>
<div class="outline-text-3" id="text-2-2">
<p>
Taken from DOOM's init
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: var(--clr-comment-delimiter); background-color: var(--bg-comment-delimiter);">;; </span><span style="color: #f0ce43;">NOTE</span><span style="color: var(--clr-comment); background-color: var(--bg-comment);">: init.el is now generated from readme.org.  Please edit that file instead</span>
<span style="color: var(--clr-comment-delimiter); background-color: var(--bg-comment-delimiter);">;; </span><span style="color: var(--clr-comment); background-color: var(--bg-comment);">repeating here in case early-init.el is not loaded with chemacs</span>

<span style="color: #ffffff;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">setq</span> gc-cons-threshold most-positive-fixnum
      gc-cons-percentage 0.6<span style="color: #ffffff;">)</span>
<span style="color: #ffffff;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">setq</span> package-enable-at-startup nil<span style="color: #ffffff;">)</span>
<span style="color: #ffffff;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">setq</span> comp-deferred-compilation nil<span style="color: #ffffff;">)</span>

<span style="color: var(--clr-comment-delimiter); background-color: var(--bg-comment-delimiter);">;; </span><span style="color: var(--clr-comment); background-color: var(--bg-comment);">`</span><span style="color: var(--clr-constant); background-color: var(--bg-constant);">file-name-handler-alist</span><span style="color: var(--clr-comment); background-color: var(--bg-comment);">' is consulted on every `</span><span style="color: var(--clr-constant); background-color: var(--bg-constant);">require</span><span style="color: var(--clr-comment); background-color: var(--bg-comment);">', `</span><span style="color: var(--clr-constant); background-color: var(--bg-constant);">load</span><span style="color: var(--clr-comment); background-color: var(--bg-comment);">' and various</span>
<span style="color: var(--clr-comment-delimiter); background-color: var(--bg-comment-delimiter);">;; </span><span style="color: var(--clr-comment); background-color: var(--bg-comment);">path/io functions. You get a minor speed up by nooping this. However, this</span>
<span style="color: var(--clr-comment-delimiter); background-color: var(--bg-comment-delimiter);">;; </span><span style="color: var(--clr-comment); background-color: var(--bg-comment);">may cause problems on builds of Emacs where its site lisp files aren't</span>
<span style="color: var(--clr-comment-delimiter); background-color: var(--bg-comment-delimiter);">;; </span><span style="color: var(--clr-comment); background-color: var(--bg-comment);">byte-compiled and we're forced to load the *.el.gz files (e.g. on Alpine)</span>
<span style="color: #ffffff;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">unless</span> <span style="color: #ff62d4;">(</span>daemonp<span style="color: #ff62d4;">)</span>
  <span style="color: #ff62d4;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">defvar</span> <span style="color: var(--clr-variable); background-color: var(--bg-variable);">doom--initial-file-name-handler-alist</span> file-name-handler-alist<span style="color: #ff62d4;">)</span>
  <span style="color: #ff62d4;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">setq</span> file-name-handler-alist nil<span style="color: #ff62d4;">)</span>
  <span style="color: var(--clr-comment-delimiter); background-color: var(--bg-comment-delimiter);">;; </span><span style="color: var(--clr-comment); background-color: var(--bg-comment);">Restore `</span><span style="color: var(--clr-constant); background-color: var(--bg-constant);">file-name-handler-alist</span><span style="color: var(--clr-comment); background-color: var(--bg-comment);">' later, because it is needed for handling</span>
  <span style="color: var(--clr-comment-delimiter); background-color: var(--bg-comment-delimiter);">;; </span><span style="color: var(--clr-comment); background-color: var(--bg-comment);">encrypted or compressed files, among other things.</span>
  <span style="color: #ff62d4;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">defun</span> <span style="color: var(--function-clr-name); background-color: var(--function-bg-name);">doom-reset-file-handler-alist-h</span> <span style="color: #3fdfd0;">()</span>
    <span style="color: var(--clr-comment-delimiter); background-color: var(--bg-comment-delimiter);">;; </span><span style="color: var(--clr-comment); background-color: var(--bg-comment);">Re-add rather than `</span><span style="color: var(--clr-constant); background-color: var(--bg-constant);">setq</span><span style="color: var(--clr-comment); background-color: var(--bg-comment);">', because changes to `</span><span style="color: var(--clr-constant); background-color: var(--bg-constant);">file-name-handler-alist</span><span style="color: var(--clr-comment); background-color: var(--bg-comment);">'</span>
    <span style="color: var(--clr-comment-delimiter); background-color: var(--bg-comment-delimiter);">;; </span><span style="color: var(--clr-comment); background-color: var(--bg-comment);">since startup ought to be preserved.</span>
    <span style="color: #3fdfd0;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">dolist</span> <span style="color: #fba849;">(</span>handler file-name-handler-alist<span style="color: #fba849;">)</span>
      <span style="color: #fba849;">(</span>add-to-list 'doom--initial-file-name-handler-alist handler<span style="color: #fba849;">)</span><span style="color: #3fdfd0;">)</span>
    <span style="color: #3fdfd0;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">setq</span> file-name-handler-alist doom--initial-file-name-handler-alist<span style="color: #3fdfd0;">)</span><span style="color: #ff62d4;">)</span>
  <span style="color: #ff62d4;">(</span>add-hook 'emacs-startup-hook #'doom-reset-file-handler-alist-h<span style="color: #ff62d4;">)</span>
  <span style="color: #ff62d4;">(</span>add-hook 'after-init-hook #'<span style="color: #3fdfd0;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">lambda</span> <span style="color: #fba849;">()</span>
                                 <span style="color: var(--clr-comment-delimiter); background-color: var(--bg-comment-delimiter);">;; </span><span style="color: var(--clr-comment); background-color: var(--bg-comment);">restore after startup</span>
                                 <span style="color: #fba849;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">setq</span> gc-cons-threshold 16777216
                                       gc-cons-percentage 0.1<span style="color: #fba849;">)</span><span style="color: #3fdfd0;">)</span><span style="color: #ff62d4;">)</span>
  <span style="color: #ffffff;">)</span>
<span style="color: var(--clr-comment-delimiter); background-color: var(--bg-comment-delimiter);">;; </span><span style="color: var(--clr-comment); background-color: var(--bg-comment);">Ensure Doom is running out of this file's directory</span>
<span style="color: #ffffff;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">setq</span> user-emacs-directory <span style="color: #ff62d4;">(</span>file-name-directory load-file-name<span style="color: #ff62d4;">)</span><span style="color: #ffffff;">)</span>
</pre>
</div>
</div>
</div>
</div>
