readme.html

<div id="outline-container-orgf2b83f8" class="outline-2">
<h2 id="orgf2b83f8"><span class="section-number-2">3</span> Package manager</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-org7058cdd" class="outline-3">
<h3 id="org7058cdd"><span class="section-number-3">3.1</span> bootstrap straight and straight-use-package</h3>
<div class="outline-text-3" id="text-3-1">
<p>
Some rules/conventions:
</p>
<ul class="org-ul">
<li>Prefer <code>:init</code> to <code>:custom</code>. Prefer multiple <code>setq</code> expressions to one.</li>
<li>Default to <code>:defer t</code>, use <code>:demand</code> to force loading</li>
<li>When packages do not require installation e.g. <code>dired</code>, we need <code>:straight nil</code> and <code>:ensure nil</code></li>
<li>If you specify <code>:commands</code> and bind those to keys, the package will be loaded when the commands are first executed
<ul class="org-ul">
<li>If you use <code>:general</code> and bind commands to keys it will automatically load the package on first invokation</li>
</ul></li>
</ul>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #ffffff;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">setq</span> straight-use-package-by-default t<span style="color: #ffffff;">)</span>
<span style="color: #ffffff;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">setq</span> straight-vc-git-default-clone-depth 1<span style="color: #ffffff;">)</span>
<span style="color: #ffffff;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">setq</span> use-package-always-defer t<span style="color: #ffffff;">)</span>
<span style="color: #ffffff;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">defvar</span> <span style="color: var(--clr-variable); background-color: var(--bg-variable);">bootstrap-version</span><span style="color: #ffffff;">)</span>
<span style="color: #ffffff;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">let*</span> <span style="color: #ff62d4;">(</span><span style="color: #3fdfd0;">(</span>straight-repo-dir
        <span style="color: #fba849;">(</span>expand-file-name <span style="color: var(--clr-string); background-color: var(--bg-string);">"straight/repos"</span> user-emacs-directory<span style="color: #fba849;">)</span><span style="color: #3fdfd0;">)</span>
       <span style="color: #3fdfd0;">(</span>bootstrap-file
        <span style="color: #fba849;">(</span>concat straight-repo-dir <span style="color: var(--clr-string); background-color: var(--bg-string);">"/straight.el/bootstrap.el"</span><span style="color: #fba849;">)</span><span style="color: #3fdfd0;">)</span>
       <span style="color: #3fdfd0;">(</span>bootstrap-version 5<span style="color: #3fdfd0;">)</span><span style="color: #ff62d4;">)</span>
  <span style="color: #ff62d4;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">unless</span> <span style="color: #3fdfd0;">(</span>file-exists-p bootstrap-file<span style="color: #3fdfd0;">)</span>
    <span style="color: #3fdfd0;">(</span>shell-command
     <span style="color: #fba849;">(</span>concat
      <span style="color: var(--clr-string); background-color: var(--bg-string);">"mkdir -p "</span> straight-repo-dir <span style="color: var(--clr-string); background-color: var(--bg-string);">" &amp;&amp; "</span>
      <span style="color: var(--clr-string); background-color: var(--bg-string);">"git -C "</span> straight-repo-dir <span style="color: var(--clr-string); background-color: var(--bg-string);">" clone "</span>
      <span style="color: var(--clr-string); background-color: var(--bg-string);">"https://github.com/raxod502/straight.el.git &amp;&amp; "</span>
      <span style="color: var(--clr-string); background-color: var(--bg-string);">"git -C "</span> straight-repo-dir <span style="color: var(--clr-string); background-color: var(--bg-string);">" checkout 2d407bc"</span><span style="color: #fba849;">)</span><span style="color: #3fdfd0;">)</span><span style="color: #ff62d4;">)</span>
  <span style="color: #ff62d4;">(</span>load bootstrap-file nil 'nomessage<span style="color: #ff62d4;">)</span><span style="color: #ffffff;">)</span>
<span style="color: #ffffff;">(</span>straight-use-package 'use-package<span style="color: #ffffff;">)</span>
<span style="color: var(--clr-comment-delimiter); background-color: var(--bg-comment-delimiter);">;; </span><span style="color: var(--clr-comment); background-color: var(--bg-comment);">This is a variable that has been renamed but straight still refers when</span>
<span style="color: var(--clr-comment-delimiter); background-color: var(--bg-comment-delimiter);">;; </span><span style="color: var(--clr-comment); background-color: var(--bg-comment);">doing :sraight (:no-native-compile t)</span>
<span style="color: #ffffff;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">setq</span> comp-deferred-compilation-black-list nil<span style="color: #ffffff;">)</span>
</pre>
</div>
</div>
</div>
