readme.html

<div id="outline-container-org77cd3e0" class="outline-3">
<h3 id="org77cd3e0"><span class="section-number-3">3.2</span> straight lockfile</h3>
<div class="outline-text-3" id="text-3-2">
<p>
We can run <code>M-x straight-freeze-versions</code> to write the file <code>straight/versions/default.el</code>.
The content of the file can then be kept in a code block, under version control.
The code block can then be tangle again to <code>straight/versions/default.el</code>.
We can then restore package versions using <code>M-x straight-thaw-versions</code>.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #ffffff;">(</span><span style="color: #ff62d4;">(</span><span style="color: var(--clr-string); background-color: var(--bg-string);">"ESS"</span> . <span style="color: var(--clr-string); background-color: var(--bg-string);">"a9e9367976658391126c907b6a5dfc8ad3033ebd"</span><span style="color: #ff62d4;">)</span>
 <span style="color: #ff62d4;">(</span><span style="color: var(--clr-string); background-color: var(--bg-string);">"a.el"</span> . <span style="color: var(--clr-string); background-color: var(--bg-string);">"3d341eb7813ee02b00ab28e11c915295bfd4b5a7"</span><span style="color: #ff62d4;">)</span>
 <span style="color: #ff62d4;">(</span><span style="color: var(--clr-string); background-color: var(--bg-string);">"ace-window"</span> . <span style="color: var(--clr-string); background-color: var(--bg-string);">"c7cb315c14e36fded5ac4096e158497ae974bec9"</span><span style="color: #ff62d4;">)</span>
 <span style="color: #ff62d4;">(</span><span style="color: var(--clr-string); background-color: var(--bg-string);">"aggressive-indent-mode"</span> . <span style="color: var(--clr-string); background-color: var(--bg-string);">"b0ec0047aaae071ad1647159613166a253410a63"</span><span style="color: #ff62d4;">)</span>
 <span style="color: #ff62d4;">(</span><span style="color: var(--clr-string); background-color: var(--bg-string);">"all-the-icons-dired"</span> . <span style="color: var(--clr-string); background-color: var(--bg-string);">"fc2dfa1e9eb8bf1c402a675e7089638d702a27a5"</span><span style="color: #ff62d4;">)</span>
 <span style="color: #ff62d4;">(</span><span style="color: var(--clr-string); background-color: var(--bg-string);">"all-the-icons.el"</span> . <span style="color: var(--clr-string); background-color: var(--bg-string);">"6917b08f64dd8487e23769433d6cb9ba11f4152f"</span><span style="color: #ff62d4;">)</span>
 <span style="color: #ff62d4;">(</span><span style="color: var(--clr-string); background-color: var(--bg-string);">"annalist.el"</span> . <span style="color: var(--clr-string); background-color: var(--bg-string);">"134fa3f0fb91a636a1c005c483516d4b64905a6d"</span><span style="color: #ff62d4;">)</span>
 <span style="color: #ff62d4;">(</span><span style="color: var(--clr-string); background-color: var(--bg-string);">"avy"</span> . <span style="color: var(--clr-string); background-color: var(--bg-string);">"e92cb37457b43336b765630dbfbea8ba4be601fa"</span><span style="color: #ff62d4;">)</span>
 <span style="color: #ff62d4;">(</span><span style="color: var(--clr-string); background-color: var(--bg-string);">"bui.el"</span> . <span style="color: var(--clr-string); background-color: var(--bg-string);">"28a9b0a36cb69b931cf32db7546ad5c6589752cf"</span><span style="color: #ff62d4;">)</span>
 <span style="color: #ff62d4;">(</span><span style="color: var(--clr-string); background-color: var(--bg-string);">"centaur-tabs"</span> . <span style="color: var(--clr-string); background-color: var(--bg-string);">"23eda0a0292a84c7e0a0aa2b598f9e29c7e5b54f"</span><span style="color: #ff62d4;">)</span>
 <span style="color: #ff62d4;">(</span><span style="color: var(--clr-string); background-color: var(--bg-string);">"centered-cursor-mode.el"</span> . <span style="color: var(--clr-string); background-color: var(--bg-string);">"4093821cc9759ca5a3c6e527d4cc915fc3a5ad74"</span><span style="color: #ff62d4;">)</span>
 <span style="color: #ff62d4;">(</span><span style="color: var(--clr-string); background-color: var(--bg-string);">"cfrs"</span> . <span style="color: var(--clr-string); background-color: var(--bg-string);">"a5225c1830ae4c5a98fc0973d62d131321c059cd"</span><span style="color: #ff62d4;">)</span>
 <span style="color: #ff62d4;">(</span><span style="color: var(--clr-string); background-color: var(--bg-string);">"cider"</span> . <span style="color: var(--clr-string); background-color: var(--bg-string);">"9c137c52cf5b769fcc52b4e8108acda10638f766"</span><span style="color: #ff62d4;">)</span>
 <span style="color: #ff62d4;">(</span><span style="color: var(--clr-string); background-color: var(--bg-string);">"clojure-mode"</span> . <span style="color: var(--clr-string); background-color: var(--bg-string);">"53ef8ac076ae7811627fbdd408e519ab7fca9a0b"</span><span style="color: #ff62d4;">)</span>
 <span style="color: #ff62d4;">(</span><span style="color: var(--clr-string); background-color: var(--bg-string);">"company-mode"</span> . <span style="color: var(--clr-string); background-color: var(--bg-string);">"6116c4617a7934acfe84cb82a058e9b198f0f480"</span><span style="color: #ff62d4;">)</span>
 <span style="color: #ff62d4;">(</span><span style="color: var(--clr-string); background-color: var(--bg-string);">"consult"</span> . <span style="color: var(--clr-string); background-color: var(--bg-string);">"7a2f751421f4a1601811fa59571bd64baf7ec900"</span><span style="color: #ff62d4;">)</span>
 <span style="color: #ff62d4;">(</span><span style="color: var(--clr-string); background-color: var(--bg-string);">"dap-mode"</span> . <span style="color: var(--clr-string); background-color: var(--bg-string);">"612388d0b85e77972a9c28391bac6224a63408c7"</span><span style="color: #ff62d4;">)</span>
 <span style="color: #ff62d4;">(</span><span style="color: var(--clr-string); background-color: var(--bg-string);">"dash.el"</span> . <span style="color: var(--clr-string); background-color: var(--bg-string);">"8879c41d30211ae2e72298e354fdffef627a3836"</span><span style="color: #ff62d4;">)</span>
 <span style="color: #ff62d4;">(</span><span style="color: var(--clr-string); background-color: var(--bg-string);">"dired-single"</span> . <span style="color: var(--clr-string); background-color: var(--bg-string);">"98c2102429fcac6fbfdba9198c126eb1b3dcc4e5"</span><span style="color: #ff62d4;">)</span>
 <span style="color: #ff62d4;">(</span><span style="color: var(--clr-string); background-color: var(--bg-string);">"doom-modeline"</span> . <span style="color: var(--clr-string); background-color: var(--bg-string);">"49816da1a6c05e6215ec3c8aac6c5eabeb47e74c"</span><span style="color: #ff62d4;">)</span>
 <span style="color: #ff62d4;">(</span><span style="color: var(--clr-string); background-color: var(--bg-string);">"eldoc"</span> . <span style="color: var(--clr-string); background-color: var(--bg-string);">"b906386cf04029e01228fde239c3a2e3e5b53603"</span><span style="color: #ff62d4;">)</span>
 <span style="color: #ff62d4;">(</span><span style="color: var(--clr-string); background-color: var(--bg-string);">"elisp-refs"</span> . <span style="color: var(--clr-string); background-color: var(--bg-string);">"b3634a4567c655a1cda51b217629849cba0ac6a7"</span><span style="color: #ff62d4;">)</span>
 <span style="color: #ff62d4;">(</span><span style="color: var(--clr-string); background-color: var(--bg-string);">"emacs-async"</span> . <span style="color: var(--clr-string); background-color: var(--bg-string);">"14f48de586b0977e3470f053b810d77b07ea427a"</span><span style="color: #ff62d4;">)</span>
 <span style="color: #ff62d4;">(</span><span style="color: var(--clr-string); background-color: var(--bg-string);">"emacs-bind-map"</span> . <span style="color: var(--clr-string); background-color: var(--bg-string);">"bf4181e3a41463684adfffc6c5c305b30480e30f"</span><span style="color: #ff62d4;">)</span>
 <span style="color: #ff62d4;">(</span><span style="color: var(--clr-string); background-color: var(--bg-string);">"emacs-dashboard"</span> . <span style="color: var(--clr-string); background-color: var(--bg-string);">"2b1ef13392be2f07d2a52636edf578b89512d501"</span><span style="color: #ff62d4;">)</span>
 <span style="color: #ff62d4;">(</span><span style="color: var(--clr-string); background-color: var(--bg-string);">"emacs-hide-mode-line"</span> . <span style="color: var(--clr-string); background-color: var(--bg-string);">"88888825b5b27b300683e662fa3be88d954b1cea"</span><span style="color: #ff62d4;">)</span>
 <span style="color: #ff62d4;">(</span><span style="color: var(--clr-string); background-color: var(--bg-string);">"emacs-jupyter"</span> . <span style="color: var(--clr-string); background-color: var(--bg-string);">"360cae2c70ab28c7a7848c0c56473d984f0243e5"</span><span style="color: #ff62d4;">)</span>
 <span style="color: #ff62d4;">(</span><span style="color: var(--clr-string); background-color: var(--bg-string);">"emacs-libvterm"</span> . <span style="color: var(--clr-string); background-color: var(--bg-string);">"6f95a1b2949f60539fd92e3a63011801a7e765fd"</span><span style="color: #ff62d4;">)</span>
 <span style="color: #ff62d4;">(</span><span style="color: var(--clr-string); background-color: var(--bg-string);">"emacs-memoize"</span> . <span style="color: var(--clr-string); background-color: var(--bg-string);">"51b075935ca7070f62fae1d69fe0ff7d8fa56fdd"</span><span style="color: #ff62d4;">)</span>
 <span style="color: #ff62d4;">(</span><span style="color: var(--clr-string); background-color: var(--bg-string);">"emacs-python-pytest"</span> . <span style="color: var(--clr-string); background-color: var(--bg-string);">"4a1c4c8915c12e540d41aae1d4e326a2362da541"</span><span style="color: #ff62d4;">)</span>
 <span style="color: #ff62d4;">(</span><span style="color: var(--clr-string); background-color: var(--bg-string);">"emacs-tree-sitter"</span> . <span style="color: var(--clr-string); background-color: var(--bg-string);">"076865a6c879840ab61e0aa7b336a2e3e1f97cd4"</span><span style="color: #ff62d4;">)</span>
 <span style="color: #ff62d4;">(</span><span style="color: var(--clr-string); background-color: var(--bg-string);">"emacs-undo-fu"</span> . <span style="color: var(--clr-string); background-color: var(--bg-string);">"c0806c1903c5a0e4c69b6615cdc3366470a9b8ca"</span><span style="color: #ff62d4;">)</span>
 <span style="color: #ff62d4;">(</span><span style="color: var(--clr-string); background-color: var(--bg-string);">"emacs-web-server"</span> . <span style="color: var(--clr-string); background-color: var(--bg-string);">"22ce66ea43e0eadb9ec1d691a35d9695fc29cee6"</span><span style="color: #ff62d4;">)</span>
 <span style="color: #ff62d4;">(</span><span style="color: var(--clr-string); background-color: var(--bg-string);">"emacs-websocket"</span> . <span style="color: var(--clr-string); background-color: var(--bg-string);">"36deb3ff85368d000a88435d5a645ffbab490654"</span><span style="color: #ff62d4;">)</span>
 <span style="color: #ff62d4;">(</span><span style="color: var(--clr-string); background-color: var(--bg-string);">"emacs-which-key"</span> . <span style="color: var(--clr-string); background-color: var(--bg-string);">"428aedfce0157920814fbb2ae5d00b4aea89df88"</span><span style="color: #ff62d4;">)</span>
 <span style="color: #ff62d4;">(</span><span style="color: var(--clr-string); background-color: var(--bg-string);">"emacs-winum"</span> . <span style="color: var(--clr-string); background-color: var(--bg-string);">"c5455e866e8a5f7eab6a7263e2057aff5f1118b9"</span><span style="color: #ff62d4;">)</span>
 <span style="color: #ff62d4;">(</span><span style="color: var(--clr-string); background-color: var(--bg-string);">"emacs-zmq"</span> . <span style="color: var(--clr-string); background-color: var(--bg-string);">"eb4e01715cbf2f356a8ae5e678ffec3380a907dc"</span><span style="color: #ff62d4;">)</span>
 <span style="color: #ff62d4;">(</span><span style="color: var(--clr-string); background-color: var(--bg-string);">"emacsmirror-mirror"</span> . <span style="color: var(--clr-string); background-color: var(--bg-string);">"73d68771488284cceb42f70fda551e0a516cb249"</span><span style="color: #ff62d4;">)</span>
 <span style="color: #ff62d4;">(</span><span style="color: var(--clr-string); background-color: var(--bg-string);">"embark"</span> . <span style="color: var(--clr-string); background-color: var(--bg-string);">"f78ad7e1dfc0864b8def91888d1866dd47d69ed3"</span><span style="color: #ff62d4;">)</span>
 <span style="color: #ff62d4;">(</span><span style="color: var(--clr-string); background-color: var(--bg-string);">"envrc"</span> . <span style="color: var(--clr-string); background-color: var(--bg-string);">"18caf5154f61d7f78cd4719d999e0fa6ef52345f"</span><span style="color: #ff62d4;">)</span>
 <span style="color: #ff62d4;">(</span><span style="color: var(--clr-string); background-color: var(--bg-string);">"epl"</span> . <span style="color: var(--clr-string); background-color: var(--bg-string);">"78ab7a85c08222cd15582a298a364774e3282ce6"</span><span style="color: #ff62d4;">)</span>
 <span style="color: #ff62d4;">(</span><span style="color: var(--clr-string); background-color: var(--bg-string);">"evil"</span> . <span style="color: var(--clr-string); background-color: var(--bg-string);">"d6cf6680ec52733ea78dc530ed75fadc5171c758"</span><span style="color: #ff62d4;">)</span>
 <span style="color: #ff62d4;">(</span><span style="color: var(--clr-string); background-color: var(--bg-string);">"evil-cleverparens"</span> . <span style="color: var(--clr-string); background-color: var(--bg-string);">"8c45879d49bfa6d4e414b6c1df700a4a51cbb869"</span><span style="color: #ff62d4;">)</span>
 <span style="color: #ff62d4;">(</span><span style="color: var(--clr-string); background-color: var(--bg-string);">"evil-collection"</span> . <span style="color: var(--clr-string); background-color: var(--bg-string);">"f53ef08224f709c732740d45b373ef3617f6d759"</span><span style="color: #ff62d4;">)</span>
 <span style="color: #ff62d4;">(</span><span style="color: var(--clr-string); background-color: var(--bg-string);">"evil-goggles"</span> . <span style="color: var(--clr-string); background-color: var(--bg-string);">"08a22058fd6a167f9f1b684c649008caef571459"</span><span style="color: #ff62d4;">)</span>
 <span style="color: #ff62d4;">(</span><span style="color: var(--clr-string); background-color: var(--bg-string);">"evil-lisp-state"</span> . <span style="color: var(--clr-string); background-color: var(--bg-string);">"3c65fecd9917a41eaf6460f22187e2323821f3ce"</span><span style="color: #ff62d4;">)</span>
 <span style="color: #ff62d4;">(</span><span style="color: var(--clr-string); background-color: var(--bg-string);">"evil-mc"</span> . <span style="color: var(--clr-string); background-color: var(--bg-string);">"7dfb2ca5ac00c249cb2f55cd6fa91fb2bfb1117e"</span><span style="color: #ff62d4;">)</span>
 <span style="color: #ff62d4;">(</span><span style="color: var(--clr-string); background-color: var(--bg-string);">"evil-nerd-commenter"</span> . <span style="color: var(--clr-string); background-color: var(--bg-string);">"563cdc154b1f29d181b883563dd37be7eafafdee"</span><span style="color: #ff62d4;">)</span>
 <span style="color: #ff62d4;">(</span><span style="color: var(--clr-string); background-color: var(--bg-string);">"evil-surround"</span> . <span style="color: var(--clr-string); background-color: var(--bg-string);">"346d4d85fcf1f9517e9c4991c1efe68b4130f93a"</span><span style="color: #ff62d4;">)</span>
 <span style="color: #ff62d4;">(</span><span style="color: var(--clr-string); background-color: var(--bg-string);">"exec-path-from-shell"</span> . <span style="color: var(--clr-string); background-color: var(--bg-string);">"d14d6d2966efe5a1409f84a6b9d998268f74761d"</span><span style="color: #ff62d4;">)</span>
 <span style="color: #ff62d4;">(</span><span style="color: var(--clr-string); background-color: var(--bg-string);">"f.el"</span> . <span style="color: var(--clr-string); background-color: var(--bg-string);">"1814209e2ff43cf2e6d38c4cd476218915f550fb"</span><span style="color: #ff62d4;">)</span>
 <span style="color: #ff62d4;">(</span><span style="color: var(--clr-string); background-color: var(--bg-string);">"fringe-helper.el"</span> . <span style="color: var(--clr-string); background-color: var(--bg-string);">"ef4a9c023bae18ec1ddd7265f1f2d6d2e775efdd"</span><span style="color: #ff62d4;">)</span>
 <span style="color: #ff62d4;">(</span><span style="color: var(--clr-string); background-color: var(--bg-string);">"gcmh"</span> . <span style="color: var(--clr-string); background-color: var(--bg-string);">"0089f9c3a6d4e9a310d0791cf6fa8f35642ecfd9"</span><span style="color: #ff62d4;">)</span>
 <span style="color: #ff62d4;">(</span><span style="color: var(--clr-string); background-color: var(--bg-string);">"general.el"</span> . <span style="color: var(--clr-string); background-color: var(--bg-string);">"a0b17d207badf462311b2eef7c065b884462cb7c"</span><span style="color: #ff62d4;">)</span>
 <span style="color: #ff62d4;">(</span><span style="color: var(--clr-string); background-color: var(--bg-string);">"git-gutter"</span> . <span style="color: var(--clr-string); background-color: var(--bg-string);">"34ae23dfed4f2afb06286c120cbc7793cf4c5bc1"</span><span style="color: #ff62d4;">)</span>
 <span style="color: #ff62d4;">(</span><span style="color: var(--clr-string); background-color: var(--bg-string);">"git-gutter-fringe"</span> . <span style="color: var(--clr-string); background-color: var(--bg-string);">"4f19866494fa1debfa319382913e39a153431634"</span><span style="color: #ff62d4;">)</span>
 <span style="color: #ff62d4;">(</span><span style="color: var(--clr-string); background-color: var(--bg-string);">"git-timemachine"</span> . <span style="color: var(--clr-string); background-color: var(--bg-string);">"8d675750e921a047707fcdc36d84f8439b19a907"</span><span style="color: #ff62d4;">)</span>
 <span style="color: #ff62d4;">(</span><span style="color: var(--clr-string); background-color: var(--bg-string);">"gnu-elpa-mirror"</span> . <span style="color: var(--clr-string); background-color: var(--bg-string);">"fcb3cf5ba5f16885f7851885c954222aee6f03ab"</span><span style="color: #ff62d4;">)</span>
 <span style="color: #ff62d4;">(</span><span style="color: var(--clr-string); background-color: var(--bg-string);">"goto-chg"</span> . <span style="color: var(--clr-string); background-color: var(--bg-string);">"2af612153bc9f5bed135d25abe62f46ddaa9027f"</span><span style="color: #ff62d4;">)</span>
 <span style="color: #ff62d4;">(</span><span style="color: var(--clr-string); background-color: var(--bg-string);">"helpful"</span> . <span style="color: var(--clr-string); background-color: var(--bg-string);">"584ecc887bb92133119f93a6716cdf7af0b51dca"</span><span style="color: #ff62d4;">)</span>
 <span style="color: #ff62d4;">(</span><span style="color: var(--clr-string); background-color: var(--bg-string);">"highlight-indent-guides"</span> . <span style="color: var(--clr-string); background-color: var(--bg-string);">"cf352c85cd15dd18aa096ba9d9ab9b7ab493e8f6"</span><span style="color: #ff62d4;">)</span>
 <span style="color: #ff62d4;">(</span><span style="color: var(--clr-string); background-color: var(--bg-string);">"hl-todo"</span> . <span style="color: var(--clr-string); background-color: var(--bg-string);">"9661a462d86b22293caaa4c3d94f971a15dbf1d5"</span><span style="color: #ff62d4;">)</span>
 <span style="color: #ff62d4;">(</span><span style="color: var(--clr-string); background-color: var(--bg-string);">"ht.el"</span> . <span style="color: var(--clr-string); background-color: var(--bg-string);">"2850301d19176b8d3bb6cc8d95af6ab7e529bd56"</span><span style="color: #ff62d4;">)</span>
 <span style="color: #ff62d4;">(</span><span style="color: var(--clr-string); background-color: var(--bg-string);">"hydra"</span> . <span style="color: var(--clr-string); background-color: var(--bg-string);">"2d553787aca1aceb3e6927e426200e9bb9f056f1"</span><span style="color: #ff62d4;">)</span>
 <span style="color: #ff62d4;">(</span><span style="color: var(--clr-string); background-color: var(--bg-string);">"lsp-mode"</span> . <span style="color: var(--clr-string); background-color: var(--bg-string);">"f51741e2bbf002381d9bc51a6c7ae504c11d827b"</span><span style="color: #ff62d4;">)</span>
 <span style="color: #ff62d4;">(</span><span style="color: var(--clr-string); background-color: var(--bg-string);">"lsp-pyright"</span> . <span style="color: var(--clr-string); background-color: var(--bg-string);">"71ff088ac4c93b0edd012f305a3dfd1602c5d21e"</span><span style="color: #ff62d4;">)</span>
 <span style="color: #ff62d4;">(</span><span style="color: var(--clr-string); background-color: var(--bg-string);">"lsp-treemacs"</span> . <span style="color: var(--clr-string); background-color: var(--bg-string);">"64e375fcc700d4d47cf52ad912e6863d479e3bfa"</span><span style="color: #ff62d4;">)</span>
 <span style="color: #ff62d4;">(</span><span style="color: var(--clr-string); background-color: var(--bg-string);">"lsp-ui"</span> . <span style="color: var(--clr-string); background-color: var(--bg-string);">"62568188b7cbc0758a0c4bfb57647708406ddf51"</span><span style="color: #ff62d4;">)</span>
 <span style="color: #ff62d4;">(</span><span style="color: var(--clr-string); background-color: var(--bg-string);">"magit"</span> . <span style="color: var(--clr-string); background-color: var(--bg-string);">"25f432551347468ce97b8b03987e59092e91f8f0"</span><span style="color: #ff62d4;">)</span>
 <span style="color: #ff62d4;">(</span><span style="color: var(--clr-string); background-color: var(--bg-string);">"marginalia"</span> . <span style="color: var(--clr-string); background-color: var(--bg-string);">"d38a27867bcec0bafa43e8d1bd3fd96a32b15d31"</span><span style="color: #ff62d4;">)</span>
 <span style="color: #ff62d4;">(</span><span style="color: var(--clr-string); background-color: var(--bg-string);">"markdown-mode"</span> . <span style="color: var(--clr-string); background-color: var(--bg-string);">"e250a8465f805644d372c264eb0572f569d7f2a1"</span><span style="color: #ff62d4;">)</span>
 <span style="color: #ff62d4;">(</span><span style="color: var(--clr-string); background-color: var(--bg-string);">"melpa"</span> . <span style="color: var(--clr-string); background-color: var(--bg-string);">"ea7b38971ea1ac02d1de128d3526f9b7b9f601f9"</span><span style="color: #ff62d4;">)</span>
 <span style="color: #ff62d4;">(</span><span style="color: var(--clr-string); background-color: var(--bg-string);">"modus-themes"</span> . <span style="color: var(--clr-string); background-color: var(--bg-string);">"2a7228e09402f2f69aabf4fd8f367e5f6e8248b3"</span><span style="color: #ff62d4;">)</span>
 <span style="color: #ff62d4;">(</span><span style="color: var(--clr-string); background-color: var(--bg-string);">"nix-mode"</span> . <span style="color: var(--clr-string); background-color: var(--bg-string);">"53ea839a52335d089699d3530bae8ea5914cdbb6"</span><span style="color: #ff62d4;">)</span>
 <span style="color: #ff62d4;">(</span><span style="color: var(--clr-string); background-color: var(--bg-string);">"ob-async"</span> . <span style="color: var(--clr-string); background-color: var(--bg-string);">"de1cd6c93242a4cb8773bbe115b7be3d4dd6b97e"</span><span style="color: #ff62d4;">)</span>
 <span style="color: #ff62d4;">(</span><span style="color: var(--clr-string); background-color: var(--bg-string);">"org"</span> . <span style="color: var(--clr-string); background-color: var(--bg-string);">"94d1753ec8b171442f0e789ca38beee2415198b0"</span><span style="color: #ff62d4;">)</span>
 <span style="color: #ff62d4;">(</span><span style="color: var(--clr-string); background-color: var(--bg-string);">"org-reverse-datetree"</span> . <span style="color: var(--clr-string); background-color: var(--bg-string);">"be24274dd62cd3c586cbea99c8f73db251bf319d"</span><span style="color: #ff62d4;">)</span>
 <span style="color: #ff62d4;">(</span><span style="color: var(--clr-string); background-color: var(--bg-string);">"org-superstar-mode"</span> . <span style="color: var(--clr-string); background-color: var(--bg-string);">"7f83636db215bf5a10edbfdf11d12a132864a914"</span><span style="color: #ff62d4;">)</span>
 <span style="color: #ff62d4;">(</span><span style="color: var(--clr-string); background-color: var(--bg-string);">"org-tree-slide"</span> . <span style="color: var(--clr-string); background-color: var(--bg-string);">"d6e8e91433dfe4968f1343b483f2680f45a77d52"</span><span style="color: #ff62d4;">)</span>
 <span style="color: #ff62d4;">(</span><span style="color: var(--clr-string); background-color: var(--bg-string);">"ox-gfm"</span> . <span style="color: var(--clr-string); background-color: var(--bg-string);">"99f93011b069e02b37c9660b8fcb45dab086a07f"</span><span style="color: #ff62d4;">)</span>
 <span style="color: #ff62d4;">(</span><span style="color: var(--clr-string); background-color: var(--bg-string);">"ox-ipynb"</span> . <span style="color: var(--clr-string); background-color: var(--bg-string);">"919b694763035c0ea04a3a368418355185f896b8"</span><span style="color: #ff62d4;">)</span>
 <span style="color: #ff62d4;">(</span><span style="color: var(--clr-string); background-color: var(--bg-string);">"page-break-lines"</span> . <span style="color: var(--clr-string); background-color: var(--bg-string);">"69caea070379f3324c530e96e06625c3cd097cb9"</span><span style="color: #ff62d4;">)</span>
 <span style="color: #ff62d4;">(</span><span style="color: var(--clr-string); background-color: var(--bg-string);">"paredit"</span> . <span style="color: var(--clr-string); background-color: var(--bg-string);">"8330a41e8188fe18d3fa805bb9aa529f015318e8"</span><span style="color: #ff62d4;">)</span>
 <span style="color: #ff62d4;">(</span><span style="color: var(--clr-string); background-color: var(--bg-string);">"parseclj"</span> . <span style="color: var(--clr-string); background-color: var(--bg-string);">"eff941126859bc9e949eae5cd6c2592e731629f2"</span><span style="color: #ff62d4;">)</span>
 <span style="color: #ff62d4;">(</span><span style="color: var(--clr-string); background-color: var(--bg-string);">"parseedn"</span> . <span style="color: var(--clr-string); background-color: var(--bg-string);">"90cfe3df51b96f85e346f336c0a0ee6bf7fee508"</span><span style="color: #ff62d4;">)</span>
 <span style="color: #ff62d4;">(</span><span style="color: var(--clr-string); background-color: var(--bg-string);">"persistent-scratch"</span> . <span style="color: var(--clr-string); background-color: var(--bg-string);">"57221e5fdff22985c0ea2f3e7c282ce823ea5932"</span><span style="color: #ff62d4;">)</span>
 <span style="color: #ff62d4;">(</span><span style="color: var(--clr-string); background-color: var(--bg-string);">"persp-projectile"</span> . <span style="color: var(--clr-string); background-color: var(--bg-string);">"533808b3e4f8f95a1e3ed9c55d9aa720277ebd5f"</span><span style="color: #ff62d4;">)</span>
 <span style="color: #ff62d4;">(</span><span style="color: var(--clr-string); background-color: var(--bg-string);">"perspective-el"</span> . <span style="color: var(--clr-string); background-color: var(--bg-string);">"2f2b59e693f08b8d9c81062fca25e6076b6e7f8d"</span><span style="color: #ff62d4;">)</span>
 <span style="color: #ff62d4;">(</span><span style="color: var(--clr-string); background-color: var(--bg-string);">"pfuture"</span> . <span style="color: var(--clr-string); background-color: var(--bg-string);">"d7926de3ba0105a36cfd00811fd6278aea903eef"</span><span style="color: #ff62d4;">)</span>
 <span style="color: #ff62d4;">(</span><span style="color: var(--clr-string); background-color: var(--bg-string);">"pkg-info"</span> . <span style="color: var(--clr-string); background-color: var(--bg-string);">"76ba7415480687d05a4353b27fea2ae02b8d9d61"</span><span style="color: #ff62d4;">)</span>
 <span style="color: #ff62d4;">(</span><span style="color: var(--clr-string); background-color: var(--bg-string);">"posframe"</span> . <span style="color: var(--clr-string); background-color: var(--bg-string);">"ae8ac91744010c8975f07cf18282f58ce56605d0"</span><span style="color: #ff62d4;">)</span>
 <span style="color: #ff62d4;">(</span><span style="color: var(--clr-string); background-color: var(--bg-string);">"powerline"</span> . <span style="color: var(--clr-string); background-color: var(--bg-string);">"b293abf83c0a2b2988af19dd0ef0426c3b1d1501"</span><span style="color: #ff62d4;">)</span>
 <span style="color: #ff62d4;">(</span><span style="color: var(--clr-string); background-color: var(--bg-string);">"prescient.el"</span> . <span style="color: var(--clr-string); background-color: var(--bg-string);">"42adc802d3ba6c747bed7ea1f6e3ffbbdfc7192d"</span><span style="color: #ff62d4;">)</span>
 <span style="color: #ff62d4;">(</span><span style="color: var(--clr-string); background-color: var(--bg-string);">"projectile"</span> . <span style="color: var(--clr-string); background-color: var(--bg-string);">"c31bd41c0b9d6fba8837ebfd3a31dec0b3cd73c6"</span><span style="color: #ff62d4;">)</span>
 <span style="color: #ff62d4;">(</span><span style="color: var(--clr-string); background-color: var(--bg-string);">"python-mode"</span> . <span style="color: var(--clr-string); background-color: var(--bg-string);">"41b123b4d4906cce7591900a952bb75a38c5296c"</span><span style="color: #ff62d4;">)</span>
 <span style="color: #ff62d4;">(</span><span style="color: var(--clr-string); background-color: var(--bg-string);">"queue"</span> . <span style="color: var(--clr-string); background-color: var(--bg-string);">"52206c0f78afc0dfb9a287cb928c1e725103336d"</span><span style="color: #ff62d4;">)</span>
 <span style="color: #ff62d4;">(</span><span style="color: var(--clr-string); background-color: var(--bg-string);">"rainbow-delimiters"</span> . <span style="color: var(--clr-string); background-color: var(--bg-string);">"f43d48a24602be3ec899345a3326ed0247b960c6"</span><span style="color: #ff62d4;">)</span>
 <span style="color: #ff62d4;">(</span><span style="color: var(--clr-string); background-color: var(--bg-string);">"s.el"</span> . <span style="color: var(--clr-string); background-color: var(--bg-string);">"43ba8b563bee3426cead0e6d4ddc09398e1a349d"</span><span style="color: #ff62d4;">)</span>
 <span style="color: #ff62d4;">(</span><span style="color: var(--clr-string); background-color: var(--bg-string);">"selectrum"</span> . <span style="color: var(--clr-string); background-color: var(--bg-string);">"87ec4296f4fc9baf05dbaff0b9e63b2b4afd5bb6"</span><span style="color: #ff62d4;">)</span>
 <span style="color: #ff62d4;">(</span><span style="color: var(--clr-string); background-color: var(--bg-string);">"sesman"</span> . <span style="color: var(--clr-string); background-color: var(--bg-string);">"edee869c209c016e5f0c5cbb8abb9f3ccd2d1e05"</span><span style="color: #ff62d4;">)</span>
 <span style="color: #ff62d4;">(</span><span style="color: var(--clr-string); background-color: var(--bg-string);">"shrink-path.el"</span> . <span style="color: var(--clr-string); background-color: var(--bg-string);">"c14882c8599aec79a6e8ef2d06454254bb3e1e41"</span><span style="color: #ff62d4;">)</span>
 <span style="color: #ff62d4;">(</span><span style="color: var(--clr-string); background-color: var(--bg-string);">"smartparens"</span> . <span style="color: var(--clr-string); background-color: var(--bg-string);">"63695c64233d215a92bf08e762f643cdb595bdd9"</span><span style="color: #ff62d4;">)</span>
 <span style="color: #ff62d4;">(</span><span style="color: var(--clr-string); background-color: var(--bg-string);">"spinner"</span> . <span style="color: var(--clr-string); background-color: var(--bg-string);">"61f59fab44d22cd5add61a1baf3f0b88a5d829d7"</span><span style="color: #ff62d4;">)</span>
 <span style="color: #ff62d4;">(</span><span style="color: var(--clr-string); background-color: var(--bg-string);">"straight.el"</span> . <span style="color: var(--clr-string); background-color: var(--bg-string);">"2d407bccd9378f1d5218f8ba2ae85c6be73fbaf1"</span><span style="color: #ff62d4;">)</span>
 <span style="color: #ff62d4;">(</span><span style="color: var(--clr-string); background-color: var(--bg-string);">"transient"</span> . <span style="color: var(--clr-string); background-color: var(--bg-string);">"90e640fe8fa3f309c7cf347501e86ca5cd0bd85e"</span><span style="color: #ff62d4;">)</span>
 <span style="color: #ff62d4;">(</span><span style="color: var(--clr-string); background-color: var(--bg-string);">"transpose-frame"</span> . <span style="color: var(--clr-string); background-color: var(--bg-string);">"12e523d70ff78cc8868097b56120848befab5dbc"</span><span style="color: #ff62d4;">)</span>
 <span style="color: #ff62d4;">(</span><span style="color: var(--clr-string); background-color: var(--bg-string);">"treemacs"</span> . <span style="color: var(--clr-string); background-color: var(--bg-string);">"a0a1e96393c41b909ea75a35e0c8972047cfd1ae"</span><span style="color: #ff62d4;">)</span>
 <span style="color: #ff62d4;">(</span><span style="color: var(--clr-string); background-color: var(--bg-string);">"use-package"</span> . <span style="color: var(--clr-string); background-color: var(--bg-string);">"caa92f1d64fc25480551757d854b4b49981dfa6b"</span><span style="color: #ff62d4;">)</span>
 <span style="color: #ff62d4;">(</span><span style="color: var(--clr-string); background-color: var(--bg-string);">"with-editor"</span> . <span style="color: var(--clr-string); background-color: var(--bg-string);">"6735180e73e787b79535c245b162249b70dbf841"</span><span style="color: #ff62d4;">)</span>
 <span style="color: #ff62d4;">(</span><span style="color: var(--clr-string); background-color: var(--bg-string);">"yasnippet"</span> . <span style="color: var(--clr-string); background-color: var(--bg-string);">"5cbdbf0d2015540c59ed8ee0fcf4788effdf75b6"</span><span style="color: #ff62d4;">)</span><span style="color: #ffffff;">)</span>
<span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:beta</span>
</pre>
</div>
</div>
</div>
