readme.html

<div id="outline-container-org4bea2c7" class="outline-3">
<h3 id="org4bea2c7"><span class="section-number-3">3.3</span> Enable use-package statistics</h3>
<div class="outline-text-3" id="text-3-3">
<p>
If you'd like to see how many packages you've loaded, what stage of initialization they've reached, and how much aggregate time they've spent (roughly), you can enable use-package-compute-statistics after loading use-package but before any use-package forms, and then run the command M-x use-package-report to see the results. The buffer displayed is a tabulated list. You can use S in a column to sort the rows based on it.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #ffffff;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">setq</span> use-package-compute-statistics t<span style="color: #ffffff;">)</span>
</pre>
</div>
</div>
</div>
</div>
