readme.html

<div id="outline-container-org4d99f09" class="outline-2">
<h2 id="org4d99f09"><span class="section-number-2">4</span> Emacs</h2>
<div class="outline-text-2" id="text-4">
</div>
<div id="outline-container-org75253e7" class="outline-3">
<h3 id="org75253e7"><span class="section-number-3">4.1</span> Sane defaults</h3>
<div class="outline-text-3" id="text-4-1">
<p>
Inspired by <a href="https://github.com/natecox/dotfiles/blob/master/emacs/emacs.d/nathancox.org">https://github.com/natecox/dotfiles/blob/master/emacs/emacs.d/nathancox.org</a>
When the package is not to be found on <code>melpa</code>, we need to set <code>:straight nil</code> and <code>:ensure nil</code> to instruct <code>straight</code> not to download it.
We do the same for <code>dired</code>.
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #ffffff;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">use-package</span> <span style="color: var(--clr-constant); background-color: var(--bg-constant);">emacs</span>
  <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:init</span>
  <span style="color: #ff62d4;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">setq</span> inhibit-startup-screen t
        default-fill-column 80
        initial-scratch-message nil
        sentence-end-double-space nil
        ring-bell-function 'ignore
        frame-resize-pixelwise t<span style="color: #ff62d4;">)</span>

  <span style="color: #ff62d4;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">setq</span> user-full-name <span style="color: var(--clr-string); background-color: var(--bg-string);">"Luca Cambiaghi"</span>
        user-mail-address <span style="color: var(--clr-string); background-color: var(--bg-string);">"luca.cambiaghi@me.com"</span><span style="color: #ff62d4;">)</span>

  <span style="color: #ff62d4;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">setq</span> read-process-output-max <span style="color: #3fdfd0;">(</span>* 1024 1024<span style="color: #3fdfd0;">)</span><span style="color: #ff62d4;">)</span>

  <span style="color: var(--clr-comment-delimiter); background-color: var(--bg-comment-delimiter);">;; </span><span style="color: var(--clr-comment); background-color: var(--bg-comment);">always allow 'y' instead of 'yes'.</span>
  <span style="color: #ff62d4;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">defalias</span> '<span style="color: var(--function-clr-name); background-color: var(--function-bg-name);">yes-or-no-p</span> 'y-or-n-p<span style="color: #ff62d4;">)</span>

  <span style="color: var(--clr-comment-delimiter); background-color: var(--bg-comment-delimiter);">;; </span><span style="color: var(--clr-comment); background-color: var(--bg-comment);">default to utf-8 for all the things</span>
  <span style="color: #ff62d4;">(</span>set-charset-priority 'unicode<span style="color: #ff62d4;">)</span>
  <span style="color: #ff62d4;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">setq</span> locale-coding-system 'utf-8
        coding-system-for-read 'utf-8
        coding-system-for-write 'utf-8<span style="color: #ff62d4;">)</span>
  <span style="color: #ff62d4;">(</span>set-terminal-coding-system 'utf-8<span style="color: #ff62d4;">)</span>
  <span style="color: #ff62d4;">(</span>set-keyboard-coding-system 'utf-8<span style="color: #ff62d4;">)</span>
  <span style="color: #ff62d4;">(</span>set-selection-coding-system 'utf-8<span style="color: #ff62d4;">)</span>
  <span style="color: #ff62d4;">(</span>prefer-coding-system 'utf-8<span style="color: #ff62d4;">)</span>
  <span style="color: #ff62d4;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">setq</span> default-process-coding-system '<span style="color: #3fdfd0;">(</span>utf-8-unix . utf-8-unix<span style="color: #3fdfd0;">)</span><span style="color: #ff62d4;">)</span>

  <span style="color: var(--clr-comment-delimiter); background-color: var(--bg-comment-delimiter);">;; </span><span style="color: var(--clr-comment); background-color: var(--bg-comment);">write over selected text on input... like all modern editors do</span>
  <span style="color: #ff62d4;">(</span>delete-selection-mode t<span style="color: #ff62d4;">)</span>

  <span style="color: var(--clr-comment-delimiter); background-color: var(--bg-comment-delimiter);">;; </span><span style="color: var(--clr-comment); background-color: var(--bg-comment);">enable recent files mode.</span>
  <span style="color: #ff62d4;">(</span>recentf-mode t<span style="color: #ff62d4;">)</span>

  <span style="color: var(--clr-comment-delimiter); background-color: var(--bg-comment-delimiter);">;; </span><span style="color: var(--clr-comment); background-color: var(--bg-comment);">auto-close parentheses</span>
  <span style="color: #ff62d4;">(</span>electric-pair-mode +1<span style="color: #ff62d4;">)</span>
  <span style="color: var(--clr-comment-delimiter); background-color: var(--bg-comment-delimiter);">;; </span><span style="color: var(--clr-comment); background-color: var(--bg-comment);">disable auto pairing for &lt;</span>
  <span style="color: #ff62d4;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">add-function</span> <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:before-until</span> electric-pair-inhibit-predicate
                <span style="color: #3fdfd0;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">lambda</span> <span style="color: #fba849;">(</span>c<span style="color: #fba849;">)</span> <span style="color: #fba849;">(</span>eq c ?&lt;<span style="color: #fba849;">)</span><span style="color: #3fdfd0;">)</span><span style="color: #ff62d4;">)</span>

  <span style="color: var(--clr-comment-delimiter); background-color: var(--bg-comment-delimiter);">;; </span><span style="color: var(--clr-comment); background-color: var(--bg-comment);">don't want ESC as a modifier</span>
  <span style="color: #ff62d4;">(</span>global-set-key <span style="color: #3fdfd0;">(</span>kbd <span style="color: var(--clr-string); background-color: var(--bg-string);">"&lt;escape&gt;"</span><span style="color: #3fdfd0;">)</span> 'keyboard-escape-quit<span style="color: #ff62d4;">)</span>

  <span style="color: var(--clr-comment-delimiter); background-color: var(--bg-comment-delimiter);">;; </span><span style="color: var(--clr-comment); background-color: var(--bg-comment);">Don't persist a custom file, this bites me more than it helps</span>
  <span style="color: #ff62d4;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">setq</span> custom-file <span style="color: #3fdfd0;">(</span>make-temp-file <span style="color: var(--clr-string); background-color: var(--bg-string);">""</span><span style="color: #3fdfd0;">)</span><span style="color: #ff62d4;">)</span> <span style="color: var(--clr-comment-delimiter); background-color: var(--bg-comment-delimiter);">; </span><span style="color: var(--clr-comment); background-color: var(--bg-comment);">use a temp file as a placeholder</span>
  <span style="color: #ff62d4;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">setq</span> custom-safe-themes t<span style="color: #ff62d4;">)</span>            <span style="color: var(--clr-comment-delimiter); background-color: var(--bg-comment-delimiter);">; </span><span style="color: var(--clr-comment); background-color: var(--bg-comment);">mark all themes as safe, since we can't persist now</span>
  <span style="color: #ff62d4;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">setq</span> enable-local-variables <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:all</span><span style="color: #ff62d4;">)</span>     <span style="color: var(--clr-comment-delimiter); background-color: var(--bg-comment-delimiter);">; </span><span style="color: var(--clr-comment); background-color: var(--bg-comment);">fix =defvar= warnings</span>

  <span style="color: var(--clr-comment-delimiter); background-color: var(--bg-comment-delimiter);">;; </span><span style="color: var(--clr-comment); background-color: var(--bg-comment);">stop emacs from littering the file system with backup files</span>
  <span style="color: #ff62d4;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">setq</span> make-backup-files nil
        auto-save-default nil
        create-lockfiles nil<span style="color: #ff62d4;">)</span>

  <span style="color: var(--clr-comment-delimiter); background-color: var(--bg-comment-delimiter);">;; </span><span style="color: var(--clr-comment); background-color: var(--bg-comment);">follow symlinks </span>
  <span style="color: #ff62d4;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">setq</span> vc-follow-symlinks t<span style="color: #ff62d4;">)</span>

  <span style="color: var(--clr-comment-delimiter); background-color: var(--bg-comment-delimiter);">;; </span><span style="color: var(--clr-comment); background-color: var(--bg-comment);">don't show any extra window chrome</span>
  <span style="color: #ff62d4;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">when</span> <span style="color: #3fdfd0;">(</span>window-system<span style="color: #3fdfd0;">)</span>
    <span style="color: #3fdfd0;">(</span>tool-bar-mode -1<span style="color: #3fdfd0;">)</span>
    <span style="color: #3fdfd0;">(</span>toggle-scroll-bar -1<span style="color: #3fdfd0;">)</span><span style="color: #ff62d4;">)</span>

  <span style="color: var(--clr-comment-delimiter); background-color: var(--bg-comment-delimiter);">;; </span><span style="color: var(--clr-comment); background-color: var(--bg-comment);">Main typeface</span>
  <span style="color: var(--clr-comment-delimiter); background-color: var(--bg-comment-delimiter);">;; </span><span style="color: var(--clr-comment); background-color: var(--bg-comment);">point size * 10, so 18*10 =180</span>
  <span style="color: #ff62d4;">(</span>set-face-attribute 'default nil <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:font</span> <span style="color: var(--clr-string); background-color: var(--bg-string);">"Fira Code Retina"</span> <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:height</span> 180<span style="color: #ff62d4;">)</span>
  <span style="color: var(--clr-comment-delimiter); background-color: var(--bg-comment-delimiter);">;; </span><span style="color: var(--clr-comment); background-color: var(--bg-comment);">Set the fixed pitch face</span>
  <span style="color: #ff62d4;">(</span>set-face-attribute 'fixed-pitch nil <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:font</span> <span style="color: var(--clr-string); background-color: var(--bg-string);">"Fira Code Retina"</span> <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:height</span> 180<span style="color: #ff62d4;">)</span>
  <span style="color: var(--clr-comment-delimiter); background-color: var(--bg-comment-delimiter);">;; </span><span style="color: var(--clr-comment); background-color: var(--bg-comment);">Set the variable pitch face</span>
  <span style="color: #ff62d4;">(</span>set-face-attribute 'variable-pitch nil <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:font</span> <span style="color: var(--clr-string); background-color: var(--bg-string);">"Cantarell"</span> <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:height</span> 180 <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:weight</span> 'regular<span style="color: #ff62d4;">)</span>

  <span style="color: var(--clr-comment-delimiter); background-color: var(--bg-comment-delimiter);">;; </span><span style="color: var(--clr-comment); background-color: var(--bg-comment);">enable winner mode globally for undo/redo window layout changes</span>
  <span style="color: #ff62d4;">(</span>winner-mode t<span style="color: #ff62d4;">)</span>

  <span style="color: var(--clr-comment-delimiter); background-color: var(--bg-comment-delimiter);">;; </span><span style="color: var(--clr-comment); background-color: var(--bg-comment);">less noise when compiling elisp</span>
  <span style="color: #ff62d4;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">setq</span> byte-compile-warnings '<span style="color: #3fdfd0;">(</span>not free-vars unresolved noruntime lexical make-local<span style="color: #3fdfd0;">)</span><span style="color: #ff62d4;">)</span>

  <span style="color: var(--clr-comment-delimiter); background-color: var(--bg-comment-delimiter);">;; </span><span style="color: var(--clr-comment); background-color: var(--bg-comment);">clean up the mode line</span>
  <span style="color: #ff62d4;">(</span>display-time-mode -1<span style="color: #ff62d4;">)</span>
  <span style="color: #ff62d4;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">setq</span> column-number-mode t<span style="color: #ff62d4;">)</span>

  <span style="color: var(--clr-comment-delimiter); background-color: var(--bg-comment-delimiter);">;; </span><span style="color: var(--clr-comment); background-color: var(--bg-comment);">use common convention for indentation by default</span>
  <span style="color: #ff62d4;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">setq-default</span> indent-tabs-mode t<span style="color: #ff62d4;">)</span>
  <span style="color: #ff62d4;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">setq-default</span> tab-width 2<span style="color: #ff62d4;">)</span>

  <span style="color: var(--clr-comment-delimiter); background-color: var(--bg-comment-delimiter);">;; </span><span style="color: var(--clr-comment); background-color: var(--bg-comment);">use a reasonable line length</span>
  <span style="color: #ff62d4;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">setq-default</span> fill-column 120<span style="color: #ff62d4;">)</span>
  <span style="color: #ffffff;">)</span>
</pre>
</div>
</div>
</div>
