readme.html

<div id="outline-container-org7bebe20" class="outline-3">
<h3 id="org7bebe20"><span class="section-number-3">4.2</span> macOS</h3>
<div class="outline-text-3" id="text-4-2">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #ffffff;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">when</span> <span style="color: #ff62d4;">(</span>eq system-type 'darwin<span style="color: #ff62d4;">)</span>
  <span style="color: #ff62d4;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">setq</span> mac-command-modifier 'super<span style="color: #ff62d4;">)</span>     <span style="color: var(--clr-comment-delimiter); background-color: var(--bg-comment-delimiter);">; </span><span style="color: var(--clr-comment); background-color: var(--bg-comment);">command as super</span>
  <span style="color: #ff62d4;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">setq</span> mac-option-modifier 'meta<span style="color: #ff62d4;">)</span>     <span style="color: var(--clr-comment-delimiter); background-color: var(--bg-comment-delimiter);">; </span><span style="color: var(--clr-comment); background-color: var(--bg-comment);">alt as meta</span>
  <span style="color: #ff62d4;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">setq</span> mac-control-modifier 'control<span style="color: #ff62d4;">)</span><span style="color: #ffffff;">)</span> <span style="color: var(--clr-comment-delimiter); background-color: var(--bg-comment-delimiter);">; </span><span style="color: var(--clr-comment); background-color: var(--bg-comment);">control as... control</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org94e6870" class="outline-3">
<h3 id="org94e6870"><span class="section-number-3">4.3</span> Garbage collector magic hack</h3>
<div class="outline-text-3" id="text-4-3">
<p>
Used by DOOM to manage garbage collection
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #ffffff;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">use-package</span> <span style="color: var(--clr-constant); background-color: var(--bg-constant);">gcmh</span>
  <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:demand</span>
  <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:config</span>
  <span style="color: #ff62d4;">(</span>gcmh-mode 1<span style="color: #ff62d4;">)</span><span style="color: #ffffff;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgbbcb9c2" class="outline-3">
<h3 id="orgbbcb9c2"><span class="section-number-3">4.4</span> helpful</h3>
<div class="outline-text-3" id="text-4-4">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #ffffff;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">use-package</span> <span style="color: var(--clr-constant); background-color: var(--bg-constant);">helpful</span>
  <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:after</span> evil
  <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:init</span>
  <span style="color: #ff62d4;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">setq</span> evil-lookup-func #'helpful-at-point<span style="color: #ff62d4;">)</span>
  <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:bind</span>
  <span style="color: #ff62d4;">(</span><span style="color: #3fdfd0;">[</span>remap describe-function<span style="color: #3fdfd0;">]</span> . helpful-callable<span style="color: #ff62d4;">)</span>
  <span style="color: #ff62d4;">(</span><span style="color: #3fdfd0;">[</span>remap describe-command<span style="color: #3fdfd0;">]</span> . helpful-command<span style="color: #ff62d4;">)</span>
  <span style="color: #ff62d4;">(</span><span style="color: #3fdfd0;">[</span>remap describe-variable<span style="color: #3fdfd0;">]</span> . helpful-variable<span style="color: #ff62d4;">)</span>
  <span style="color: #ff62d4;">(</span><span style="color: #3fdfd0;">[</span>remap describe-key<span style="color: #3fdfd0;">]</span> . helpful-key<span style="color: #ff62d4;">)</span><span style="color: #ffffff;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orge487ca4" class="outline-3">
<h3 id="orge487ca4"><span class="section-number-3">4.5</span> eldoc</h3>
<div class="outline-text-3" id="text-4-5">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #ffffff;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">use-package</span> <span style="color: var(--clr-constant); background-color: var(--bg-constant);">eldoc</span>
  <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:hook</span> <span style="color: #ff62d4;">(</span>emacs-lisp-mode cider-mode<span style="color: #ff62d4;">)</span><span style="color: #ffffff;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org0287556" class="outline-3">
<h3 id="org0287556"><span class="section-number-3">4.6</span> exec path from shell</h3>
<div class="outline-text-3" id="text-4-6">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #ffffff;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">use-package</span> <span style="color: var(--clr-constant); background-color: var(--bg-constant);">exec-path-from-shell</span>
  <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:if</span> <span style="color: #ff62d4;">(</span>memq window-system '<span style="color: #3fdfd0;">(</span>mac ns<span style="color: #3fdfd0;">)</span><span style="color: #ff62d4;">)</span>
  <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:hook</span> <span style="color: #ff62d4;">(</span>emacs-startup . <span style="color: #3fdfd0;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">lambda</span> <span style="color: #fba849;">()</span>
                           <span style="color: #fba849;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">setq</span> exec-path-from-shell-arguments '<span style="color: #9f80ff;">(</span><span style="color: var(--clr-string); background-color: var(--bg-string);">"-l"</span><span style="color: #9f80ff;">)</span><span style="color: #fba849;">)</span> <span style="color: var(--clr-comment-delimiter); background-color: var(--bg-comment-delimiter);">; </span><span style="color: var(--clr-comment); background-color: var(--bg-comment);">removed the -i for faster startup</span>
                           <span style="color: #fba849;">(</span>exec-path-from-shell-initialize<span style="color: #fba849;">)</span><span style="color: #3fdfd0;">)</span><span style="color: #ff62d4;">)</span>
  <span style="color: var(--clr-comment-delimiter); background-color: var(--bg-comment-delimiter);">;; </span><span style="color: var(--clr-comment); background-color: var(--bg-comment);">:config</span>
  <span style="color: var(--clr-comment-delimiter); background-color: var(--bg-comment-delimiter);">;; </span><span style="color: var(--clr-comment); background-color: var(--bg-comment);">(exec-path-from-shell-copy-envs</span>
  <span style="color: var(--clr-comment-delimiter); background-color: var(--bg-comment-delimiter);">;;  </span><span style="color: var(--clr-comment); background-color: var(--bg-comment);">'("GOPATH" "GO111MODULE" "GOPROXY"</span>
  <span style="color: var(--clr-comment-delimiter); background-color: var(--bg-comment-delimiter);">;;    </span><span style="color: var(--clr-comment); background-color: var(--bg-comment);">"NPMBIN" "LC_ALL" "LANG" "LC_TYPE"</span>
  <span style="color: var(--clr-comment-delimiter); background-color: var(--bg-comment-delimiter);">;;    </span><span style="color: var(--clr-comment); background-color: var(--bg-comment);">"SSH_AGENT_PID" "SSH_AUTH_SOCK" "SHELL"</span>
  <span style="color: var(--clr-comment-delimiter); background-color: var(--bg-comment-delimiter);">;;    </span><span style="color: var(--clr-comment); background-color: var(--bg-comment);">"JAVA_HOME"))</span>
  <span style="color: #ffffff;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org2fddd2a" class="outline-3">
<h3 id="org2fddd2a"><span class="section-number-3">4.7</span> no littering</h3>
<div class="outline-text-3" id="text-4-7">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #ffffff;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">use-package</span> <span style="color: var(--clr-constant); background-color: var(--bg-constant);">no-littering</span><span style="color: #ffffff;">)</span>
</pre>
</div>
</div>
</div>
</div>
