readme.org
** general
In this block we load ~general~ and define bindings for generic commands e.g. ~find-file~.
The commands provided by packages should be binded in the ~use-package~ block, thanks to the ~:general~ keyword.
NOTE: We need to load ~general~ before ~evil~, otherwise the ~:general~ keyword in the ~use-package~ blocks won't work.

#+BEGIN_SRC emacs-lisp
  (use-package general
    :demand t
    :config
    (general-evil-setup)

    (general-create-definer my/leader-keys
      :states '(normal insert visual emacs)
      :keymaps 'override
      :prefix "SPC"
      :global-prefix "C-SPC")

    (general-create-definer my/local-leader-keys
      :states '(normal visual)
      :keymaps 'override
      :prefix ","
      :global-prefix "SPC m")

    (my/leader-keys
      "SPC" '(execute-extended-command :which-key "execute command")
      "`" '(switch-to-prev-buffer :which-key "prev buffer")
      ";" '(eval-expression :which-key "eval sexp")

      "b" '(:ignore t :which-key "buffer")
      "br"  'revert-buffer
      "bd"  'kill-current-buffer
      "bD" 'kill-buffer-and-window
      "bs" '((lambda () (interactive) (pop-to-buffer "*scratch*")) :wk "scratch")

      "c" '(:ignore t :which-key "code")

      "f" '(:ignore t :which-key "file")
      "fD" '(delete-file :wk "delete")
      "ff"  'find-file
      "fs" 'save-buffer
      "fr" 'recentf-open-files

      "g" '(:ignore t :which-key "git")

      "h" '(:ignore t :which-key "describe")
      "hv" 'describe-variable
      "he" 'view-echo-area-messages
      "hp" 'describe-package
      "hf" 'describe-function
      "hF" 'describe-face
      "hk" 'describe-key

      "o" '(:ignore t :which-key "org")

      "p" '(:ignore t :which-key "project")

      "s" '(:ignore t :which-key "search")

      "t"  '(:ignore t :which-key "toggle")
      "t d"  '(toggle-debug-on-error :which-key "debug on error")
      "t v" '((lambda () (interactive) (visual-line-mode 'toggle)) :wk "visual line")

      "w" '(:ignore t :which-key "window")
      "wl"  'windmove-right
      "wh"  'windmove-left
      "wk"  'windmove-up
      "wj"  'windmove-down
      "wr" 'winner-redo
      "wd"  'delete-window
      "wD" 'kill-buffer-and-window
      "wu" 'winner-undo
      "wr" 'winner-redo
      "wm"  '(delete-other-windows :wk "maximize")
      )

    (my/local-leader-keys
      "d" '(:ignore t :which-key "debug")
      "e" '(:ignore t :which-key "eval")
      "t" '(:ignore t :which-key "test")
      )
    )
#+END_SRC

