readme.html

<div id="outline-container-org4c2e827" class="outline-2">
<h2 id="org4c2e827"><span class="section-number-2">5</span> Keybindings</h2>
<div class="outline-text-2" id="text-5">
</div>
<div id="outline-container-org119742f" class="outline-3">
<h3 id="org119742f"><span class="section-number-3">5.1</span> general</h3>
<div class="outline-text-3" id="text-5-1">
<p>
In this block we load <code>general</code> and define bindings for generic commands e.g. <code>find-file</code>.
The commands provided by packages should be binded in the <code>use-package</code> block, thanks to the <code>:general</code> keyword.
NOTE: We need to load <code>general</code> before <code>evil</code>, otherwise the <code>:general</code> keyword in the <code>use-package</code> blocks won't work.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #ffffff;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">use-package</span> <span style="color: var(--clr-constant); background-color: var(--bg-constant);">general</span>
  <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:demand</span> t
  <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:config</span>
  <span style="color: #ff62d4;">(</span>general-evil-setup<span style="color: #ff62d4;">)</span>

  <span style="color: #ff62d4;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">general-create-definer</span> my/leader-keys
    <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:states</span> '<span style="color: #3fdfd0;">(</span>normal insert visual emacs<span style="color: #3fdfd0;">)</span>
    <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:keymaps</span> 'override
    <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:prefix</span> <span style="color: var(--clr-string); background-color: var(--bg-string);">"SPC"</span>
    <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:global-prefix</span> <span style="color: var(--clr-string); background-color: var(--bg-string);">"C-SPC"</span><span style="color: #ff62d4;">)</span>

  <span style="color: #ff62d4;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">general-create-definer</span> my/local-leader-keys
    <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:states</span> '<span style="color: #3fdfd0;">(</span>normal visual<span style="color: #3fdfd0;">)</span>
    <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:keymaps</span> 'override
    <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:prefix</span> <span style="color: var(--clr-string); background-color: var(--bg-string);">","</span>
    <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:global-prefix</span> <span style="color: var(--clr-string); background-color: var(--bg-string);">"SPC m"</span><span style="color: #ff62d4;">)</span>

  <span style="color: #ff62d4;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">my/leader-keys</span>
    <span style="color: var(--clr-string); background-color: var(--bg-string);">"SPC"</span> '<span style="color: #3fdfd0;">(</span>execute-extended-command <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:which-key</span> <span style="color: var(--clr-string); background-color: var(--bg-string);">"execute command"</span><span style="color: #3fdfd0;">)</span>
    <span style="color: var(--clr-string); background-color: var(--bg-string);">"`"</span> '<span style="color: #3fdfd0;">(</span>switch-to-prev-buffer <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:which-key</span> <span style="color: var(--clr-string); background-color: var(--bg-string);">"prev buffer"</span><span style="color: #3fdfd0;">)</span>
    <span style="color: var(--clr-string); background-color: var(--bg-string);">";"</span> '<span style="color: #3fdfd0;">(</span>eval-expression <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:which-key</span> <span style="color: var(--clr-string); background-color: var(--bg-string);">"eval sexp"</span><span style="color: #3fdfd0;">)</span>

    <span style="color: var(--clr-string); background-color: var(--bg-string);">"b"</span> '<span style="color: #3fdfd0;">(</span><span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:ignore</span> t <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:which-key</span> <span style="color: var(--clr-string); background-color: var(--bg-string);">"buffer"</span><span style="color: #3fdfd0;">)</span>
    <span style="color: var(--clr-string); background-color: var(--bg-string);">"br"</span>  'revert-buffer
    <span style="color: var(--clr-string); background-color: var(--bg-string);">"bd"</span>  'kill-current-buffer
    <span style="color: var(--clr-string); background-color: var(--bg-string);">"bD"</span> 'kill-buffer-and-window
    <span style="color: var(--clr-string); background-color: var(--bg-string);">"bs"</span> '<span style="color: #3fdfd0;">(</span><span style="color: #fba849;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">lambda</span> <span style="color: #9f80ff;">()</span> <span style="color: #9f80ff;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">interactive</span><span style="color: #9f80ff;">)</span> <span style="color: #9f80ff;">(</span>pop-to-buffer <span style="color: var(--clr-string); background-color: var(--bg-string);">"*scratch*"</span><span style="color: #9f80ff;">)</span><span style="color: #fba849;">)</span> <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:wk</span> <span style="color: var(--clr-string); background-color: var(--bg-string);">"scratch"</span><span style="color: #3fdfd0;">)</span>

    <span style="color: var(--clr-string); background-color: var(--bg-string);">"c"</span> '<span style="color: #3fdfd0;">(</span><span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:ignore</span> t <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:which-key</span> <span style="color: var(--clr-string); background-color: var(--bg-string);">"code"</span><span style="color: #3fdfd0;">)</span>

    <span style="color: var(--clr-string); background-color: var(--bg-string);">"f"</span> '<span style="color: #3fdfd0;">(</span><span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:ignore</span> t <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:which-key</span> <span style="color: var(--clr-string); background-color: var(--bg-string);">"file"</span><span style="color: #3fdfd0;">)</span>
    <span style="color: var(--clr-string); background-color: var(--bg-string);">"fD"</span> '<span style="color: #3fdfd0;">(</span>delete-file <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:wk</span> <span style="color: var(--clr-string); background-color: var(--bg-string);">"delete"</span><span style="color: #3fdfd0;">)</span>
    <span style="color: var(--clr-string); background-color: var(--bg-string);">"ff"</span>  'find-file
    <span style="color: var(--clr-string); background-color: var(--bg-string);">"fs"</span> 'save-buffer
    <span style="color: var(--clr-string); background-color: var(--bg-string);">"fr"</span> 'recentf-open-files

    <span style="color: var(--clr-string); background-color: var(--bg-string);">"g"</span> '<span style="color: #3fdfd0;">(</span><span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:ignore</span> t <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:which-key</span> <span style="color: var(--clr-string); background-color: var(--bg-string);">"git"</span><span style="color: #3fdfd0;">)</span>

    <span style="color: var(--clr-string); background-color: var(--bg-string);">"h"</span> '<span style="color: #3fdfd0;">(</span><span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:ignore</span> t <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:which-key</span> <span style="color: var(--clr-string); background-color: var(--bg-string);">"describe"</span><span style="color: #3fdfd0;">)</span>
    <span style="color: var(--clr-string); background-color: var(--bg-string);">"hv"</span> 'describe-variable
    <span style="color: var(--clr-string); background-color: var(--bg-string);">"he"</span> 'view-echo-area-messages
    <span style="color: var(--clr-string); background-color: var(--bg-string);">"hp"</span> 'describe-package
    <span style="color: var(--clr-string); background-color: var(--bg-string);">"hf"</span> 'describe-function
    <span style="color: var(--clr-string); background-color: var(--bg-string);">"hF"</span> 'describe-face
    <span style="color: var(--clr-string); background-color: var(--bg-string);">"hk"</span> 'describe-key

    <span style="color: var(--clr-string); background-color: var(--bg-string);">"o"</span> '<span style="color: #3fdfd0;">(</span><span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:ignore</span> t <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:which-key</span> <span style="color: var(--clr-string); background-color: var(--bg-string);">"org"</span><span style="color: #3fdfd0;">)</span>

    <span style="color: var(--clr-string); background-color: var(--bg-string);">"p"</span> '<span style="color: #3fdfd0;">(</span><span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:ignore</span> t <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:which-key</span> <span style="color: var(--clr-string); background-color: var(--bg-string);">"project"</span><span style="color: #3fdfd0;">)</span>

    <span style="color: var(--clr-string); background-color: var(--bg-string);">"s"</span> '<span style="color: #3fdfd0;">(</span><span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:ignore</span> t <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:which-key</span> <span style="color: var(--clr-string); background-color: var(--bg-string);">"search"</span><span style="color: #3fdfd0;">)</span>

    <span style="color: var(--clr-string); background-color: var(--bg-string);">"t"</span>  '<span style="color: #3fdfd0;">(</span><span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:ignore</span> t <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:which-key</span> <span style="color: var(--clr-string); background-color: var(--bg-string);">"toggle"</span><span style="color: #3fdfd0;">)</span>
    <span style="color: var(--clr-string); background-color: var(--bg-string);">"t d"</span>  '<span style="color: #3fdfd0;">(</span>toggle-debug-on-error <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:which-key</span> <span style="color: var(--clr-string); background-color: var(--bg-string);">"debug on error"</span><span style="color: #3fdfd0;">)</span>
    <span style="color: var(--clr-string); background-color: var(--bg-string);">"t v"</span> '<span style="color: #3fdfd0;">(</span><span style="color: #fba849;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">lambda</span> <span style="color: #9f80ff;">()</span> <span style="color: #9f80ff;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">interactive</span><span style="color: #9f80ff;">)</span> <span style="color: #9f80ff;">(</span>visual-line-mode 'toggle<span style="color: #9f80ff;">)</span><span style="color: #fba849;">)</span> <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:wk</span> <span style="color: var(--clr-string); background-color: var(--bg-string);">"visual line"</span><span style="color: #3fdfd0;">)</span>

    <span style="color: var(--clr-string); background-color: var(--bg-string);">"w"</span> '<span style="color: #3fdfd0;">(</span><span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:ignore</span> t <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:which-key</span> <span style="color: var(--clr-string); background-color: var(--bg-string);">"window"</span><span style="color: #3fdfd0;">)</span>
    <span style="color: var(--clr-string); background-color: var(--bg-string);">"wl"</span>  'windmove-right
    <span style="color: var(--clr-string); background-color: var(--bg-string);">"wh"</span>  'windmove-left
    <span style="color: var(--clr-string); background-color: var(--bg-string);">"wk"</span>  'windmove-up
    <span style="color: var(--clr-string); background-color: var(--bg-string);">"wj"</span>  'windmove-down
    <span style="color: var(--clr-string); background-color: var(--bg-string);">"wr"</span> 'winner-redo
    <span style="color: var(--clr-string); background-color: var(--bg-string);">"wd"</span>  'delete-window
    <span style="color: var(--clr-string); background-color: var(--bg-string);">"wD"</span> 'kill-buffer-and-window
    <span style="color: var(--clr-string); background-color: var(--bg-string);">"wu"</span> 'winner-undo
    <span style="color: var(--clr-string); background-color: var(--bg-string);">"wr"</span> 'winner-redo
    <span style="color: var(--clr-string); background-color: var(--bg-string);">"wm"</span>  '<span style="color: #3fdfd0;">(</span>delete-other-windows <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:wk</span> <span style="color: var(--clr-string); background-color: var(--bg-string);">"maximize"</span><span style="color: #3fdfd0;">)</span>
    <span style="color: #ff62d4;">)</span>

  <span style="color: #ff62d4;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">my/local-leader-keys</span>
    <span style="color: var(--clr-string); background-color: var(--bg-string);">"d"</span> '<span style="color: #3fdfd0;">(</span><span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:ignore</span> t <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:which-key</span> <span style="color: var(--clr-string); background-color: var(--bg-string);">"debug"</span><span style="color: #3fdfd0;">)</span>
    <span style="color: var(--clr-string); background-color: var(--bg-string);">"e"</span> '<span style="color: #3fdfd0;">(</span><span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:ignore</span> t <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:which-key</span> <span style="color: var(--clr-string); background-color: var(--bg-string);">"eval"</span><span style="color: #3fdfd0;">)</span>
    <span style="color: var(--clr-string); background-color: var(--bg-string);">"t"</span> '<span style="color: #3fdfd0;">(</span><span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:ignore</span> t <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:which-key</span> <span style="color: var(--clr-string); background-color: var(--bg-string);">"test"</span><span style="color: #3fdfd0;">)</span>
    <span style="color: #ff62d4;">)</span>
  <span style="color: #ffffff;">)</span>
</pre>
</div>
</div>
</div>
