readme.html

<div id="outline-container-orge4a2e0b" class="outline-3">
<h3 id="orge4a2e0b"><span class="section-number-3">5.2</span> evil mode</h3>
<div class="outline-text-3" id="text-5-2">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #ffffff;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">use-package</span> <span style="color: var(--clr-constant); background-color: var(--bg-constant);">evil</span>
  <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:demand</span> t
  <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:general</span>
  <span style="color: #ff62d4;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">my/leader-keys</span>
    <span style="color: var(--clr-string); background-color: var(--bg-string);">"wv"</span> 'evil-window-vsplit
    <span style="color: var(--clr-string); background-color: var(--bg-string);">"ws"</span> 'evil-window-split<span style="color: #ff62d4;">)</span>
  <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:init</span>
  <span style="color: #ff62d4;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">setq</span> evil-want-integration t<span style="color: #ff62d4;">)</span>
  <span style="color: #ff62d4;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">setq</span> evil-want-keybinding nil<span style="color: #ff62d4;">)</span>
  <span style="color: #ff62d4;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">setq</span> evil-want-C-u-scroll t<span style="color: #ff62d4;">)</span>
  <span style="color: #ff62d4;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">setq</span> evil-want-C-i-jump nil<span style="color: #ff62d4;">)</span>
  <span style="color: #ff62d4;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">setq</span> evil-want-Y-yank-to-eol t<span style="color: #ff62d4;">)</span>
  <span style="color: var(--clr-comment-delimiter); background-color: var(--bg-comment-delimiter);">;; </span><span style="color: var(--clr-comment); background-color: var(--bg-comment);">move to window when splitting</span>
  <span style="color: #ff62d4;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">setq</span> evil-split-window-below t<span style="color: #ff62d4;">)</span>
  <span style="color: #ff62d4;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">setq</span> evil-vsplit-window-right t<span style="color: #ff62d4;">)</span>
  <span style="color: #ff62d4;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">setq-local</span> evil-scroll-count 0<span style="color: #ff62d4;">)</span>
  <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:config</span>
  <span style="color: #ff62d4;">(</span>evil-mode 1<span style="color: #ff62d4;">)</span>
  <span style="color: #ff62d4;">(</span>define-key evil-insert-state-map <span style="color: #3fdfd0;">(</span>kbd <span style="color: var(--clr-string); background-color: var(--bg-string);">"C-g"</span><span style="color: #3fdfd0;">)</span> 'evil-normal-state<span style="color: #ff62d4;">)</span>
  <span style="color: #ff62d4;">(</span>define-key evil-insert-state-map <span style="color: #3fdfd0;">(</span>kbd <span style="color: var(--clr-string); background-color: var(--bg-string);">"C-h"</span><span style="color: #3fdfd0;">)</span> 'evil-delete-backward-char-and-join<span style="color: #ff62d4;">)</span>
  <span style="color: var(--clr-comment-delimiter); background-color: var(--bg-comment-delimiter);">;; </span><span style="color: var(--clr-comment); background-color: var(--bg-comment);">Use visual line motions even outside of visual-line-mode buffers</span>
  <span style="color: var(--clr-comment-delimiter); background-color: var(--bg-comment-delimiter);">;; </span><span style="color: var(--clr-comment); background-color: var(--bg-comment);">(evil-global-set-key 'motion "j" 'evil-next-visual-line)</span>
  <span style="color: var(--clr-comment-delimiter); background-color: var(--bg-comment-delimiter);">;; </span><span style="color: var(--clr-comment); background-color: var(--bg-comment);">(evil-global-set-key 'motion "k" 'evil-previous-visual-line)</span>
  <span style="color: #ff62d4;">(</span>evil-set-initial-state 'messages-buffer-mode 'normal<span style="color: #ff62d4;">)</span>
  <span style="color: #ff62d4;">(</span>evil-set-initial-state 'dashboard-mode 'normal<span style="color: #ff62d4;">)</span>
  <span style="color: #ffffff;">)</span>

<span style="color: #ffffff;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">use-package</span> <span style="color: var(--clr-constant); background-color: var(--bg-constant);">evil-collection</span>
  <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:after</span> evil
  <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:demand</span>
  <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:config</span>
  <span style="color: #ff62d4;">(</span>evil-collection-init<span style="color: #ff62d4;">)</span><span style="color: #ffffff;">)</span>

<span style="color: #ffffff;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">use-package</span> <span style="color: var(--clr-constant); background-color: var(--bg-constant);">evil-goggles</span>
  <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:after</span> evil
  <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:demand</span>
  <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:init</span>
  <span style="color: #ff62d4;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">setq</span> evil-goggles-duration 0.05<span style="color: #ff62d4;">)</span>
  <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:config</span>
  <span style="color: #ff62d4;">(</span>evil-goggles-mode<span style="color: #ff62d4;">)</span>
  <span style="color: #ff62d4;">(</span>evil-goggles-use-diff-faces<span style="color: #ff62d4;">)</span><span style="color: #ffffff;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org326a508" class="outline-3">
<h3 id="org326a508"><span class="section-number-3">5.3</span> which-key</h3>
<div class="outline-text-3" id="text-5-3">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #ffffff;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">use-package</span> <span style="color: var(--clr-constant); background-color: var(--bg-constant);">which-key</span>
  <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:demand</span> t
  <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:init</span>
  <span style="color: #ff62d4;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">setq</span> which-key-separator <span style="color: var(--clr-string); background-color: var(--bg-string);">" "</span><span style="color: #ff62d4;">)</span>
  <span style="color: #ff62d4;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">setq</span> which-key-prefix-prefix <span style="color: var(--clr-string); background-color: var(--bg-string);">"+"</span><span style="color: #ff62d4;">)</span>
  <span style="color: var(--clr-comment-delimiter); background-color: var(--bg-comment-delimiter);">;; </span><span style="color: var(--clr-comment); background-color: var(--bg-comment);">(setq which-key-idle-delay 0.5)</span>
  <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:config</span>
  <span style="color: #ff62d4;">(</span>which-key-mode<span style="color: #ff62d4;">)</span><span style="color: #ffffff;">)</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org79b96b3" class="outline-2">
<h2 id="org79b96b3"><span class="section-number-2">6</span> UI</h2>
<div class="outline-text-2" id="text-6">
</div>
<div id="outline-container-orge60ca02" class="outline-3">
<h3 id="orge60ca02"><span class="section-number-3">6.1</span> all the icons</h3>
<div class="outline-text-3" id="text-6-1">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #ffffff;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">use-package</span> <span style="color: var(--clr-constant); background-color: var(--bg-constant);">all-the-icons</span><span style="color: #ffffff;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org4a48368" class="outline-3">
<h3 id="org4a48368"><span class="section-number-3">6.2</span> doom modeline</h3>
<div class="outline-text-3" id="text-6-2">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #ffffff;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">use-package</span> <span style="color: var(--clr-constant); background-color: var(--bg-constant);">doom-modeline</span>
  <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:demand</span>
  <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:init</span>
  <span style="color: #ff62d4;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">setq</span> doom-modeline-buffer-encoding nil<span style="color: #ff62d4;">)</span>
  <span style="color: #ff62d4;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">setq</span> doom-modeline-env-enable-python nil<span style="color: #ff62d4;">)</span>
  <span style="color: #ff62d4;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">setq</span> doom-modeline-height 15<span style="color: #ff62d4;">)</span>
  <span style="color: #ff62d4;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">setq</span> doom-modeline-project-detection 'projectile<span style="color: #ff62d4;">)</span>
  <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:config</span>
  <span style="color: #ff62d4;">(</span>doom-modeline-mode 1<span style="color: #ff62d4;">)</span><span style="color: #ffffff;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org0c4200f" class="outline-3">
<h3 id="org0c4200f"><span class="section-number-3">6.3</span> Fancy titlebar for macOS</h3>
<div class="outline-text-3" id="text-6-3">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #ffffff;">(</span>add-to-list 'default-frame-alist '<span style="color: #ff62d4;">(</span>ns-transparent-titlebar . t<span style="color: #ff62d4;">)</span><span style="color: #ffffff;">)</span>
<span style="color: #ffffff;">(</span>add-to-list 'default-frame-alist '<span style="color: #ff62d4;">(</span>ns-appearance . dark<span style="color: #ff62d4;">)</span><span style="color: #ffffff;">)</span>
<span style="color: #ffffff;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">setq</span> ns-use-proxy-icon  nil<span style="color: #ffffff;">)</span>
<span style="color: #ffffff;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">setq</span> frame-title-format nil<span style="color: #ffffff;">)</span>
</pre>
</div>
</div>
</div>
