readme.org
** Modus themes
#+BEGIN_SRC emacs-lisp
  (use-package modus-themes
    :straight (modus-themes :type git :host gitlab :repo "protesilaos/modus-themes" :branch "main")
    :hook (emacs-startup . my/load-modus-theme)
    :init
    (setq modus-themes-operandi-color-overrides
          '((bg-main . "#fefcf4")
            (bg-dim . "#faf6ef")
            (bg-alt . "#f7efe5")
            (bg-hl-line . "#f4f0e3")
            (bg-active . "#e8dfd1")
            (bg-inactive . "#f6ece5")
            (bg-region . "#c6bab1")
            (bg-header . "#ede3e0")
            (bg-tab-bar . "#dcd3d3")
            (bg-tab-active . "#fdf6eb")
            (bg-tab-inactive . "#c8bab8")
            (fg-unfocused ."#55556f")))

    (setq modus-themes-vivendi-color-overrides
          '((bg-main . "#100b17")
            (bg-dim . "#161129")
            (bg-alt . "#181732")
            (bg-hl-line . "#191628")
            (bg-active . "#282e46")
            (bg-inactive . "#1a1e39")
            (bg-region . "#393a53")
            (bg-header . "#202037")
            (bg-tab-bar . "#262b41")
            (bg-tab-active . "#120f18")
            (bg-tab-inactive . "#3a3a5a")
            (fg-unfocused . "#9a9aab")))
    (setq modus-themes-slanted-constructs t
          modus-themes-bold-constructs t
          modus-themes-fringes 'nil ; {nil,'subtle,'intense}
          modus-themes-mode-line '3d ; {nil,'3d,'moody}
          modus-themes-intense-hl-line nil
          modus-themes-prompts nil ; {nil,'subtle,'intense}
          modus-themes-completions 'moderate ; {nil,'moderate,'opinionated}
          modus-themes-diffs nil ; {nil,'desaturated,'fg-only}
          modus-themes-org-blocks 'greyscale ; {nil,'greyscale,'rainbow}
          modus-themes-headings  ; Read further below in the manual for this one
          '((1 . line)
            (t . rainbow-line-no-bold))
          modus-themes-variable-pitch-headings nil
          modus-themes-scale-headings t
          modus-themes-scale-1 1.1
          modus-themes-scale-2 1.15
          modus-themes-scale-3 1.21
          modus-themes-scale-4 1.27
          modus-themes-scale-5 1.33)
    (defun my/load-modus-theme ()
      ;;Light for the day
      (run-at-time "07:00" (* 60 60 24)
                   (lambda () (modus-themes-load-operandi)))
      ;; Dark for the night
      (run-at-time "00:00" (* 60 60 24)
                   (lambda () (modus-themes-load-vivendi)))
      (run-at-time "15:00" (* 60 60 24)
                   (lambda () (modus-themes-load-vivendi)))
      ))
#+END_SRC

