readme.html

<div id="outline-container-org62b47df" class="outline-3">
<h3 id="org62b47df"><span class="section-number-3">6.4</span> Modus themes</h3>
<div class="outline-text-3" id="text-6-4">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #ffffff;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">use-package</span> <span style="color: var(--clr-constant); background-color: var(--bg-constant);">modus-themes</span>
  <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:straight</span> <span style="color: #ff62d4;">(</span>modus-themes <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:type</span> git <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:host</span> gitlab <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:repo</span> <span style="color: var(--clr-string); background-color: var(--bg-string);">"protesilaos/modus-themes"</span> <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:branch</span> <span style="color: var(--clr-string); background-color: var(--bg-string);">"main"</span><span style="color: #ff62d4;">)</span>
  <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:hook</span> <span style="color: #ff62d4;">(</span>emacs-startup . my/load-modus-theme<span style="color: #ff62d4;">)</span>
  <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:init</span>
  <span style="color: #ff62d4;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">setq</span> modus-themes-operandi-color-overrides
        '<span style="color: #3fdfd0;">(</span><span style="color: #fba849;">(</span>bg-main . <span style="color: var(--clr-string); background-color: var(--bg-string);">"#fefcf4"</span><span style="color: #fba849;">)</span>
          <span style="color: #fba849;">(</span>bg-dim . <span style="color: var(--clr-string); background-color: var(--bg-string);">"#faf6ef"</span><span style="color: #fba849;">)</span>
          <span style="color: #fba849;">(</span>bg-alt . <span style="color: var(--clr-string); background-color: var(--bg-string);">"#f7efe5"</span><span style="color: #fba849;">)</span>
          <span style="color: #fba849;">(</span>bg-hl-line . <span style="color: var(--clr-string); background-color: var(--bg-string);">"#f4f0e3"</span><span style="color: #fba849;">)</span>
          <span style="color: #fba849;">(</span>bg-active . <span style="color: var(--clr-string); background-color: var(--bg-string);">"#e8dfd1"</span><span style="color: #fba849;">)</span>
          <span style="color: #fba849;">(</span>bg-inactive . <span style="color: var(--clr-string); background-color: var(--bg-string);">"#f6ece5"</span><span style="color: #fba849;">)</span>
          <span style="color: #fba849;">(</span>bg-region . <span style="color: var(--clr-string); background-color: var(--bg-string);">"#c6bab1"</span><span style="color: #fba849;">)</span>
          <span style="color: #fba849;">(</span>bg-header . <span style="color: var(--clr-string); background-color: var(--bg-string);">"#ede3e0"</span><span style="color: #fba849;">)</span>
          <span style="color: #fba849;">(</span>bg-tab-bar . <span style="color: var(--clr-string); background-color: var(--bg-string);">"#dcd3d3"</span><span style="color: #fba849;">)</span>
          <span style="color: #fba849;">(</span>bg-tab-active . <span style="color: var(--clr-string); background-color: var(--bg-string);">"#fdf6eb"</span><span style="color: #fba849;">)</span>
          <span style="color: #fba849;">(</span>bg-tab-inactive . <span style="color: var(--clr-string); background-color: var(--bg-string);">"#c8bab8"</span><span style="color: #fba849;">)</span>
          <span style="color: #fba849;">(</span>fg-unfocused .<span style="color: var(--clr-string); background-color: var(--bg-string);">"#55556f"</span><span style="color: #fba849;">)</span><span style="color: #3fdfd0;">)</span><span style="color: #ff62d4;">)</span>

  <span style="color: #ff62d4;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">setq</span> modus-themes-vivendi-color-overrides
        '<span style="color: #3fdfd0;">(</span><span style="color: #fba849;">(</span>bg-main . <span style="color: var(--clr-string); background-color: var(--bg-string);">"#100b17"</span><span style="color: #fba849;">)</span>
          <span style="color: #fba849;">(</span>bg-dim . <span style="color: var(--clr-string); background-color: var(--bg-string);">"#161129"</span><span style="color: #fba849;">)</span>
          <span style="color: #fba849;">(</span>bg-alt . <span style="color: var(--clr-string); background-color: var(--bg-string);">"#181732"</span><span style="color: #fba849;">)</span>
          <span style="color: #fba849;">(</span>bg-hl-line . <span style="color: var(--clr-string); background-color: var(--bg-string);">"#191628"</span><span style="color: #fba849;">)</span>
          <span style="color: #fba849;">(</span>bg-active . <span style="color: var(--clr-string); background-color: var(--bg-string);">"#282e46"</span><span style="color: #fba849;">)</span>
          <span style="color: #fba849;">(</span>bg-inactive . <span style="color: var(--clr-string); background-color: var(--bg-string);">"#1a1e39"</span><span style="color: #fba849;">)</span>
          <span style="color: #fba849;">(</span>bg-region . <span style="color: var(--clr-string); background-color: var(--bg-string);">"#393a53"</span><span style="color: #fba849;">)</span>
          <span style="color: #fba849;">(</span>bg-header . <span style="color: var(--clr-string); background-color: var(--bg-string);">"#202037"</span><span style="color: #fba849;">)</span>
          <span style="color: #fba849;">(</span>bg-tab-bar . <span style="color: var(--clr-string); background-color: var(--bg-string);">"#262b41"</span><span style="color: #fba849;">)</span>
          <span style="color: #fba849;">(</span>bg-tab-active . <span style="color: var(--clr-string); background-color: var(--bg-string);">"#120f18"</span><span style="color: #fba849;">)</span>
          <span style="color: #fba849;">(</span>bg-tab-inactive . <span style="color: var(--clr-string); background-color: var(--bg-string);">"#3a3a5a"</span><span style="color: #fba849;">)</span>
          <span style="color: #fba849;">(</span>fg-unfocused . <span style="color: var(--clr-string); background-color: var(--bg-string);">"#9a9aab"</span><span style="color: #fba849;">)</span><span style="color: #3fdfd0;">)</span><span style="color: #ff62d4;">)</span>
  <span style="color: #ff62d4;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">setq</span> modus-themes-slanted-constructs t
        modus-themes-bold-constructs t
        modus-themes-fringes 'nil <span style="color: var(--clr-comment-delimiter); background-color: var(--bg-comment-delimiter);">; </span><span style="color: var(--clr-comment); background-color: var(--bg-comment);">{nil,'subtle,'intense}</span>
        modus-themes-mode-line '3d <span style="color: var(--clr-comment-delimiter); background-color: var(--bg-comment-delimiter);">; </span><span style="color: var(--clr-comment); background-color: var(--bg-comment);">{nil,'3d,'moody}</span>
        modus-themes-intense-hl-line nil
        modus-themes-prompts nil <span style="color: var(--clr-comment-delimiter); background-color: var(--bg-comment-delimiter);">; </span><span style="color: var(--clr-comment); background-color: var(--bg-comment);">{nil,'subtle,'intense}</span>
        modus-themes-completions 'moderate <span style="color: var(--clr-comment-delimiter); background-color: var(--bg-comment-delimiter);">; </span><span style="color: var(--clr-comment); background-color: var(--bg-comment);">{nil,'moderate,'opinionated}</span>
        modus-themes-diffs nil <span style="color: var(--clr-comment-delimiter); background-color: var(--bg-comment-delimiter);">; </span><span style="color: var(--clr-comment); background-color: var(--bg-comment);">{nil,'desaturated,'fg-only}</span>
        modus-themes-org-blocks 'greyscale <span style="color: var(--clr-comment-delimiter); background-color: var(--bg-comment-delimiter);">; </span><span style="color: var(--clr-comment); background-color: var(--bg-comment);">{nil,'greyscale,'rainbow}</span>
        modus-themes-headings  <span style="color: var(--clr-comment-delimiter); background-color: var(--bg-comment-delimiter);">; </span><span style="color: var(--clr-comment); background-color: var(--bg-comment);">Read further below in the manual for this one</span>
        '<span style="color: #3fdfd0;">(</span><span style="color: #fba849;">(</span>1 . line<span style="color: #fba849;">)</span>
          <span style="color: #fba849;">(</span>t . rainbow-line-no-bold<span style="color: #fba849;">)</span><span style="color: #3fdfd0;">)</span>
        modus-themes-variable-pitch-headings nil
        modus-themes-scale-headings t
        modus-themes-scale-1 1.1
        modus-themes-scale-2 1.15
        modus-themes-scale-3 1.21
        modus-themes-scale-4 1.27
        modus-themes-scale-5 1.33<span style="color: #ff62d4;">)</span>
  <span style="color: #ff62d4;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">defun</span> <span style="color: var(--function-clr-name); background-color: var(--function-bg-name);">my/load-modus-theme</span> <span style="color: #3fdfd0;">()</span>
    <span style="color: var(--clr-comment-delimiter); background-color: var(--bg-comment-delimiter);">;;</span><span style="color: var(--clr-comment); background-color: var(--bg-comment);">Light for the day</span>
    <span style="color: #3fdfd0;">(</span>run-at-time <span style="color: var(--clr-string); background-color: var(--bg-string);">"07:00"</span> <span style="color: #fba849;">(</span>* 60 60 24<span style="color: #fba849;">)</span>
                 <span style="color: #fba849;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">lambda</span> <span style="color: #9f80ff;">()</span> <span style="color: #9f80ff;">(</span>modus-themes-load-operandi<span style="color: #9f80ff;">)</span><span style="color: #fba849;">)</span><span style="color: #3fdfd0;">)</span>
    <span style="color: var(--clr-comment-delimiter); background-color: var(--bg-comment-delimiter);">;; </span><span style="color: var(--clr-comment); background-color: var(--bg-comment);">Dark for the night</span>
    <span style="color: #3fdfd0;">(</span>run-at-time <span style="color: var(--clr-string); background-color: var(--bg-string);">"00:00"</span> <span style="color: #fba849;">(</span>* 60 60 24<span style="color: #fba849;">)</span>
                 <span style="color: #fba849;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">lambda</span> <span style="color: #9f80ff;">()</span> <span style="color: #9f80ff;">(</span>modus-themes-load-vivendi<span style="color: #9f80ff;">)</span><span style="color: #fba849;">)</span><span style="color: #3fdfd0;">)</span>
    <span style="color: #3fdfd0;">(</span>run-at-time <span style="color: var(--clr-string); background-color: var(--bg-string);">"15:00"</span> <span style="color: #fba849;">(</span>* 60 60 24<span style="color: #fba849;">)</span>
                 <span style="color: #fba849;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">lambda</span> <span style="color: #9f80ff;">()</span> <span style="color: #9f80ff;">(</span>modus-themes-load-vivendi<span style="color: #9f80ff;">)</span><span style="color: #fba849;">)</span><span style="color: #3fdfd0;">)</span>
    <span style="color: #ff62d4;">)</span><span style="color: #ffffff;">)</span>
</pre>
</div>
</div>
</div>
