readme.org
** dashboard
#+BEGIN_SRC emacs-lisp
  (use-package dashboard
    :after projectile
    :demand
    :init
    (setq initial-buffer-choice (lambda () (get-buffer "*dashboard*")))
    (setq dashboard-center-content t)
    (setq dashboard-projects-backend 'projectile)
    (setq dashboard-set-heading-icons t)
    (setq dashboard-set-file-icons t)
    (setq dashboard-items '((recents  . 5)
                            (bookmarks . 5)
                            (projects . 5)
                            ;; (agenda . 5)
                            ))
    ;; (setq dashboard-startup-banner [VALUE])
    :config
    (dashboard-setup-startup-hook))
#+END_SRC

** centaur tabs
#+begin_src emacs-lisp
  (use-package centaur-tabs
    :hook (emacs-startup . centaur-tabs-mode)
    :general
    (general-nmap "gt" 'centaur-tabs-forward
      "gT" 'centaur-tabs-backward)
    :init
    (setq centaur-tabs-set-icons t)
    (setq ccentaur-tabs-set-modified-marker t
          centaur-tabs-modified-marker "M"
          centaur-tabs-cycle-scope 'tabs)
    (setq centaur-tabs-set-close-button nil)
    :config
    (centaur-tabs-mode t)
    (centaur-tabs-group-by-projectile-project)
    )
#+end_src

** centered cursor mode
#+begin_src emacs-lisp
  (use-package centered-cursor-mode
    :general (my/leader-keys "t -" (lambda () (interactive) (centered-cursor-mode 'toggle))))
#+end_src

** hide mode line
#+begin_src emacs-lisp
  (use-package hide-mode-line
    :commands (hide-mode-line-mode))
#+end_src

