readme.html

<div id="outline-container-orgc093eef" class="outline-3">
<h3 id="orgc093eef"><span class="section-number-3">6.5</span> dashboard</h3>
<div class="outline-text-3" id="text-6-5">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #ffffff;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">use-package</span> <span style="color: var(--clr-constant); background-color: var(--bg-constant);">dashboard</span>
  <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:after</span> projectile
  <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:demand</span>
  <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:init</span>
  <span style="color: #ff62d4;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">setq</span> initial-buffer-choice <span style="color: #3fdfd0;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">lambda</span> <span style="color: #fba849;">()</span> <span style="color: #fba849;">(</span>get-buffer <span style="color: var(--clr-string); background-color: var(--bg-string);">"*dashboard*"</span><span style="color: #fba849;">)</span><span style="color: #3fdfd0;">)</span><span style="color: #ff62d4;">)</span>
  <span style="color: #ff62d4;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">setq</span> dashboard-center-content t<span style="color: #ff62d4;">)</span>
  <span style="color: #ff62d4;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">setq</span> dashboard-projects-backend 'projectile<span style="color: #ff62d4;">)</span>
  <span style="color: #ff62d4;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">setq</span> dashboard-set-heading-icons t<span style="color: #ff62d4;">)</span>
  <span style="color: #ff62d4;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">setq</span> dashboard-set-file-icons t<span style="color: #ff62d4;">)</span>
  <span style="color: #ff62d4;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">setq</span> dashboard-items '<span style="color: #3fdfd0;">(</span><span style="color: #fba849;">(</span>recents  . 5<span style="color: #fba849;">)</span>
                          <span style="color: #fba849;">(</span>bookmarks . 5<span style="color: #fba849;">)</span>
                          <span style="color: #fba849;">(</span>projects . 5<span style="color: #fba849;">)</span>
                          <span style="color: var(--clr-comment-delimiter); background-color: var(--bg-comment-delimiter);">;; </span><span style="color: var(--clr-comment); background-color: var(--bg-comment);">(agenda . 5)</span>
                          <span style="color: #3fdfd0;">)</span><span style="color: #ff62d4;">)</span>
  <span style="color: var(--clr-comment-delimiter); background-color: var(--bg-comment-delimiter);">;; </span><span style="color: var(--clr-comment); background-color: var(--bg-comment);">(setq dashboard-startup-banner [VALUE])</span>
  <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:config</span>
  <span style="color: #ff62d4;">(</span>dashboard-setup-startup-hook<span style="color: #ff62d4;">)</span><span style="color: #ffffff;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org6c7ba6e" class="outline-3">
<h3 id="org6c7ba6e"><span class="section-number-3">6.6</span> centaur tabs</h3>
<div class="outline-text-3" id="text-6-6">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #ffffff;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">use-package</span> <span style="color: var(--clr-constant); background-color: var(--bg-constant);">centaur-tabs</span>
  <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:hook</span> <span style="color: #ff62d4;">(</span>emacs-startup . centaur-tabs-mode<span style="color: #ff62d4;">)</span>
  <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:general</span>
  <span style="color: #ff62d4;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">general-nmap</span> <span style="color: var(--clr-string); background-color: var(--bg-string);">"gt"</span> 'centaur-tabs-forward
    <span style="color: var(--clr-string); background-color: var(--bg-string);">"gT"</span> 'centaur-tabs-backward<span style="color: #ff62d4;">)</span>
  <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:init</span>
  <span style="color: #ff62d4;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">setq</span> centaur-tabs-set-icons t<span style="color: #ff62d4;">)</span>
  <span style="color: #ff62d4;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">setq</span> ccentaur-tabs-set-modified-marker t
        centaur-tabs-modified-marker <span style="color: var(--clr-string); background-color: var(--bg-string);">"M"</span>
        centaur-tabs-cycle-scope 'tabs<span style="color: #ff62d4;">)</span>
  <span style="color: #ff62d4;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">setq</span> centaur-tabs-set-close-button nil<span style="color: #ff62d4;">)</span>
  <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:config</span>
  <span style="color: #ff62d4;">(</span>centaur-tabs-mode t<span style="color: #ff62d4;">)</span>
  <span style="color: #ff62d4;">(</span>centaur-tabs-group-by-projectile-project<span style="color: #ff62d4;">)</span>
  <span style="color: #ffffff;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org040c8f2" class="outline-3">
<h3 id="org040c8f2"><span class="section-number-3">6.7</span> centered cursor mode</h3>
<div class="outline-text-3" id="text-6-7">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #ffffff;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">use-package</span> <span style="color: var(--clr-constant); background-color: var(--bg-constant);">centered-cursor-mode</span>
  <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:general</span> <span style="color: #ff62d4;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">my/leader-keys</span> <span style="color: var(--clr-string); background-color: var(--bg-string);">"t -"</span> <span style="color: #3fdfd0;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">lambda</span> <span style="color: #fba849;">()</span> <span style="color: #fba849;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">interactive</span><span style="color: #fba849;">)</span> <span style="color: #fba849;">(</span>centered-cursor-mode 'toggle<span style="color: #fba849;">)</span><span style="color: #3fdfd0;">)</span><span style="color: #ff62d4;">)</span><span style="color: #ffffff;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org11e8161" class="outline-3">
<h3 id="org11e8161"><span class="section-number-3">6.8</span> hide mode line</h3>
<div class="outline-text-3" id="text-6-8">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #ffffff;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">use-package</span> <span style="color: var(--clr-constant); background-color: var(--bg-constant);">hide-mode-line</span>
  <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:commands</span> <span style="color: #ff62d4;">(</span>hide-mode-line-mode<span style="color: #ff62d4;">)</span><span style="color: #ffffff;">)</span>
</pre>
</div>
</div>
</div>
