readme.org
** popup management
Taken from https://github.com/gilbertw1/bmacs/blob/master/bmacs.org#popup-rules
#+begin_src emacs-lisp :tangle no
  (defvar my-popups '()
    "A list of popup matchers that determine if a popup can be escaped")


  (cl-defun my/make-popup (buffer-rx &optional (height 0.4))
    (add-to-list 'my-popups buffer-rx)
    (add-to-list 'display-buffer-alist
                 `(,buffer-rx
                   (display-buffer-reuse-window
                    display-buffer-in-side-window)
                   (reusable-frames . visible)
                   (side            . bottom)
                   (window-height   . ,height))))

  (my/make-popup (rx bos "*Messages*" eos))
  (my/make-popup (rx bos "*Backtrace*" eos))
  (my/make-popup (rx bos "*Warnings*" eos))
  (my/make-popup (rx bos "*compilation*" eos))
  (my/make-popup (rx bos "*Help*" eos))
  (my/make-popup (rx bos "*helpful*" eos))
  (my/make-popup (rx bos "*scratch*" eos) 0.4)
#+end_src

Taken from https://emacs.stackexchange.com/questions/46210/reuse-help-window
#+begin_src emacs-lisp
  (setq display-buffer-alist
        `((,(rx bos (or "*Apropos*" "*Help*" "*helpful" "*info*" "*Summary*") (0+ not-newline))
           (display-buffer-reuse-mode-window display-buffer-below-selected)
           (window-height . 0.33)
           (mode apropos-mode help-mode helpful-mode Info-mode Man-mode))))
#+end_src

#+begin_src emacs-lisp :tangle no
  (add-to-list 'display-buffer-alist
               '((lambda (buffer _) (with-current-buffer buffer
                                      (seq-some (lambda (mode)
                                                  (derived-mode-p mode))
                                                '(help-mode))))
                 (display-buffer-reuse-window display-buffer-below-selected)
                 (reusable-frames . visible)
                 (window-height . 0.33)))
#+end_src

** winum
#+begin_src emacs-lisp
(use-package winum
:general
(my/leader-keys
"1" '(winum-select-window-1 :wk "win 1")
"2" '(winum-select-window-2 :wk "win 2")
"3" '(winum-select-window-3 :wk "win 3"))
:config
(winum-mode))
#+end_src

** transpose frame
#+begin_src emacs-lisp
  (use-package transpose-frame
    :general
    (my/leader-keys
      "w t" '(transpose-frame "transpose")
      "w f" '(rotate-frame "flip")))
#+end_src

** persistent scratch
#+begin_src emacs-lisp
(use-package persistent-scratch
:demand
:config
(persistent-scratch-setup-default))
#+end_src

