readme.html

<div id="outline-container-org8c20a7d" class="outline-3">
<h3 id="org8c20a7d"><span class="section-number-3">6.9</span> popup management</h3>
<div class="outline-text-3" id="text-6-9">
<p>
Taken from <a href="https://github.com/gilbertw1/bmacs/blob/master/bmacs.org#popup-rules">https://github.com/gilbertw1/bmacs/blob/master/bmacs.org#popup-rules</a>
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #ffffff;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">defvar</span> <span style="color: var(--clr-variable); background-color: var(--bg-variable);">my-popups</span> '<span style="color: #ff62d4;">()</span>
  <span style="color: var(--clr-doc); background-color: var(--bg-doc);">"A list of popup matchers that determine if a popup can be escaped"</span><span style="color: #ffffff;">)</span>


<span style="color: #ffffff;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">cl-defun</span> <span style="color: var(--function-clr-name); background-color: var(--function-bg-name);">my/make-popup</span> <span style="color: #ff62d4;">(</span>buffer-rx <span style="color: #6ae4b9; font-weight: bold;">&amp;optional</span> <span style="color: #3fdfd0;">(</span>height 0.4<span style="color: #3fdfd0;">)</span><span style="color: #ff62d4;">)</span>
  <span style="color: #ff62d4;">(</span>add-to-list 'my-popups buffer-rx<span style="color: #ff62d4;">)</span>
  <span style="color: #ff62d4;">(</span>add-to-list 'display-buffer-alist
               `<span style="color: #3fdfd0;">(</span>,buffer-rx
                 <span style="color: #fba849;">(</span>display-buffer-reuse-window
                  display-buffer-in-side-window<span style="color: #fba849;">)</span>
                 <span style="color: #fba849;">(</span>reusable-frames . visible<span style="color: #fba849;">)</span>
                 <span style="color: #fba849;">(</span>side            . bottom<span style="color: #fba849;">)</span>
                 <span style="color: #fba849;">(</span>window-height   . ,height<span style="color: #fba849;">)</span><span style="color: #3fdfd0;">)</span><span style="color: #ff62d4;">)</span><span style="color: #ffffff;">)</span>

<span style="color: #ffffff;">(</span>my/make-popup <span style="color: #ff62d4;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">rx</span> bos <span style="color: var(--clr-string); background-color: var(--bg-string);">"*Messages*"</span> eos<span style="color: #ff62d4;">)</span><span style="color: #ffffff;">)</span>
<span style="color: #ffffff;">(</span>my/make-popup <span style="color: #ff62d4;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">rx</span> bos <span style="color: var(--clr-string); background-color: var(--bg-string);">"*Backtrace*"</span> eos<span style="color: #ff62d4;">)</span><span style="color: #ffffff;">)</span>
<span style="color: #ffffff;">(</span>my/make-popup <span style="color: #ff62d4;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">rx</span> bos <span style="color: var(--clr-string); background-color: var(--bg-string);">"*Warnings*"</span> eos<span style="color: #ff62d4;">)</span><span style="color: #ffffff;">)</span>
<span style="color: #ffffff;">(</span>my/make-popup <span style="color: #ff62d4;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">rx</span> bos <span style="color: var(--clr-string); background-color: var(--bg-string);">"*compilation*"</span> eos<span style="color: #ff62d4;">)</span><span style="color: #ffffff;">)</span>
<span style="color: #ffffff;">(</span>my/make-popup <span style="color: #ff62d4;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">rx</span> bos <span style="color: var(--clr-string); background-color: var(--bg-string);">"*Help*"</span> eos<span style="color: #ff62d4;">)</span><span style="color: #ffffff;">)</span>
<span style="color: #ffffff;">(</span>my/make-popup <span style="color: #ff62d4;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">rx</span> bos <span style="color: var(--clr-string); background-color: var(--bg-string);">"*helpful*"</span> eos<span style="color: #ff62d4;">)</span><span style="color: #ffffff;">)</span>
<span style="color: #ffffff;">(</span>my/make-popup <span style="color: #ff62d4;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">rx</span> bos <span style="color: var(--clr-string); background-color: var(--bg-string);">"*scratch*"</span> eos<span style="color: #ff62d4;">)</span> 0.4<span style="color: #ffffff;">)</span>
</pre>
</div>

<p>
Taken from <a href="https://emacs.stackexchange.com/questions/46210/reuse-help-window">https://emacs.stackexchange.com/questions/46210/reuse-help-window</a>
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #ffffff;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">setq</span> display-buffer-alist
      `<span style="color: #ff62d4;">(</span><span style="color: #3fdfd0;">(</span>,<span style="color: #fba849;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">rx</span> bos <span style="color: #9f80ff;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">or</span> <span style="color: var(--clr-string); background-color: var(--bg-string);">"*Apropos*"</span> <span style="color: var(--clr-string); background-color: var(--bg-string);">"*Help*"</span> <span style="color: var(--clr-string); background-color: var(--bg-string);">"*helpful"</span> <span style="color: var(--clr-string); background-color: var(--bg-string);">"*info*"</span> <span style="color: var(--clr-string); background-color: var(--bg-string);">"*Summary*"</span><span style="color: #9f80ff;">)</span> <span style="color: #9f80ff;">(</span>0+ not-newline<span style="color: #9f80ff;">)</span><span style="color: #fba849;">)</span>
         <span style="color: #fba849;">(</span>display-buffer-reuse-mode-window display-buffer-below-selected<span style="color: #fba849;">)</span>
         <span style="color: #fba849;">(</span>window-height . 0.33<span style="color: #fba849;">)</span>
         <span style="color: #fba849;">(</span>mode apropos-mode help-mode helpful-mode Info-mode Man-mode<span style="color: #fba849;">)</span><span style="color: #3fdfd0;">)</span><span style="color: #ff62d4;">)</span><span style="color: #ffffff;">)</span>
</pre>
</div>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #ffffff;">(</span>add-to-list 'display-buffer-alist
             '<span style="color: #ff62d4;">(</span><span style="color: #3fdfd0;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">lambda</span> <span style="color: #fba849;">(</span>buffer _<span style="color: #fba849;">)</span> <span style="color: #fba849;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">with-current-buffer</span> buffer
                                    <span style="color: #9f80ff;">(</span>seq-some <span style="color: #4fe42f;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">lambda</span> <span style="color: #fe6060;">(</span>mode<span style="color: #fe6060;">)</span>
                                                <span style="color: #fe6060;">(</span>derived-mode-p mode<span style="color: #fe6060;">)</span><span style="color: #4fe42f;">)</span>
                                              '<span style="color: #4fe42f;">(</span>help-mode<span style="color: #4fe42f;">)</span><span style="color: #9f80ff;">)</span><span style="color: #fba849;">)</span><span style="color: #3fdfd0;">)</span>
               <span style="color: #3fdfd0;">(</span>display-buffer-reuse-window display-buffer-below-selected<span style="color: #3fdfd0;">)</span>
               <span style="color: #3fdfd0;">(</span>reusable-frames . visible<span style="color: #3fdfd0;">)</span>
               <span style="color: #3fdfd0;">(</span>window-height . 0.33<span style="color: #3fdfd0;">)</span><span style="color: #ff62d4;">)</span><span style="color: #ffffff;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgc922c15" class="outline-3">
<h3 id="orgc922c15"><span class="section-number-3">6.10</span> winum</h3>
<div class="outline-text-3" id="text-6-10">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #ffffff;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">use-package</span> <span style="color: var(--clr-constant); background-color: var(--bg-constant);">winum</span>
<span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:general</span>
<span style="color: #ff62d4;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">my/leader-keys</span>
<span style="color: var(--clr-string); background-color: var(--bg-string);">"1"</span> '<span style="color: #3fdfd0;">(</span>winum-select-window-1 <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:wk</span> <span style="color: var(--clr-string); background-color: var(--bg-string);">"win 1"</span><span style="color: #3fdfd0;">)</span>
<span style="color: var(--clr-string); background-color: var(--bg-string);">"2"</span> '<span style="color: #3fdfd0;">(</span>winum-select-window-2 <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:wk</span> <span style="color: var(--clr-string); background-color: var(--bg-string);">"win 2"</span><span style="color: #3fdfd0;">)</span>
<span style="color: var(--clr-string); background-color: var(--bg-string);">"3"</span> '<span style="color: #3fdfd0;">(</span>winum-select-window-3 <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:wk</span> <span style="color: var(--clr-string); background-color: var(--bg-string);">"win 3"</span><span style="color: #3fdfd0;">)</span><span style="color: #ff62d4;">)</span>
<span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:config</span>
<span style="color: #ff62d4;">(</span>winum-mode<span style="color: #ff62d4;">)</span><span style="color: #ffffff;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org3e29391" class="outline-3">
<h3 id="org3e29391"><span class="section-number-3">6.11</span> transpose frame</h3>
<div class="outline-text-3" id="text-6-11">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #ffffff;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">use-package</span> <span style="color: var(--clr-constant); background-color: var(--bg-constant);">transpose-frame</span>
  <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:general</span>
  <span style="color: #ff62d4;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">my/leader-keys</span>
    <span style="color: var(--clr-string); background-color: var(--bg-string);">"w t"</span> '<span style="color: #3fdfd0;">(</span>transpose-frame <span style="color: var(--clr-string); background-color: var(--bg-string);">"transpose"</span><span style="color: #3fdfd0;">)</span>
    <span style="color: var(--clr-string); background-color: var(--bg-string);">"w f"</span> '<span style="color: #3fdfd0;">(</span>rotate-frame <span style="color: var(--clr-string); background-color: var(--bg-string);">"flip"</span><span style="color: #3fdfd0;">)</span><span style="color: #ff62d4;">)</span><span style="color: #ffffff;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org06f01d9" class="outline-3">
<h3 id="org06f01d9"><span class="section-number-3">6.12</span> persistent scratch</h3>
<div class="outline-text-3" id="text-6-12">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #ffffff;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">use-package</span> <span style="color: var(--clr-constant); background-color: var(--bg-constant);">persistent-scratch</span>
<span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:demand</span>
<span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:config</span>
<span style="color: #ff62d4;">(</span>persistent-scratch-setup-default<span style="color: #ff62d4;">)</span><span style="color: #ffffff;">)</span>
</pre>
</div>
</div>
</div>
