readme.org
** olivetti mode
#+begin_src emacs-lisp
  (use-package olivetti
    :general
    (my/leader-keys
      "t o" '(olivetti-mode :wk "olivetti"))
    :init
    (setq olivetti-body-width 0.7)
    (setq olivetti-minimum-body-width 80)
    (setq olivetti-recall-visual-line-mode-entry-state t))
#+end_src

* Completion framework
** selectrum
#+BEGIN_SRC emacs-lisp
  (use-package selectrum
    :after embark
    :demand
    :general
    (selectrum-minibuffer-map "C-j" 'selectrum-next-candidate
                              "C-k" 'selectrum-previous-candidate)
    :config
    (selectrum-mode t)
    )
#+END_SRC

** prescient
#+BEGIN_SRC emacs-lisp
  (use-package selectrum-prescient
    :after selectrum
    :demand
    :config
    (prescient-persist-mode t)
    (selectrum-prescient-mode t)
    )

  (use-package company-prescient
    :after company
    :demand
    :config
    (company-prescient-mode t))
#+END_SRC

** marginalia
#+BEGIN_SRC emacs-lisp
  (use-package marginalia
    :after selectrum
    :demand
    :init
    (setq marginalia-annotators '(marginalia-annotators-heavy marginalia-annotators-light nil))
    :config (marginalia-mode t))
#+END_SRC

** embark
   Taken from https://github.com/oantolin/embark

   You can act on candidates with =C-o= and ask to remind bindings with =C-h=
#+BEGIN_SRC emacs-lisp
  (use-package embark
    :demand
    :general
    (general-nmap "C-l" 'embark-act)
    (selectrum-minibuffer-map "C-l" #'embark-act)
    :config
    ;; For Selectrum users:
    (defun current-candidate+category ()
      (when selectrum-active-p
        (cons (selectrum--get-meta 'category)
              (selectrum-get-current-candidate))))

    (add-hook 'embark-target-finders #'current-candidate+category)

    (defun current-candidates+category ()
      (when selectrum-active-p
        (cons (selectrum--get-meta 'category)
              (selectrum-get-current-candidates
               ;; Pass relative file names for dired.
               minibuffer-completing-file-name))))

    (add-hook 'embark-candidate-collectors #'current-candidates+category)

    ;; No unnecessary computation delay after injection.
    (add-hook 'embark-setup-hook 'selectrum-set-selected-candidate)
    )
#+END_SRC

** TODO embark-consult
#+begin_src emacs-lisp :tangle no
(use-package embark-consult
  :after (embark consult)
  :demand t ; only necessary if you have the hook below
  ;; if you want to have consult previews as you move around an
  ;; auto-updating embark collect buffer
  :hook
  (embark-collect-mode . embark-consult-preview-minor-mode))
#+end_src

