readme.html

<div id="outline-container-org54604fd" class="outline-3">
<h3 id="org54604fd"><span class="section-number-3">6.13</span> olivetti mode</h3>
<div class="outline-text-3" id="text-6-13">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #ffffff;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">use-package</span> <span style="color: var(--clr-constant); background-color: var(--bg-constant);">olivetti</span>
  <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:general</span>
  <span style="color: #ff62d4;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">my/leader-keys</span>
    <span style="color: var(--clr-string); background-color: var(--bg-string);">"t o"</span> '<span style="color: #3fdfd0;">(</span>olivetti-mode <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:wk</span> <span style="color: var(--clr-string); background-color: var(--bg-string);">"olivetti"</span><span style="color: #3fdfd0;">)</span><span style="color: #ff62d4;">)</span>
  <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:init</span>
  <span style="color: #ff62d4;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">setq</span> olivetti-body-width 0.7<span style="color: #ff62d4;">)</span>
  <span style="color: #ff62d4;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">setq</span> olivetti-minimum-body-width 80<span style="color: #ff62d4;">)</span>
  <span style="color: #ff62d4;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">setq</span> olivetti-recall-visual-line-mode-entry-state t<span style="color: #ff62d4;">)</span><span style="color: #ffffff;">)</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgc955f1a" class="outline-2">
<h2 id="orgc955f1a"><span class="section-number-2">7</span> Completion framework</h2>
<div class="outline-text-2" id="text-7">
</div>
<div id="outline-container-orge40b989" class="outline-3">
<h3 id="orge40b989"><span class="section-number-3">7.1</span> selectrum</h3>
<div class="outline-text-3" id="text-7-1">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #ffffff;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">use-package</span> <span style="color: var(--clr-constant); background-color: var(--bg-constant);">selectrum</span>
  <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:after</span> embark
  <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:demand</span>
  <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:general</span>
  <span style="color: #ff62d4;">(</span>selectrum-minibuffer-map <span style="color: var(--clr-string); background-color: var(--bg-string);">"C-j"</span> 'selectrum-next-candidate
                            <span style="color: var(--clr-string); background-color: var(--bg-string);">"C-k"</span> 'selectrum-previous-candidate<span style="color: #ff62d4;">)</span>
  <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:config</span>
  <span style="color: #ff62d4;">(</span>selectrum-mode t<span style="color: #ff62d4;">)</span>
  <span style="color: #ffffff;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgf2b729a" class="outline-3">
<h3 id="orgf2b729a"><span class="section-number-3">7.2</span> prescient</h3>
<div class="outline-text-3" id="text-7-2">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #ffffff;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">use-package</span> <span style="color: var(--clr-constant); background-color: var(--bg-constant);">selectrum-prescient</span>
  <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:after</span> selectrum
  <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:demand</span>
  <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:config</span>
  <span style="color: #ff62d4;">(</span>prescient-persist-mode t<span style="color: #ff62d4;">)</span>
  <span style="color: #ff62d4;">(</span>selectrum-prescient-mode t<span style="color: #ff62d4;">)</span>
  <span style="color: #ffffff;">)</span>

<span style="color: #ffffff;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">use-package</span> <span style="color: var(--clr-constant); background-color: var(--bg-constant);">company-prescient</span>
  <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:after</span> company
  <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:demand</span>
  <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:config</span>
  <span style="color: #ff62d4;">(</span>company-prescient-mode t<span style="color: #ff62d4;">)</span><span style="color: #ffffff;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org9238fbf" class="outline-3">
<h3 id="org9238fbf"><span class="section-number-3">7.3</span> marginalia</h3>
<div class="outline-text-3" id="text-7-3">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #ffffff;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">use-package</span> <span style="color: var(--clr-constant); background-color: var(--bg-constant);">marginalia</span>
  <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:after</span> selectrum
  <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:demand</span>
  <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:init</span>
  <span style="color: #ff62d4;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">setq</span> marginalia-annotators '<span style="color: #3fdfd0;">(</span>marginalia-annotators-heavy marginalia-annotators-light nil<span style="color: #3fdfd0;">)</span><span style="color: #ff62d4;">)</span>
  <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:config</span> <span style="color: #ff62d4;">(</span>marginalia-mode t<span style="color: #ff62d4;">)</span><span style="color: #ffffff;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orga2ebbb1" class="outline-3">
<h3 id="orga2ebbb1"><span class="section-number-3">7.4</span> embark</h3>
<div class="outline-text-3" id="text-7-4">
<p>
Taken from <a href="https://github.com/oantolin/embark">https://github.com/oantolin/embark</a>
</p>

<p>
You can act on candidates with <code>C-o</code> and ask to remind bindings with <code>C-h</code>
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #ffffff;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">use-package</span> <span style="color: var(--clr-constant); background-color: var(--bg-constant);">embark</span>
  <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:demand</span>
  <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:general</span>
  <span style="color: #ff62d4;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">general-nmap</span> <span style="color: var(--clr-string); background-color: var(--bg-string);">"C-l"</span> 'embark-act<span style="color: #ff62d4;">)</span>
  <span style="color: #ff62d4;">(</span>selectrum-minibuffer-map <span style="color: var(--clr-string); background-color: var(--bg-string);">"C-l"</span> #'embark-act<span style="color: #ff62d4;">)</span>
  <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:config</span>
  <span style="color: var(--clr-comment-delimiter); background-color: var(--bg-comment-delimiter);">;; </span><span style="color: var(--clr-comment); background-color: var(--bg-comment);">For Selectrum users:</span>
  <span style="color: #ff62d4;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">defun</span> <span style="color: var(--function-clr-name); background-color: var(--function-bg-name);">current-candidate+category</span> <span style="color: #3fdfd0;">()</span>
    <span style="color: #3fdfd0;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">when</span> selectrum-active-p
      <span style="color: #fba849;">(</span>cons <span style="color: #9f80ff;">(</span>selectrum--get-meta 'category<span style="color: #9f80ff;">)</span>
            <span style="color: #9f80ff;">(</span>selectrum-get-current-candidate<span style="color: #9f80ff;">)</span><span style="color: #fba849;">)</span><span style="color: #3fdfd0;">)</span><span style="color: #ff62d4;">)</span>

  <span style="color: #ff62d4;">(</span>add-hook 'embark-target-finders #'current-candidate+category<span style="color: #ff62d4;">)</span>

  <span style="color: #ff62d4;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">defun</span> <span style="color: var(--function-clr-name); background-color: var(--function-bg-name);">current-candidates+category</span> <span style="color: #3fdfd0;">()</span>
    <span style="color: #3fdfd0;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">when</span> selectrum-active-p
      <span style="color: #fba849;">(</span>cons <span style="color: #9f80ff;">(</span>selectrum--get-meta 'category<span style="color: #9f80ff;">)</span>
            <span style="color: #9f80ff;">(</span>selectrum-get-current-candidates
             <span style="color: var(--clr-comment-delimiter); background-color: var(--bg-comment-delimiter);">;; </span><span style="color: var(--clr-comment); background-color: var(--bg-comment);">Pass relative file names for dired.</span>
             minibuffer-completing-file-name<span style="color: #9f80ff;">)</span><span style="color: #fba849;">)</span><span style="color: #3fdfd0;">)</span><span style="color: #ff62d4;">)</span>

  <span style="color: #ff62d4;">(</span>add-hook 'embark-candidate-collectors #'current-candidates+category<span style="color: #ff62d4;">)</span>

  <span style="color: var(--clr-comment-delimiter); background-color: var(--bg-comment-delimiter);">;; </span><span style="color: var(--clr-comment); background-color: var(--bg-comment);">No unnecessary computation delay after injection.</span>
  <span style="color: #ff62d4;">(</span>add-hook 'embark-setup-hook 'selectrum-set-selected-candidate<span style="color: #ff62d4;">)</span>
  <span style="color: #ffffff;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org16f8080" class="outline-3">
<h3 id="org16f8080"><span class="section-number-3">7.5</span> <span class="todo TODO">TODO</span> embark-consult</h3>
<div class="outline-text-3" id="text-7-5">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #ffffff;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">use-package</span> <span style="color: var(--clr-constant); background-color: var(--bg-constant);">embark-consult</span>
  <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:after</span> <span style="color: #ff62d4;">(</span>embark consult<span style="color: #ff62d4;">)</span>
  <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:demand</span> t <span style="color: var(--clr-comment-delimiter); background-color: var(--bg-comment-delimiter);">; </span><span style="color: var(--clr-comment); background-color: var(--bg-comment);">only necessary if you have the hook below</span>
  <span style="color: var(--clr-comment-delimiter); background-color: var(--bg-comment-delimiter);">;; </span><span style="color: var(--clr-comment); background-color: var(--bg-comment);">if you want to have consult previews as you move around an</span>
  <span style="color: var(--clr-comment-delimiter); background-color: var(--bg-comment-delimiter);">;; </span><span style="color: var(--clr-comment); background-color: var(--bg-comment);">auto-updating embark collect buffer</span>
  <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:hook</span>
  <span style="color: #ff62d4;">(</span>embark-collect-mode . embark-consult-preview-minor-mode<span style="color: #ff62d4;">)</span><span style="color: #ffffff;">)</span>
</pre>
</div>
</div>
</div>
