readme.org
** consult
#+BEGIN_SRC emacs-lisp
  (use-package consult
    :general
    (my/leader-keys
      "s o" '(consult-outline :which-key "outline")
      "s s" 'consult-line
      "y" '(consult-yank-pop :which-key "yank")
      "b b" 'consult-buffer
      ;; TODO consult mark
      "f r" 'consult-recent-file
      "s !" '(consult-flymake :wk "flymake")
      "s p" '(consult-ripgrep :wk "ripgrep")
      "t t" '(consult-theme :wk "theme")
      )
    ;; :init
    ;; (setq consult-preview-key "C-l")
    ;; (setq consult-narrow-key ">")
    :config
    (consult-preview-mode)
    )

  (use-package consult-selectrum
    :after selectrum
    :demand)
#+END_SRC

* Core packages
** project
*** projectile
#+BEGIN_SRC emacs-lisp
  (use-package projectile
    :demand
    :general
    (my/leader-keys
      "p" '(:keymap projectile-command-map :which-key "projectile")
      "p a" 'projectile-add-known-project
      "p t" 'projectile-run-vterm)
    :init
    (when (file-directory-p "~/git")
      (setq projectile-project-search-path '("~/git")))
    (setq projectile-completion-system 'default)
    (setq projectile-switch-project-action #'projectile-find-file)
    (setq projectile-project-root-files '(".envrc" ".projectile" "project.clj" "deps.edn"))
    ;; (add-to-list 'projectile-globally-ignored-directories "straight") ;; TODO
    :config
    (defadvice projectile-project-root (around ignore-remote first activate)
      (unless (file-remote-p default-directory) ad-do-it))
    (projectile-mode))
#+END_SRC

*** perspective
#+BEGIN_SRC emacs-lisp
  (use-package perspective
    :general
    (my/leader-keys
      "<tab> <tab>" 'persp-switch
      "<tab> `" 'persp-switch-last
      "<tab> d" 'persp-kill
      "<tab> D" '((lambda () (interactive) (persp-kill (persp-current-name))) :wk "kill current")
      "<tab> X" '((lambda () (interactive) (persp-kill (persp-names))) :wk "all")
      )
    :config
    (persp-mode))

  (use-package persp-projectile
    :general
    (my/leader-keys
      "p p" 'projectile-persp-switch-project))
#+END_SRC

** git
