readme.html

<div id="outline-container-orga411173" class="outline-3">
<h3 id="orga411173"><span class="section-number-3">7.6</span> consult</h3>
<div class="outline-text-3" id="text-7-6">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #ffffff;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">use-package</span> <span style="color: var(--clr-constant); background-color: var(--bg-constant);">consult</span>
  <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:general</span>
  <span style="color: #ff62d4;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">my/leader-keys</span>
    <span style="color: var(--clr-string); background-color: var(--bg-string);">"s o"</span> '<span style="color: #3fdfd0;">(</span>consult-outline <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:which-key</span> <span style="color: var(--clr-string); background-color: var(--bg-string);">"outline"</span><span style="color: #3fdfd0;">)</span>
    <span style="color: var(--clr-string); background-color: var(--bg-string);">"s s"</span> 'consult-line
    <span style="color: var(--clr-string); background-color: var(--bg-string);">"y"</span> '<span style="color: #3fdfd0;">(</span>consult-yank-pop <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:which-key</span> <span style="color: var(--clr-string); background-color: var(--bg-string);">"yank"</span><span style="color: #3fdfd0;">)</span>
    <span style="color: var(--clr-string); background-color: var(--bg-string);">"b b"</span> 'consult-buffer
    <span style="color: var(--clr-comment-delimiter); background-color: var(--bg-comment-delimiter);">;; </span><span style="color: #feacd0;">TODO</span><span style="color: var(--clr-comment); background-color: var(--bg-comment);"> consult mark</span>
    <span style="color: var(--clr-string); background-color: var(--bg-string);">"f r"</span> 'consult-recent-file
    <span style="color: var(--clr-string); background-color: var(--bg-string);">"s !"</span> '<span style="color: #3fdfd0;">(</span>consult-flymake <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:wk</span> <span style="color: var(--clr-string); background-color: var(--bg-string);">"flymake"</span><span style="color: #3fdfd0;">)</span>
    <span style="color: var(--clr-string); background-color: var(--bg-string);">"s p"</span> '<span style="color: #3fdfd0;">(</span>consult-ripgrep <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:wk</span> <span style="color: var(--clr-string); background-color: var(--bg-string);">"ripgrep"</span><span style="color: #3fdfd0;">)</span>
    <span style="color: var(--clr-string); background-color: var(--bg-string);">"t t"</span> '<span style="color: #3fdfd0;">(</span>consult-theme <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:wk</span> <span style="color: var(--clr-string); background-color: var(--bg-string);">"theme"</span><span style="color: #3fdfd0;">)</span>
    <span style="color: #ff62d4;">)</span>
  <span style="color: var(--clr-comment-delimiter); background-color: var(--bg-comment-delimiter);">;; </span><span style="color: var(--clr-comment); background-color: var(--bg-comment);">:init</span>
  <span style="color: var(--clr-comment-delimiter); background-color: var(--bg-comment-delimiter);">;; </span><span style="color: var(--clr-comment); background-color: var(--bg-comment);">(setq consult-preview-key "C-l")</span>
  <span style="color: var(--clr-comment-delimiter); background-color: var(--bg-comment-delimiter);">;; </span><span style="color: var(--clr-comment); background-color: var(--bg-comment);">(setq consult-narrow-key "&gt;")</span>
  <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:config</span>
  <span style="color: #ff62d4;">(</span>consult-preview-mode<span style="color: #ff62d4;">)</span>
  <span style="color: #ffffff;">)</span>

<span style="color: #ffffff;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">use-package</span> <span style="color: var(--clr-constant); background-color: var(--bg-constant);">consult-selectrum</span>
  <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:after</span> selectrum
  <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:demand</span><span style="color: #ffffff;">)</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org85c8123" class="outline-2">
<h2 id="org85c8123"><span class="section-number-2">8</span> Core packages</h2>
<div class="outline-text-2" id="text-8">
</div>
<div id="outline-container-org05da2f7" class="outline-3">
<h3 id="org05da2f7"><span class="section-number-3">8.1</span> project</h3>
<div class="outline-text-3" id="text-8-1">
</div>
<div id="outline-container-orgf51b49f" class="outline-4">
<h4 id="orgf51b49f"><span class="section-number-4">8.1.1</span> projectile</h4>
<div class="outline-text-4" id="text-8-1-1">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #ffffff;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">use-package</span> <span style="color: var(--clr-constant); background-color: var(--bg-constant);">projectile</span>
  <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:demand</span>
  <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:general</span>
  <span style="color: #ff62d4;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">my/leader-keys</span>
    <span style="color: var(--clr-string); background-color: var(--bg-string);">"p"</span> '<span style="color: #3fdfd0;">(</span><span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:keymap</span> projectile-command-map <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:which-key</span> <span style="color: var(--clr-string); background-color: var(--bg-string);">"projectile"</span><span style="color: #3fdfd0;">)</span>
    <span style="color: var(--clr-string); background-color: var(--bg-string);">"p a"</span> 'projectile-add-known-project
    <span style="color: var(--clr-string); background-color: var(--bg-string);">"p t"</span> 'projectile-run-vterm<span style="color: #ff62d4;">)</span>
  <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:init</span>
  <span style="color: #ff62d4;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">when</span> <span style="color: #3fdfd0;">(</span>file-directory-p <span style="color: var(--clr-string); background-color: var(--bg-string);">"~/git"</span><span style="color: #3fdfd0;">)</span>
    <span style="color: #3fdfd0;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">setq</span> projectile-project-search-path '<span style="color: #fba849;">(</span><span style="color: var(--clr-string); background-color: var(--bg-string);">"~/git"</span><span style="color: #fba849;">)</span><span style="color: #3fdfd0;">)</span><span style="color: #ff62d4;">)</span>
  <span style="color: #ff62d4;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">setq</span> projectile-completion-system 'default<span style="color: #ff62d4;">)</span>
  <span style="color: #ff62d4;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">setq</span> projectile-switch-project-action #'projectile-find-file<span style="color: #ff62d4;">)</span>
  <span style="color: #ff62d4;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">setq</span> projectile-project-root-files '<span style="color: #3fdfd0;">(</span><span style="color: var(--clr-string); background-color: var(--bg-string);">".envrc"</span> <span style="color: var(--clr-string); background-color: var(--bg-string);">".projectile"</span> <span style="color: var(--clr-string); background-color: var(--bg-string);">"project.clj"</span> <span style="color: var(--clr-string); background-color: var(--bg-string);">"deps.edn"</span><span style="color: #3fdfd0;">)</span><span style="color: #ff62d4;">)</span>
  <span style="color: var(--clr-comment-delimiter); background-color: var(--bg-comment-delimiter);">;; </span><span style="color: var(--clr-comment); background-color: var(--bg-comment);">(add-to-list 'projectile-globally-ignored-directories "straight") ;; </span><span style="color: #feacd0;">TODO</span>
  <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:config</span>
  <span style="color: #ff62d4;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">defadvice</span> <span style="color: var(--function-clr-name); background-color: var(--function-bg-name);">projectile-project-root</span> <span style="color: #3fdfd0;">(</span>around ignore-remote first activate<span style="color: #3fdfd0;">)</span>
    <span style="color: #3fdfd0;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">unless</span> <span style="color: #fba849;">(</span>file-remote-p default-directory<span style="color: #fba849;">)</span> ad-do-it<span style="color: #3fdfd0;">)</span><span style="color: #ff62d4;">)</span>
  <span style="color: #ff62d4;">(</span>projectile-mode<span style="color: #ff62d4;">)</span><span style="color: #ffffff;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org2223ac8" class="outline-4">
<h4 id="org2223ac8"><span class="section-number-4">8.1.2</span> perspective</h4>
<div class="outline-text-4" id="text-8-1-2">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #ffffff;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">use-package</span> <span style="color: var(--clr-constant); background-color: var(--bg-constant);">perspective</span>
  <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:general</span>
  <span style="color: #ff62d4;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">my/leader-keys</span>
    <span style="color: var(--clr-string); background-color: var(--bg-string);">"&lt;tab&gt; &lt;tab&gt;"</span> 'persp-switch
    <span style="color: var(--clr-string); background-color: var(--bg-string);">"&lt;tab&gt; `"</span> 'persp-switch-last
    <span style="color: var(--clr-string); background-color: var(--bg-string);">"&lt;tab&gt; d"</span> 'persp-kill
    <span style="color: var(--clr-string); background-color: var(--bg-string);">"&lt;tab&gt; D"</span> '<span style="color: #3fdfd0;">(</span><span style="color: #fba849;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">lambda</span> <span style="color: #9f80ff;">()</span> <span style="color: #9f80ff;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">interactive</span><span style="color: #9f80ff;">)</span> <span style="color: #9f80ff;">(</span>persp-kill <span style="color: #4fe42f;">(</span>persp-current-name<span style="color: #4fe42f;">)</span><span style="color: #9f80ff;">)</span><span style="color: #fba849;">)</span> <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:wk</span> <span style="color: var(--clr-string); background-color: var(--bg-string);">"kill current"</span><span style="color: #3fdfd0;">)</span>
    <span style="color: var(--clr-string); background-color: var(--bg-string);">"&lt;tab&gt; X"</span> '<span style="color: #3fdfd0;">(</span><span style="color: #fba849;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">lambda</span> <span style="color: #9f80ff;">()</span> <span style="color: #9f80ff;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">interactive</span><span style="color: #9f80ff;">)</span> <span style="color: #9f80ff;">(</span>persp-kill <span style="color: #4fe42f;">(</span>persp-names<span style="color: #4fe42f;">)</span><span style="color: #9f80ff;">)</span><span style="color: #fba849;">)</span> <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:wk</span> <span style="color: var(--clr-string); background-color: var(--bg-string);">"all"</span><span style="color: #3fdfd0;">)</span>
    <span style="color: #ff62d4;">)</span>
  <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:config</span>
  <span style="color: #ff62d4;">(</span>persp-mode<span style="color: #ff62d4;">)</span><span style="color: #ffffff;">)</span>

<span style="color: #ffffff;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">use-package</span> <span style="color: var(--clr-constant); background-color: var(--bg-constant);">persp-projectile</span>
  <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:general</span>
  <span style="color: #ff62d4;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">my/leader-keys</span>
    <span style="color: var(--clr-string); background-color: var(--bg-string);">"p p"</span> 'projectile-persp-switch-project<span style="color: #ff62d4;">)</span><span style="color: #ffffff;">)</span>
</pre>
</div>
</div>
</div>
</div>
