readme.org
*** magit
#+BEGIN_SRC emacs-lisp
  (use-package magit
    :general
    (my/leader-keys
      "g g" 'magit-status
      "g G" 'magit-status-here
      "g l" '(magit-log :wk "log"))
    :init
    (setq magit-display-buffer-function #'magit-display-buffer-same-window-except-diff-v1)
    (setq magit-log-arguments '("--graph" "--decorate" "--color")))
#+END_SRC

*** TODO forge
#+BEGIN_SRC emacs-lisp :tangle no
;; NOTE: Make sure to configure a GitHub token before using this package!
;; - https://magit.vc/manual/forge/Token-Creation.html#Token-Creation
;; - https://magit.vc/manual/ghub/Getting-Started.html#Getting-Started
(use-package forge :after magit)
#+END_SRC

*** git-timemachine
#+begin_src emacs-lisp
  (use-package git-timemachine
    :hook (git-time-machine-mode . evil-normalize-keymaps)
    :init (setq git-timemachine-show-minibuffer-details t)
    :general
    (general-nmap "SPC g t" 'git-timemachine-toggle)
    (git-timemachine-mode-map
     "C-k" 'git-timemachine-show-previous-revision
     "C-j" 'git-timemachine-show-next-revision
     "q" 'git-timemachine-quit))
#+end_src

*** git-gutter
#+begin_src emacs-lisp
  (use-package diff-hl
    :hook
    (((org-mode prog-mode) . diff-hl-mode)
     (magit-pre-refresh . diff-hl-magit-pre-refresh)
     (magit-post-refresh . diff-hl-magit-post-refresh))
    :init
    (setq diff-hl-draw-borders nil)
    )
#+end_src

