readme.html

<div id="outline-container-orgba97886" class="outline-3">
<h3 id="orgba97886"><span class="section-number-3">8.2</span> git</h3>
<div class="outline-text-3" id="text-8-2">
</div>
<div id="outline-container-orgb7d2bdb" class="outline-4">
<h4 id="orgb7d2bdb"><span class="section-number-4">8.2.1</span> magit</h4>
<div class="outline-text-4" id="text-8-2-1">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #ffffff;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">use-package</span> <span style="color: var(--clr-constant); background-color: var(--bg-constant);">magit</span>
  <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:general</span>
  <span style="color: #ff62d4;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">my/leader-keys</span>
    <span style="color: var(--clr-string); background-color: var(--bg-string);">"g g"</span> 'magit-status
    <span style="color: var(--clr-string); background-color: var(--bg-string);">"g G"</span> 'magit-status-here
    <span style="color: var(--clr-string); background-color: var(--bg-string);">"g l"</span> '<span style="color: #3fdfd0;">(</span>magit-log <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:wk</span> <span style="color: var(--clr-string); background-color: var(--bg-string);">"log"</span><span style="color: #3fdfd0;">)</span><span style="color: #ff62d4;">)</span>
  <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:init</span>
  <span style="color: #ff62d4;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">setq</span> magit-display-buffer-function #'magit-display-buffer-same-window-except-diff-v1<span style="color: #ff62d4;">)</span>
  <span style="color: #ff62d4;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">setq</span> magit-log-arguments '<span style="color: #3fdfd0;">(</span><span style="color: var(--clr-string); background-color: var(--bg-string);">"--graph"</span> <span style="color: var(--clr-string); background-color: var(--bg-string);">"--decorate"</span> <span style="color: var(--clr-string); background-color: var(--bg-string);">"--color"</span><span style="color: #3fdfd0;">)</span><span style="color: #ff62d4;">)</span><span style="color: #ffffff;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org62841fd" class="outline-4">
<h4 id="org62841fd"><span class="section-number-4">8.2.2</span> <span class="todo TODO">TODO</span> forge</h4>
<div class="outline-text-4" id="text-8-2-2">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: var(--clr-comment-delimiter); background-color: var(--bg-comment-delimiter);">;; </span><span style="color: #f0ce43;">NOTE</span><span style="color: var(--clr-comment); background-color: var(--bg-comment);">: Make sure to configure a GitHub token before using this package!</span>
<span style="color: var(--clr-comment-delimiter); background-color: var(--bg-comment-delimiter);">;; </span><span style="color: var(--clr-comment); background-color: var(--bg-comment);">- https://magit.vc/manual/forge/Token-Creation.html#Token-Creation</span>
<span style="color: var(--clr-comment-delimiter); background-color: var(--bg-comment-delimiter);">;; </span><span style="color: var(--clr-comment); background-color: var(--bg-comment);">- https://magit.vc/manual/ghub/Getting-Started.html#Getting-Started</span>
<span style="color: #ffffff;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">use-package</span> <span style="color: var(--clr-constant); background-color: var(--bg-constant);">forge</span> <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:after</span> magit<span style="color: #ffffff;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgbfceeb8" class="outline-4">
<h4 id="orgbfceeb8"><span class="section-number-4">8.2.3</span> git-timemachine</h4>
<div class="outline-text-4" id="text-8-2-3">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #ffffff;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">use-package</span> <span style="color: var(--clr-constant); background-color: var(--bg-constant);">git-timemachine</span>
  <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:hook</span> <span style="color: #ff62d4;">(</span>git-time-machine-mode . evil-normalize-keymaps<span style="color: #ff62d4;">)</span>
  <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:init</span> <span style="color: #ff62d4;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">setq</span> git-timemachine-show-minibuffer-details t<span style="color: #ff62d4;">)</span>
  <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:general</span>
  <span style="color: #ff62d4;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">general-nmap</span> <span style="color: var(--clr-string); background-color: var(--bg-string);">"SPC g t"</span> 'git-timemachine-toggle<span style="color: #ff62d4;">)</span>
  <span style="color: #ff62d4;">(</span>git-timemachine-mode-map
   <span style="color: var(--clr-string); background-color: var(--bg-string);">"C-k"</span> 'git-timemachine-show-previous-revision
   <span style="color: var(--clr-string); background-color: var(--bg-string);">"C-j"</span> 'git-timemachine-show-next-revision
   <span style="color: var(--clr-string); background-color: var(--bg-string);">"q"</span> 'git-timemachine-quit<span style="color: #ff62d4;">)</span><span style="color: #ffffff;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org46e580d" class="outline-4">
<h4 id="org46e580d"><span class="section-number-4">8.2.4</span> git-gutter</h4>
<div class="outline-text-4" id="text-8-2-4">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #ffffff;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">use-package</span> <span style="color: var(--clr-constant); background-color: var(--bg-constant);">diff-hl</span>
  <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:hook</span>
  <span style="color: #ff62d4;">(</span><span style="color: #3fdfd0;">(</span><span style="color: #fba849;">(</span>org-mode prog-mode<span style="color: #fba849;">)</span> . diff-hl-mode<span style="color: #3fdfd0;">)</span>
   <span style="color: #3fdfd0;">(</span>magit-pre-refresh . diff-hl-magit-pre-refresh<span style="color: #3fdfd0;">)</span>
   <span style="color: #3fdfd0;">(</span>magit-post-refresh . diff-hl-magit-post-refresh<span style="color: #3fdfd0;">)</span><span style="color: #ff62d4;">)</span>
  <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:init</span>
  <span style="color: #ff62d4;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">setq</span> diff-hl-draw-borders nil<span style="color: #ff62d4;">)</span>
  <span style="color: #ffffff;">)</span>
</pre>
</div>
</div>
</div>
