readme.html

<div id="outline-container-orgb142637" class="outline-4">
<h4 id="orgb142637"><span class="section-number-4">8.2.5</span> hydra-smerge</h4>
<div class="outline-text-4" id="text-8-2-5">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #ffffff;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">use-package</span> <span style="color: var(--clr-constant); background-color: var(--bg-constant);">smerge-mode</span>
  <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:straight</span> <span style="color: #ff62d4;">(</span><span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:type</span> built-in<span style="color: #ff62d4;">)</span>
  <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:after</span> hydra
  <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:general</span>
  <span style="color: #ff62d4;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">my/leader-keys</span> <span style="color: var(--clr-string); background-color: var(--bg-string);">"g m"</span> 'hydra-smerge<span style="color: #ff62d4;">)</span>
  <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:init</span>
  <span style="color: #ff62d4;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">defhydra</span> hydra-smerge <span style="color: #3fdfd0;">(</span><span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:hint</span> nil
                                <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:pre</span> <span style="color: #fba849;">(</span>smerge-mode 1<span style="color: #fba849;">)</span>
                                <span style="color: var(--clr-comment-delimiter); background-color: var(--bg-comment-delimiter);">;; </span><span style="color: var(--clr-comment); background-color: var(--bg-comment);">Disable `</span><span style="color: var(--clr-constant); background-color: var(--bg-constant);">smerge-mode</span><span style="color: var(--clr-comment); background-color: var(--bg-comment);">' when quitting hydra if</span>
                                <span style="color: var(--clr-comment-delimiter); background-color: var(--bg-comment-delimiter);">;; </span><span style="color: var(--clr-comment); background-color: var(--bg-comment);">no merge conflicts remain.</span>
                                <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:post</span> <span style="color: #fba849;">(</span>smerge-auto-leave<span style="color: #fba849;">)</span><span style="color: #3fdfd0;">)</span>
    <span style="color: var(--clr-doc); background-color: var(--bg-doc);">"</span>
<span style="color: var(--clr-doc); background-color: var(--bg-doc);">                                                  &#9581;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9488;</span>
<span style="color: var(--clr-doc); background-color: var(--bg-doc);">Movement   Keep           Diff              Other &#9474; smerge &#9474;</span>
<span style="color: var(--clr-doc); background-color: var(--bg-doc);">&#9581;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9524;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9583;</span>
<span style="color: var(--clr-doc); background-color: var(--bg-doc);">   ^_g_^       [_b_] base       [_&lt;_] upper/base    [_C_] Combine</span>
<span style="color: var(--clr-doc); background-color: var(--bg-doc);">   ^_C-k_^     [_u_] upper      [_=_] upper/lower   [_r_] resolve</span>
<span style="color: var(--clr-doc); background-color: var(--bg-doc);">   ^_k_ &#8593;^     [_l_] lower      [_&gt;_] base/lower    [_R_] remove</span>
<span style="color: var(--clr-doc); background-color: var(--bg-doc);">   ^_j_ &#8595;^     [_a_] all        [_H_] hightlight</span>
<span style="color: var(--clr-doc); background-color: var(--bg-doc);">   ^_C-j_^     [_RET_] current  [_E_] ediff             &#9581;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;</span>
<span style="color: var(--clr-doc); background-color: var(--bg-doc);">   ^_G_^                                            &#9474; [_q_] quit"</span>
    <span style="color: #3fdfd0;">(</span><span style="color: var(--clr-string); background-color: var(--bg-string);">"g"</span> <span style="color: #fba849;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">progn</span> <span style="color: #9f80ff;">(</span>goto-char <span style="color: #4fe42f;">(</span>point-min<span style="color: #4fe42f;">)</span><span style="color: #9f80ff;">)</span> <span style="color: #9f80ff;">(</span>smerge-next<span style="color: #9f80ff;">)</span><span style="color: #fba849;">)</span><span style="color: #3fdfd0;">)</span>
    <span style="color: #3fdfd0;">(</span><span style="color: var(--clr-string); background-color: var(--bg-string);">"G"</span> <span style="color: #fba849;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">progn</span> <span style="color: #9f80ff;">(</span>goto-char <span style="color: #4fe42f;">(</span>point-max<span style="color: #4fe42f;">)</span><span style="color: #9f80ff;">)</span> <span style="color: #9f80ff;">(</span>smerge-prev<span style="color: #9f80ff;">)</span><span style="color: #fba849;">)</span><span style="color: #3fdfd0;">)</span>
    <span style="color: #3fdfd0;">(</span><span style="color: var(--clr-string); background-color: var(--bg-string);">"C-j"</span> smerge-next<span style="color: #3fdfd0;">)</span>
    <span style="color: #3fdfd0;">(</span><span style="color: var(--clr-string); background-color: var(--bg-string);">"C-k"</span> smerge-prev<span style="color: #3fdfd0;">)</span>
    <span style="color: #3fdfd0;">(</span><span style="color: var(--clr-string); background-color: var(--bg-string);">"j"</span> next-line<span style="color: #3fdfd0;">)</span>
    <span style="color: #3fdfd0;">(</span><span style="color: var(--clr-string); background-color: var(--bg-string);">"k"</span> previous-line<span style="color: #3fdfd0;">)</span>
    <span style="color: #3fdfd0;">(</span><span style="color: var(--clr-string); background-color: var(--bg-string);">"b"</span> smerge-keep-base<span style="color: #3fdfd0;">)</span>
    <span style="color: #3fdfd0;">(</span><span style="color: var(--clr-string); background-color: var(--bg-string);">"u"</span> smerge-keep-upper<span style="color: #3fdfd0;">)</span>
    <span style="color: #3fdfd0;">(</span><span style="color: var(--clr-string); background-color: var(--bg-string);">"l"</span> smerge-keep-lower<span style="color: #3fdfd0;">)</span>
    <span style="color: #3fdfd0;">(</span><span style="color: var(--clr-string); background-color: var(--bg-string);">"a"</span> smerge-keep-all<span style="color: #3fdfd0;">)</span>
    <span style="color: #3fdfd0;">(</span><span style="color: var(--clr-string); background-color: var(--bg-string);">"RET"</span> smerge-keep-current<span style="color: #3fdfd0;">)</span>
    <span style="color: #3fdfd0;">(</span><span style="color: var(--clr-string); background-color: var(--bg-string);">"\C-m"</span> smerge-keep-current<span style="color: #3fdfd0;">)</span>
    <span style="color: #3fdfd0;">(</span><span style="color: var(--clr-string); background-color: var(--bg-string);">"&lt;"</span> smerge-diff-base-upper<span style="color: #3fdfd0;">)</span>
    <span style="color: #3fdfd0;">(</span><span style="color: var(--clr-string); background-color: var(--bg-string);">"="</span> smerge-diff-upper-lower<span style="color: #3fdfd0;">)</span>
    <span style="color: #3fdfd0;">(</span><span style="color: var(--clr-string); background-color: var(--bg-string);">"&gt;"</span> smerge-diff-base-lower<span style="color: #3fdfd0;">)</span>
    <span style="color: #3fdfd0;">(</span><span style="color: var(--clr-string); background-color: var(--bg-string);">"H"</span> smerge-refine<span style="color: #3fdfd0;">)</span>
    <span style="color: #3fdfd0;">(</span><span style="color: var(--clr-string); background-color: var(--bg-string);">"E"</span> smerge-ediff<span style="color: #3fdfd0;">)</span>
    <span style="color: #3fdfd0;">(</span><span style="color: var(--clr-string); background-color: var(--bg-string);">"C"</span> smerge-combine-with-next<span style="color: #3fdfd0;">)</span>
    <span style="color: #3fdfd0;">(</span><span style="color: var(--clr-string); background-color: var(--bg-string);">"r"</span> smerge-resolve<span style="color: #3fdfd0;">)</span>
    <span style="color: #3fdfd0;">(</span><span style="color: var(--clr-string); background-color: var(--bg-string);">"R"</span> smerge-kill-current<span style="color: #3fdfd0;">)</span>
    <span style="color: #3fdfd0;">(</span><span style="color: var(--clr-string); background-color: var(--bg-string);">"q"</span> nil <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:color</span> blue<span style="color: #3fdfd0;">)</span><span style="color: #ff62d4;">)</span><span style="color: #ffffff;">)</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org3d2bcf4" class="outline-3">
<h3 id="org3d2bcf4"><span class="section-number-3">8.3</span> hydra</h3>
<div class="outline-text-3" id="text-8-3">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #ffffff;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">use-package</span> <span style="color: var(--clr-constant); background-color: var(--bg-constant);">hydra</span><span style="color: #ffffff;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgb7013f7" class="outline-3">
<h3 id="orgb7013f7"><span class="section-number-3">8.4</span> Highlight indentation guides</h3>
<div class="outline-text-3" id="text-8-4">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: var(--clr-comment-delimiter); background-color: var(--bg-comment-delimiter);">;; </span><span style="color: var(--clr-comment); background-color: var(--bg-comment);">add a visual intent guide</span>
<span style="color: #ffffff;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">use-package</span> <span style="color: var(--clr-constant); background-color: var(--bg-constant);">highlight-indent-guides</span>
  <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:hook</span> <span style="color: #ff62d4;">(</span>prog-mode . highlight-indent-guides-mode<span style="color: #ff62d4;">)</span>
  <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:init</span>
  <span style="color: #ff62d4;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">setq</span> highlight-indent-guides-method 'column<span style="color: #ff62d4;">)</span>
  <span style="color: var(--clr-comment-delimiter); background-color: var(--bg-comment-delimiter);">;; </span><span style="color: var(--clr-comment); background-color: var(--bg-comment);">(setq highlight-indent-guides-character ?|)</span>
  <span style="color: #ff62d4;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">setq</span> highlight-indent-guides-responsive 'stack<span style="color: #ff62d4;">)</span>
  <span style="color: #ffffff;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org1f7b3cc" class="outline-3">
<h3 id="org1f7b3cc"><span class="section-number-3">8.5</span> rainbow parenthesis</h3>
<div class="outline-text-3" id="text-8-5">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #ffffff;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">use-package</span> <span style="color: var(--clr-constant); background-color: var(--bg-constant);">rainbow-delimiters</span>
  <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:hook</span> <span style="color: #ff62d4;">(</span><span style="color: #3fdfd0;">(</span>emacs-lisp-mode . rainbow-delimiters-mode<span style="color: #3fdfd0;">)</span>
         <span style="color: #3fdfd0;">(</span>clojure-mode . rainbow-delimiters-mode<span style="color: #3fdfd0;">)</span>
         <span style="color: #3fdfd0;">(</span>org-mode . rainbow-delimiters-mode<span style="color: #3fdfd0;">)</span><span style="color: #ff62d4;">)</span><span style="color: #ffffff;">)</span>
</pre>
</div>
</div>
</div>
