readme.org
** syntax highlighting
#+BEGIN_SRC emacs-lisp
  (use-package tree-sitter
    :hook (python-mode . (lambda ()
                           (require 'tree-sitter)
                           (require 'tree-sitter-langs)
                           (require 'tree-sitter-hl)
                           (tree-sitter-hl-mode))))

  (use-package tree-sitter-langs
    :after tree-sitter)
#+END_SRC

** company-mode
#+BEGIN_SRC emacs-lisp
  (use-package company
    :demand
    :general
    (company-active-map
     "TAB"       nil    ;; interferes with yasnippet
     [tab]       nil)
    :init
    (setq company-backends '((company-capf :with company-yasnippet)
                             (company-keywords company-files)))
    (setq company-minimum-prefix-length 1)
    (setq company-idle-delay 0.0)
    ;; always show candidates in overlay tooltip
    (setq company-frontends '(company-pseudo-tooltip-frontend))
    ;; don't fill the only candidate
    (setq company-auto-complete nil
          company-auto-complete-chars nil)
    :config
    (global-company-mode)
    )
#+END_SRC

