readme.html

<div id="outline-container-orgb8e9902" class="outline-3">
<h3 id="orgb8e9902"><span class="section-number-3">8.6</span> syntax highlighting</h3>
<div class="outline-text-3" id="text-8-6">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #ffffff;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">use-package</span> <span style="color: var(--clr-constant); background-color: var(--bg-constant);">tree-sitter</span>
  <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:hook</span> <span style="color: #ff62d4;">(</span>python-mode . <span style="color: #3fdfd0;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">lambda</span> <span style="color: #fba849;">()</span>
                         <span style="color: #fba849;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">require</span> '<span style="color: var(--clr-constant); background-color: var(--bg-constant);">tree-sitter</span><span style="color: #fba849;">)</span>
                         <span style="color: #fba849;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">require</span> '<span style="color: var(--clr-constant); background-color: var(--bg-constant);">tree-sitter-langs</span><span style="color: #fba849;">)</span>
                         <span style="color: #fba849;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">require</span> '<span style="color: var(--clr-constant); background-color: var(--bg-constant);">tree-sitter-hl</span><span style="color: #fba849;">)</span>
                         <span style="color: #fba849;">(</span>tree-sitter-hl-mode<span style="color: #fba849;">)</span><span style="color: #3fdfd0;">)</span><span style="color: #ff62d4;">)</span><span style="color: #ffffff;">)</span>

<span style="color: #ffffff;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">use-package</span> <span style="color: var(--clr-constant); background-color: var(--bg-constant);">tree-sitter-langs</span>
  <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:after</span> tree-sitter<span style="color: #ffffff;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orga2a0a0f" class="outline-3">
<h3 id="orga2a0a0f"><span class="section-number-3">8.7</span> company-mode</h3>
<div class="outline-text-3" id="text-8-7">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #ffffff;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">use-package</span> <span style="color: var(--clr-constant); background-color: var(--bg-constant);">company</span>
  <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:demand</span>
  <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:general</span>
  <span style="color: #ff62d4;">(</span>company-active-map
   <span style="color: var(--clr-string); background-color: var(--bg-string);">"TAB"</span>       nil    <span style="color: var(--clr-comment-delimiter); background-color: var(--bg-comment-delimiter);">;; </span><span style="color: var(--clr-comment); background-color: var(--bg-comment);">interferes with yasnippet</span>
   <span style="color: #3fdfd0;">[</span>tab<span style="color: #3fdfd0;">]</span>       nil<span style="color: #ff62d4;">)</span>
  <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:init</span>
  <span style="color: #ff62d4;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">setq</span> company-backends '<span style="color: #3fdfd0;">(</span><span style="color: #fba849;">(</span>company-capf <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:with</span> company-yasnippet<span style="color: #fba849;">)</span>
                           <span style="color: #fba849;">(</span>company-keywords company-files<span style="color: #fba849;">)</span><span style="color: #3fdfd0;">)</span><span style="color: #ff62d4;">)</span>
  <span style="color: #ff62d4;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">setq</span> company-minimum-prefix-length 1<span style="color: #ff62d4;">)</span>
  <span style="color: #ff62d4;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">setq</span> company-idle-delay 0.0<span style="color: #ff62d4;">)</span>
  <span style="color: var(--clr-comment-delimiter); background-color: var(--bg-comment-delimiter);">;; </span><span style="color: var(--clr-comment); background-color: var(--bg-comment);">always show candidates in overlay tooltip</span>
  <span style="color: #ff62d4;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">setq</span> company-frontends '<span style="color: #3fdfd0;">(</span>company-pseudo-tooltip-frontend<span style="color: #3fdfd0;">)</span><span style="color: #ff62d4;">)</span>
  <span style="color: var(--clr-comment-delimiter); background-color: var(--bg-comment-delimiter);">;; </span><span style="color: var(--clr-comment); background-color: var(--bg-comment);">don't fill the only candidate</span>
  <span style="color: #ff62d4;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">setq</span> company-auto-complete nil
        company-auto-complete-chars nil<span style="color: #ff62d4;">)</span>
  <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:config</span>
  <span style="color: #ff62d4;">(</span>global-company-mode<span style="color: #ff62d4;">)</span>
  <span style="color: #ffffff;">)</span>
</pre>
</div>
</div>
</div>
