readme.html

<div id="outline-container-orgdaadd7b" class="outline-3">
<h3 id="orgdaadd7b"><span class="section-number-3">8.8</span> <span class="todo TODO">TODO</span> company box</h3>
<div class="outline-text-3" id="text-8-8">
<p>
Taken from DOOM
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #ffffff;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">use-package</span> <span style="color: var(--clr-constant); background-color: var(--bg-constant);">company-box</span>
  <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:hook</span> <span style="color: #ff62d4;">(</span>company-mode . company-box-mode<span style="color: #ff62d4;">)</span>
  <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:config</span>
  <span style="color: #ff62d4;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">setq</span> company-box-show-single-candidate t
        company-box-backends-colors nil
        company-box-max-candidates 50
        company-box-icons-alist 'company-box-icons-all-the-icons
        company-box-icons-all-the-icons
        <span style="color: #3fdfd0;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">let</span> <span style="color: #fba849;">(</span><span style="color: #9f80ff;">(</span>all-the-icons-scale-factor 0.8<span style="color: #9f80ff;">)</span><span style="color: #fba849;">)</span>
          `<span style="color: #fba849;">(</span><span style="color: #9f80ff;">(</span>Unknown       . ,<span style="color: #4fe42f;">(</span>all-the-icons-material <span style="color: var(--clr-string); background-color: var(--bg-string);">"find_in_page"</span>             <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:face</span> 'all-the-icons-purple<span style="color: #4fe42f;">)</span><span style="color: #9f80ff;">)</span>
            <span style="color: #9f80ff;">(</span>Text          . ,<span style="color: #4fe42f;">(</span>all-the-icons-material <span style="color: var(--clr-string); background-color: var(--bg-string);">"text_fields"</span>              <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:face</span> 'all-the-icons-green<span style="color: #4fe42f;">)</span><span style="color: #9f80ff;">)</span>
            <span style="color: #9f80ff;">(</span>Method        . ,<span style="color: #4fe42f;">(</span>all-the-icons-material <span style="color: var(--clr-string); background-color: var(--bg-string);">"functions"</span>                <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:face</span> 'all-the-icons-red<span style="color: #4fe42f;">)</span><span style="color: #9f80ff;">)</span>
            <span style="color: #9f80ff;">(</span>Function      . ,<span style="color: #4fe42f;">(</span>all-the-icons-material <span style="color: var(--clr-string); background-color: var(--bg-string);">"functions"</span>                <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:face</span> 'all-the-icons-red<span style="color: #4fe42f;">)</span><span style="color: #9f80ff;">)</span>
            <span style="color: #9f80ff;">(</span>Constructor   . ,<span style="color: #4fe42f;">(</span>all-the-icons-material <span style="color: var(--clr-string); background-color: var(--bg-string);">"functions"</span>                <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:face</span> 'all-the-icons-red<span style="color: #4fe42f;">)</span><span style="color: #9f80ff;">)</span>
            <span style="color: #9f80ff;">(</span>Field         . ,<span style="color: #4fe42f;">(</span>all-the-icons-material <span style="color: var(--clr-string); background-color: var(--bg-string);">"functions"</span>                <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:face</span> 'all-the-icons-red<span style="color: #4fe42f;">)</span><span style="color: #9f80ff;">)</span>
            <span style="color: #9f80ff;">(</span>Variable      . ,<span style="color: #4fe42f;">(</span>all-the-icons-material <span style="color: var(--clr-string); background-color: var(--bg-string);">"adjust"</span>                   <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:face</span> 'all-the-icons-blue<span style="color: #4fe42f;">)</span><span style="color: #9f80ff;">)</span>
            <span style="color: #9f80ff;">(</span>Class         . ,<span style="color: #4fe42f;">(</span>all-the-icons-material <span style="color: var(--clr-string); background-color: var(--bg-string);">"class"</span>                    <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:face</span> 'all-the-icons-red<span style="color: #4fe42f;">)</span><span style="color: #9f80ff;">)</span>
            <span style="color: #9f80ff;">(</span>Interface     . ,<span style="color: #4fe42f;">(</span>all-the-icons-material <span style="color: var(--clr-string); background-color: var(--bg-string);">"settings_input_component"</span> <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:face</span> 'all-the-icons-red<span style="color: #4fe42f;">)</span><span style="color: #9f80ff;">)</span>
            <span style="color: #9f80ff;">(</span>Module        . ,<span style="color: #4fe42f;">(</span>all-the-icons-material <span style="color: var(--clr-string); background-color: var(--bg-string);">"view_module"</span>              <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:face</span> 'all-the-icons-red<span style="color: #4fe42f;">)</span><span style="color: #9f80ff;">)</span>
            <span style="color: #9f80ff;">(</span>Property      . ,<span style="color: #4fe42f;">(</span>all-the-icons-material <span style="color: var(--clr-string); background-color: var(--bg-string);">"settings"</span>                 <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:face</span> 'all-the-icons-red<span style="color: #4fe42f;">)</span><span style="color: #9f80ff;">)</span>
            <span style="color: #9f80ff;">(</span>Unit          . ,<span style="color: #4fe42f;">(</span>all-the-icons-material <span style="color: var(--clr-string); background-color: var(--bg-string);">"straighten"</span>               <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:face</span> 'all-the-icons-red<span style="color: #4fe42f;">)</span><span style="color: #9f80ff;">)</span>
            <span style="color: #9f80ff;">(</span>Value         . ,<span style="color: #4fe42f;">(</span>all-the-icons-material <span style="color: var(--clr-string); background-color: var(--bg-string);">"filter_1"</span>                 <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:face</span> 'all-the-icons-red<span style="color: #4fe42f;">)</span><span style="color: #9f80ff;">)</span>
            <span style="color: #9f80ff;">(</span>Enum          . ,<span style="color: #4fe42f;">(</span>all-the-icons-material <span style="color: var(--clr-string); background-color: var(--bg-string);">"plus_one"</span>                 <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:face</span> 'all-the-icons-red<span style="color: #4fe42f;">)</span><span style="color: #9f80ff;">)</span>
            <span style="color: #9f80ff;">(</span>Keyword       . ,<span style="color: #4fe42f;">(</span>all-the-icons-material <span style="color: var(--clr-string); background-color: var(--bg-string);">"filter_center_focus"</span>      <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:face</span> 'all-the-icons-red<span style="color: #4fe42f;">)</span><span style="color: #9f80ff;">)</span>
            <span style="color: #9f80ff;">(</span>Snippet       . ,<span style="color: #4fe42f;">(</span>all-the-icons-material <span style="color: var(--clr-string); background-color: var(--bg-string);">"short_text"</span>               <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:face</span> 'all-the-icons-red<span style="color: #4fe42f;">)</span><span style="color: #9f80ff;">)</span>
            <span style="color: #9f80ff;">(</span>Color         . ,<span style="color: #4fe42f;">(</span>all-the-icons-material <span style="color: var(--clr-string); background-color: var(--bg-string);">"color_lens"</span>               <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:face</span> 'all-the-icons-red<span style="color: #4fe42f;">)</span><span style="color: #9f80ff;">)</span>
            <span style="color: #9f80ff;">(</span>File          . ,<span style="color: #4fe42f;">(</span>all-the-icons-material <span style="color: var(--clr-string); background-color: var(--bg-string);">"insert_drive_file"</span>        <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:face</span> 'all-the-icons-red<span style="color: #4fe42f;">)</span><span style="color: #9f80ff;">)</span>
            <span style="color: #9f80ff;">(</span>Reference     . ,<span style="color: #4fe42f;">(</span>all-the-icons-material <span style="color: var(--clr-string); background-color: var(--bg-string);">"collections_bookmark"</span>     <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:face</span> 'all-the-icons-red<span style="color: #4fe42f;">)</span><span style="color: #9f80ff;">)</span>
            <span style="color: #9f80ff;">(</span>Folder        . ,<span style="color: #4fe42f;">(</span>all-the-icons-material <span style="color: var(--clr-string); background-color: var(--bg-string);">"folder"</span>                   <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:face</span> 'all-the-icons-red<span style="color: #4fe42f;">)</span><span style="color: #9f80ff;">)</span>
            <span style="color: #9f80ff;">(</span>EnumMember    . ,<span style="color: #4fe42f;">(</span>all-the-icons-material <span style="color: var(--clr-string); background-color: var(--bg-string);">"people"</span>                   <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:face</span> 'all-the-icons-red<span style="color: #4fe42f;">)</span><span style="color: #9f80ff;">)</span>
            <span style="color: #9f80ff;">(</span>Constant      . ,<span style="color: #4fe42f;">(</span>all-the-icons-material <span style="color: var(--clr-string); background-color: var(--bg-string);">"pause_circle_filled"</span>      <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:face</span> 'all-the-icons-red<span style="color: #4fe42f;">)</span><span style="color: #9f80ff;">)</span>
            <span style="color: #9f80ff;">(</span>Struct        . ,<span style="color: #4fe42f;">(</span>all-the-icons-material <span style="color: var(--clr-string); background-color: var(--bg-string);">"streetview"</span>               <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:face</span> 'all-the-icons-red<span style="color: #4fe42f;">)</span><span style="color: #9f80ff;">)</span>
            <span style="color: #9f80ff;">(</span>Event         . ,<span style="color: #4fe42f;">(</span>all-the-icons-material <span style="color: var(--clr-string); background-color: var(--bg-string);">"event"</span>                    <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:face</span> 'all-the-icons-red<span style="color: #4fe42f;">)</span><span style="color: #9f80ff;">)</span>
            <span style="color: #9f80ff;">(</span>Operator      . ,<span style="color: #4fe42f;">(</span>all-the-icons-material <span style="color: var(--clr-string); background-color: var(--bg-string);">"control_point"</span>            <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:face</span> 'all-the-icons-red<span style="color: #4fe42f;">)</span><span style="color: #9f80ff;">)</span>
            <span style="color: #9f80ff;">(</span>TypeParameter . ,<span style="color: #4fe42f;">(</span>all-the-icons-material <span style="color: var(--clr-string); background-color: var(--bg-string);">"class"</span>                    <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:face</span> 'all-the-icons-red<span style="color: #4fe42f;">)</span><span style="color: #9f80ff;">)</span>
            <span style="color: #9f80ff;">(</span>Template      . ,<span style="color: #4fe42f;">(</span>all-the-icons-material <span style="color: var(--clr-string); background-color: var(--bg-string);">"short_text"</span>               <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:face</span> 'all-the-icons-green<span style="color: #4fe42f;">)</span><span style="color: #9f80ff;">)</span>
            <span style="color: #9f80ff;">(</span>ElispFunction . ,<span style="color: #4fe42f;">(</span>all-the-icons-material <span style="color: var(--clr-string); background-color: var(--bg-string);">"functions"</span>                <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:face</span> 'all-the-icons-red<span style="color: #4fe42f;">)</span><span style="color: #9f80ff;">)</span>
            <span style="color: #9f80ff;">(</span>ElispVariable . ,<span style="color: #4fe42f;">(</span>all-the-icons-material <span style="color: var(--clr-string); background-color: var(--bg-string);">"check_circle"</span>             <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:face</span> 'all-the-icons-blue<span style="color: #4fe42f;">)</span><span style="color: #9f80ff;">)</span>
            <span style="color: #9f80ff;">(</span>ElispFeature  . ,<span style="color: #4fe42f;">(</span>all-the-icons-material <span style="color: var(--clr-string); background-color: var(--bg-string);">"stars"</span>                    <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:face</span> 'all-the-icons-orange<span style="color: #4fe42f;">)</span><span style="color: #9f80ff;">)</span>
            <span style="color: #9f80ff;">(</span>ElispFace     . ,<span style="color: #4fe42f;">(</span>all-the-icons-material <span style="color: var(--clr-string); background-color: var(--bg-string);">"format_paint"</span>             <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:face</span> 'all-the-icons-pink<span style="color: #4fe42f;">)</span><span style="color: #9f80ff;">)</span><span style="color: #fba849;">)</span><span style="color: #3fdfd0;">)</span><span style="color: #ff62d4;">)</span>

  <span style="color: var(--clr-comment-delimiter); background-color: var(--bg-comment-delimiter);">;; </span><span style="color: var(--clr-comment); background-color: var(--bg-comment);">Disable tab-bar in company-box child frames</span>
  <span style="color: #ff62d4;">(</span>add-to-list 'company-box-frame-parameters '<span style="color: #3fdfd0;">(</span>tab-bar-lines . 0<span style="color: #3fdfd0;">)</span><span style="color: #ff62d4;">)</span>
  <span style="color: #ffffff;">)</span>
</pre>
</div>
</div>
</div>
