readme.org
** envrc
#+begin_src emacs-lisp
    (use-package envrc
      :hook ((python-mode . envrc-mode)
             (org-mode . envrc-mode)))
#+end_src

** yasnippet
#+begin_src emacs-lisp
    (use-package yasnippet
      :hook
      ((text-mode . yas-minor-mode)
       (prog-mode . yas-minor-mode)
       (org-mode . yas-minor-mode)))
#+end_src

** evil-multicursor
The prefix is =g r=, inspect the commands with ~which-key~
#+begin_src emacs-lisp
  (use-package evil-mc
    :general
    (general-nmap "gz" #'mc-hydra/body)
    :config
    (defhydra mc-hydra (:color pink :hint nil
                               :pre (evil-mc-pause-cursors))
      "
  ^Match^            ^Line-wise^           ^Manual^
  ^^^^^^----------------------------------------------------
  _Z_: match all     _J_: make & go down   _R_: remove all
  _m_: make & next   _K_: make & go up     
  _M_: make & prev   ^ ^                   
  _n_: skip & next   ^ ^                   
  _N_: skip & prev

  Current pattern: %`evil-mc-pattern

  "
      ("Z" #'evil-mc-make-all-cursors)
      ("m" #'evil-mc-make-and-goto-next-match)
      ("M" #'evil-mc-make-and-goto-prev-match)
      ("n" #'evil-mc-skip-and-goto-next-match)
      ("N" #'evil-mc-skip-and-goto-prev-match)
      ("J" #'evil-mc-make-cursor-move-next-line)
      ("K" #'evil-mc-make-cursor-move-prev-line)
      ("R" #'evil-mc-undo-all-cursors)
      ("q" #'evil-mc-resume-cursors "quit" :color blue)
      ("<escape>" #'evil-mc-resume-cursors "quit" :color blue))
    (global-evil-mc-mode +1)
    )
#+end_src

** evil-nerd-commenter
#+BEGIN_SRC emacs-lisp
  (use-package evil-nerd-commenter
    :general
    (general-nmap "gcc" 'evilnc-comment-or-uncomment-lines)
    (general-vmap "gc" 'evilnc-comment-or-uncomment-lines)
    )
#+END_SRC

** evil-surround
#+BEGIN_SRC emacs-lisp
(use-package evil-surround
  :general
  (:states 'operator
   "s" 'evil-surround-edit
   "S" 'evil-Surround-edit)
  (:states 'visual
   "S" 'evil-surround-region
   "gS" 'evil-Surround-region))
#+END_SRC

** undo fu
#+begin_src emacs-lisp
  (use-package undo-fu
    :general
    (:states 'normal
             "u" 'undo-fu-only-undo
             "\C-r" 'undo-fu-only-redo))
#+end_src

** vterm
#+BEGIN_SRC emacs-lisp
  (use-package vterm
    :general
    (my/leader-keys
      "'" 'vterm-other-window)
    :config
    (setq vterm-shell (executable-find "fish")
          vterm-max-scrollback 10000))
#+END_SRC

