readme.html

<div id="outline-container-orgc892934" class="outline-3">
<h3 id="orgc892934"><span class="section-number-3">8.9</span> envrc</h3>
<div class="outline-text-3" id="text-8-9">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #ffffff;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">use-package</span> <span style="color: var(--clr-constant); background-color: var(--bg-constant);">envrc</span>
  <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:hook</span> <span style="color: #ff62d4;">(</span><span style="color: #3fdfd0;">(</span>python-mode . envrc-mode<span style="color: #3fdfd0;">)</span>
         <span style="color: #3fdfd0;">(</span>org-mode . envrc-mode<span style="color: #3fdfd0;">)</span><span style="color: #ff62d4;">)</span><span style="color: #ffffff;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org615435a" class="outline-3">
<h3 id="org615435a"><span class="section-number-3">8.10</span> yasnippet</h3>
<div class="outline-text-3" id="text-8-10">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #ffffff;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">use-package</span> <span style="color: var(--clr-constant); background-color: var(--bg-constant);">yasnippet</span>
  <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:hook</span>
  <span style="color: #ff62d4;">(</span><span style="color: #3fdfd0;">(</span>text-mode . yas-minor-mode<span style="color: #3fdfd0;">)</span>
   <span style="color: #3fdfd0;">(</span>prog-mode . yas-minor-mode<span style="color: #3fdfd0;">)</span>
   <span style="color: #3fdfd0;">(</span>org-mode . yas-minor-mode<span style="color: #3fdfd0;">)</span><span style="color: #ff62d4;">)</span><span style="color: #ffffff;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org103f49b" class="outline-3">
<h3 id="org103f49b"><span class="section-number-3">8.11</span> evil-multicursor</h3>
<div class="outline-text-3" id="text-8-11">
<p>
The prefix is <code>g r</code>, inspect the commands with <code>which-key</code>
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #ffffff;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">use-package</span> <span style="color: var(--clr-constant); background-color: var(--bg-constant);">evil-mc</span>
  <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:general</span>
  <span style="color: #ff62d4;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">general-nmap</span> <span style="color: var(--clr-string); background-color: var(--bg-string);">"gz"</span> #'mc-hydra/body<span style="color: #ff62d4;">)</span>
  <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:config</span>
  <span style="color: #ff62d4;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">defhydra</span> mc-hydra <span style="color: #3fdfd0;">(</span><span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:color</span> pink <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:hint</span> nil
                             <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:pre</span> <span style="color: #fba849;">(</span>evil-mc-pause-cursors<span style="color: #fba849;">)</span><span style="color: #3fdfd0;">)</span>
    <span style="color: var(--clr-doc); background-color: var(--bg-doc);">"</span>
<span style="color: var(--clr-doc); background-color: var(--bg-doc);">^Match^            ^Line-wise^           ^Manual^</span>
<span style="color: var(--clr-doc); background-color: var(--bg-doc);">^^^^^^----------------------------------------------------</span>
<span style="color: var(--clr-doc); background-color: var(--bg-doc);">_Z_: match all     _J_: make &amp; go down   _R_: remove all</span>
<span style="color: var(--clr-doc); background-color: var(--bg-doc);">_m_: make &amp; next   _K_: make &amp; go up     </span>
<span style="color: var(--clr-doc); background-color: var(--bg-doc);">_M_: make &amp; prev   ^ ^                   </span>
<span style="color: var(--clr-doc); background-color: var(--bg-doc);">_n_: skip &amp; next   ^ ^                   </span>
<span style="color: var(--clr-doc); background-color: var(--bg-doc);">_N_: skip &amp; prev</span>

<span style="color: var(--clr-doc); background-color: var(--bg-doc);">Current pattern: %`evil-mc-pattern</span>

<span style="color: var(--clr-doc); background-color: var(--bg-doc);">"</span>
    <span style="color: #3fdfd0;">(</span><span style="color: var(--clr-string); background-color: var(--bg-string);">"Z"</span> #'evil-mc-make-all-cursors<span style="color: #3fdfd0;">)</span>
    <span style="color: #3fdfd0;">(</span><span style="color: var(--clr-string); background-color: var(--bg-string);">"m"</span> #'evil-mc-make-and-goto-next-match<span style="color: #3fdfd0;">)</span>
    <span style="color: #3fdfd0;">(</span><span style="color: var(--clr-string); background-color: var(--bg-string);">"M"</span> #'evil-mc-make-and-goto-prev-match<span style="color: #3fdfd0;">)</span>
    <span style="color: #3fdfd0;">(</span><span style="color: var(--clr-string); background-color: var(--bg-string);">"n"</span> #'evil-mc-skip-and-goto-next-match<span style="color: #3fdfd0;">)</span>
    <span style="color: #3fdfd0;">(</span><span style="color: var(--clr-string); background-color: var(--bg-string);">"N"</span> #'evil-mc-skip-and-goto-prev-match<span style="color: #3fdfd0;">)</span>
    <span style="color: #3fdfd0;">(</span><span style="color: var(--clr-string); background-color: var(--bg-string);">"J"</span> #'evil-mc-make-cursor-move-next-line<span style="color: #3fdfd0;">)</span>
    <span style="color: #3fdfd0;">(</span><span style="color: var(--clr-string); background-color: var(--bg-string);">"K"</span> #'evil-mc-make-cursor-move-prev-line<span style="color: #3fdfd0;">)</span>
    <span style="color: #3fdfd0;">(</span><span style="color: var(--clr-string); background-color: var(--bg-string);">"R"</span> #'evil-mc-undo-all-cursors<span style="color: #3fdfd0;">)</span>
    <span style="color: #3fdfd0;">(</span><span style="color: var(--clr-string); background-color: var(--bg-string);">"q"</span> #'evil-mc-resume-cursors <span style="color: var(--clr-string); background-color: var(--bg-string);">"quit"</span> <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:color</span> blue<span style="color: #3fdfd0;">)</span>
    <span style="color: #3fdfd0;">(</span><span style="color: var(--clr-string); background-color: var(--bg-string);">"&lt;escape&gt;"</span> #'evil-mc-resume-cursors <span style="color: var(--clr-string); background-color: var(--bg-string);">"quit"</span> <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:color</span> blue<span style="color: #3fdfd0;">)</span><span style="color: #ff62d4;">)</span>
  <span style="color: #ff62d4;">(</span>global-evil-mc-mode +1<span style="color: #ff62d4;">)</span>
  <span style="color: #ffffff;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org70c4429" class="outline-3">
<h3 id="org70c4429"><span class="section-number-3">8.12</span> evil-nerd-commenter</h3>
<div class="outline-text-3" id="text-8-12">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #ffffff;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">use-package</span> <span style="color: var(--clr-constant); background-color: var(--bg-constant);">evil-nerd-commenter</span>
  <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:general</span>
  <span style="color: #ff62d4;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">general-nmap</span> <span style="color: var(--clr-string); background-color: var(--bg-string);">"gcc"</span> 'evilnc-comment-or-uncomment-lines<span style="color: #ff62d4;">)</span>
  <span style="color: #ff62d4;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">general-vmap</span> <span style="color: var(--clr-string); background-color: var(--bg-string);">"gc"</span> 'evilnc-comment-or-uncomment-lines<span style="color: #ff62d4;">)</span>
  <span style="color: #ffffff;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org8c6baeb" class="outline-3">
<h3 id="org8c6baeb"><span class="section-number-3">8.13</span> evil-surround</h3>
<div class="outline-text-3" id="text-8-13">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #ffffff;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">use-package</span> <span style="color: var(--clr-constant); background-color: var(--bg-constant);">evil-surround</span>
  <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:general</span>
  <span style="color: #ff62d4;">(</span><span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:states</span> 'operator
   <span style="color: var(--clr-string); background-color: var(--bg-string);">"s"</span> 'evil-surround-edit
   <span style="color: var(--clr-string); background-color: var(--bg-string);">"S"</span> 'evil-Surround-edit<span style="color: #ff62d4;">)</span>
  <span style="color: #ff62d4;">(</span><span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:states</span> 'visual
   <span style="color: var(--clr-string); background-color: var(--bg-string);">"S"</span> 'evil-surround-region
   <span style="color: var(--clr-string); background-color: var(--bg-string);">"gS"</span> 'evil-Surround-region<span style="color: #ff62d4;">)</span><span style="color: #ffffff;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orge0efcde" class="outline-3">
<h3 id="orge0efcde"><span class="section-number-3">8.14</span> undo fu</h3>
<div class="outline-text-3" id="text-8-14">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #ffffff;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">use-package</span> <span style="color: var(--clr-constant); background-color: var(--bg-constant);">undo-fu</span>
  <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:general</span>
  <span style="color: #ff62d4;">(</span><span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:states</span> 'normal
           <span style="color: var(--clr-string); background-color: var(--bg-string);">"u"</span> 'undo-fu-only-undo
           <span style="color: var(--clr-string); background-color: var(--bg-string);">"\C-r"</span> 'undo-fu-only-redo<span style="color: #ff62d4;">)</span><span style="color: #ffffff;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org681fc69" class="outline-3">
<h3 id="org681fc69"><span class="section-number-3">8.15</span> vterm</h3>
<div class="outline-text-3" id="text-8-15">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #ffffff;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">use-package</span> <span style="color: var(--clr-constant); background-color: var(--bg-constant);">vterm</span>
  <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:general</span>
  <span style="color: #ff62d4;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">my/leader-keys</span>
    <span style="color: var(--clr-string); background-color: var(--bg-string);">"'"</span> 'vterm-other-window<span style="color: #ff62d4;">)</span>
  <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:config</span>
  <span style="color: #ff62d4;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">setq</span> vterm-shell <span style="color: #3fdfd0;">(</span>executable-find <span style="color: var(--clr-string); background-color: var(--bg-string);">"fish"</span><span style="color: #3fdfd0;">)</span>
        vterm-max-scrollback 10000<span style="color: #ff62d4;">)</span><span style="color: #ffffff;">)</span>
</pre>
</div>
</div>
</div>
