readme.org
** dired
- Jump to current file with =SPC f j=
- Hide details with ~(~
- Hide dotfiles with =H=
- Mark with ~m~, unmark with ~u~
- Invert selection with ~t~
- ~*~ has some helpers for marking
- First mark some files and then ~K~ to "hide" them
- Open directory in right window with ~S-RET~
  + When copying from left window, target will be right window
  + Copy with ~C~
- Open subdir in buffer below with ~I~
- Open files with macos with =O=
- View files with =go= and exit with ~q~

#+BEGIN_SRC emacs-lisp
  (use-package dired
    :straight (:type built-in)
    :general
    (my/leader-keys
      "f d" 'dired
      "f j" 'dired-jump))

  (use-package dired-single
    :after dired
    :general
    (dired-mode-map
     :states 'normal
     "h" 'dired-single-up-directory
     "l" 'dired-single-buffer
     "q" 'quit-window))

  (use-package all-the-icons-dired
    :hook (dired-mode . all-the-icons-dired-mode))
#+END_SRC

** restart-emacs
#+begin_src emacs-lisp
  (use-package restart-emacs
    :general
    (my/leader-keys
      "R" '(restart-emacs :wk "restart"))
    )
#+end_src

* Org mode
