readme.html

<div id="outline-container-orgd7aa025" class="outline-3">
<h3 id="orgd7aa025"><span class="section-number-3">8.16</span> dired</h3>
<div class="outline-text-3" id="text-8-16">
<ul class="org-ul">
<li>Jump to current file with <code>SPC f j</code></li>
<li>Hide details with <code>(</code></li>
<li>Hide dotfiles with <code>H</code></li>
<li>Mark with <code>m</code>, unmark with <code>u</code></li>
<li>Invert selection with <code>t</code></li>
<li><code>*</code> has some helpers for marking</li>
<li>First mark some files and then <code>K</code> to "hide" them</li>
<li>Open directory in right window with <code>S-RET</code>
<ul class="org-ul">
<li>When copying from left window, target will be right window</li>
<li>Copy with <code>C</code></li>
</ul></li>
<li>Open subdir in buffer below with <code>I</code></li>
<li>Open files with macos with <code>O</code></li>
<li>View files with <code>go</code> and exit with <code>q</code></li>
</ul>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #ffffff;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">use-package</span> <span style="color: var(--clr-constant); background-color: var(--bg-constant);">dired</span>
  <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:straight</span> <span style="color: #ff62d4;">(</span><span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:type</span> built-in<span style="color: #ff62d4;">)</span>
  <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:general</span>
  <span style="color: #ff62d4;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">my/leader-keys</span>
    <span style="color: var(--clr-string); background-color: var(--bg-string);">"f d"</span> 'dired
    <span style="color: var(--clr-string); background-color: var(--bg-string);">"f j"</span> 'dired-jump<span style="color: #ff62d4;">)</span><span style="color: #ffffff;">)</span>

<span style="color: #ffffff;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">use-package</span> <span style="color: var(--clr-constant); background-color: var(--bg-constant);">dired-single</span>
  <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:after</span> dired
  <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:general</span>
  <span style="color: #ff62d4;">(</span>dired-mode-map
   <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:states</span> 'normal
   <span style="color: var(--clr-string); background-color: var(--bg-string);">"h"</span> 'dired-single-up-directory
   <span style="color: var(--clr-string); background-color: var(--bg-string);">"l"</span> 'dired-single-buffer
   <span style="color: var(--clr-string); background-color: var(--bg-string);">"q"</span> 'quit-window<span style="color: #ff62d4;">)</span><span style="color: #ffffff;">)</span>

<span style="color: #ffffff;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">use-package</span> <span style="color: var(--clr-constant); background-color: var(--bg-constant);">all-the-icons-dired</span>
  <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:hook</span> <span style="color: #ff62d4;">(</span>dired-mode . all-the-icons-dired-mode<span style="color: #ff62d4;">)</span><span style="color: #ffffff;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org3f15995" class="outline-3">
<h3 id="org3f15995"><span class="section-number-3">8.17</span> restart-emacs</h3>
<div class="outline-text-3" id="text-8-17">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #ffffff;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">use-package</span> <span style="color: var(--clr-constant); background-color: var(--bg-constant);">restart-emacs</span>
  <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:general</span>
  <span style="color: #ff62d4;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">my/leader-keys</span>
    <span style="color: var(--clr-string); background-color: var(--bg-string);">"R"</span> '<span style="color: #3fdfd0;">(</span>restart-emacs <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:wk</span> <span style="color: var(--clr-string); background-color: var(--bg-string);">"restart"</span><span style="color: #3fdfd0;">)</span><span style="color: #ff62d4;">)</span>
  <span style="color: #ffffff;">)</span>
</pre>
</div>
</div>
</div>
</div>
