readme.org
** org mode configuration
#+BEGIN_SRC emacs-lisp
  (use-package org
    :hook ((org-mode . my/org-mode-setup)
           (org-mode . prettify-symbols-mode)
           (org-mode . (lambda () (add-hook 'after-save-hook #'my/org-babel-tangle-config))))
    :general
    (my/leader-keys
      "o c" '(org-capture :wk "capture")
      "o a" '(org-agenda-list :wk "agenda")
      "o t" '(org-todo-list :wk "todo list"))
    (my/local-leader-keys
      :keymaps 'org-mode-map
      "e" '(org-export-dispatch :wk "export")
      "l" '(:ignore true :wk "link")
      "l l" '(org-insert-link :wk "insert link")
      "l s" '(org-store-link :wk "store link")
      "n" '(org-toggle-narrow-to-subtree :wk "narrow subtree")
      "t" '(org-todo :wk "heading todo"))
    (org-mode-map
     :states '(normal)
     "z i" '(org-toggle-inline-images :wk "inline images"))
    :init
    ;; general settings
    (setq org-directory "~/Dropbox/org"
          org-image-actual-width nil
          +org-export-directory "~/Dropbox/org/export"
          org-default-notes-file "~/Dropbox/org/personal/tasks/todo.org"
          org-id-locations-file "~/Dropbox/org/.orgids"
          org-agenda-files '("~/dropbox/org/personal/tasks/birthdays.org" "~/dropbox/org/personal/tasks/todo.org" "~/dropbox/Notes/Test.inbox.org")
          ;; org-export-in-background t
          org-catch-invisible-edits 'smart)
    ;; disable modules for faster startup
    (setq org-modules
          '(;; ol-w3m
            ;; ol-bbdb
            ;; ol-bibtex
            ol-docview
            ;; ol-gnus
            ;; ol-info
            ;; ol-irc
            ;; ol-mhe
            ;; ol-rmail
            ;; ol-eww
            ))
    (setq org-todo-keywords
          '((sequence "TODO(t)" "PROJ(p)" "|" "DONE(d)")))
    (setq org-capture-templates
          `(("b" "Blog" entry
             (file+headline "personal/tasks/todo.org" "Blog")
             ,(concat "* WRITE %^{Title} %^g\n"
                      "SCHEDULED: %^t\n"
                      ":PROPERTIES:\n"
                      ":CAPTURED: %U\n:END:\n\n"
                      "%i%?"))
            ("d" "New Diary Entry" entry(file+olp+datetree"~/Dropbox/org/personal/diary.org" "Daily Logs")
             "* %^{thought for the day}
               :PROPERTIES:
               :CATEGORY: %^{category}
               :SUBJECT:  %^{subject}
               :MOOD:     %^{mood}
               :END:
               :RESOURCES:
               :END:

               \*What was one good thing you learned today?*:
               - %^{whatilearnedtoday}

               \*List one thing you could have done better*:
               - %^{onethingdobetter}

               \*Describe in your own words how your day was*:
               - %?")
            ("i" "Inbox" entry
             (file+headline "personal/tasks/todo.org" "Inbox")
             ,(concat "* %^{Title}\n"
                      ":PROPERTIES:\n"
                      ":CAPTURED: %U\n"
                      ":END:\n\n"
                      "%i%l"))
            ("u" "New URL Entry" entry
             (file+function "~/Dropbox/org/personal/dailies.org" org-reverse-datetree-goto-date-in-file)
             "* [[%^{URL}][%^{Description}]] %^g %?")
            ("w" "Work" entry
             (file+headline "personal/tasks/todo.org" "Work")
             ,(concat "* TODO [#A] %^{Title} :@work:\n"
                      "SCHEDULED: %^t\n"
                      ":PROPERTIES:\n:CAPTURED: %U\n:END:\n\n"
                      "%i%?"))

            ))
    (setq-default prettify-symbols-alist '(("#+BEGIN_SRC" . "»")
                                           ("#+END_SRC" . "«")
                                           ("#+begin_src" . "»")
                                           ("#+end_src" . "«")))
    (setq prettify-symbols-unprettify-at-point 'right-edge)
    ;; (setq org-agenda-custom-commands
    ;;         '(("d" "Dashboard"
    ;;            ((agenda "" ((org-deadline-warning-days 7)))
    ;;             (todo "NEXT"
    ;;                   ((org-agenda-overriding-header "Next Tasks")))
    ;;             (tags-todo "agenda/ACTIVE" ((org-agenda-overriding-header "Active Projects")))))
    ;;           ("n" "Next Tasks"
    ;;            ((todo "NEXT"
    ;;                   ((org-agenda-overriding-header "Next Tasks")))))
    ;;           ("W" "Work Tasks" tags-todo "+work-email")
    ;;           ))
    (defun my/org-mode-setup ()
      (org-indent-mode)
      (variable-pitch-mode 1)
      (visual-line-mode 1))
    (defun my/org-babel-tangle-config ()
      (when (string-equal (file-name-directory (buffer-file-name))
                          ;; file-truename resolves symlinks
                          (file-truename (expand-file-name user-emacs-directory)))
        ;; Dynamic scoping to the rescue
        (let ((org-confirm-babel-evaluate nil))
          (org-babel-tangle))))
    :config
    ;; visual
    (org-indent-mode)
    (variable-pitch-mode 1)
    (visual-line-mode 1)
    ;; org habit
    (require 'org-habit)
    (add-to-list 'org-modules 'org-habit)
    ;; (efs/org-font-setup)
    (require 'org-tempo)
    (add-to-list 'org-structure-template-alist '("sh" . "src shell"))
    (add-to-list 'org-structure-template-alist '("el" . "src emacs-lisp"))
    (add-to-list 'org-structure-template-alist '("py" . "src python"))
    (add-to-list 'org-structure-template-alist '("clj" . "src clojure"))
    (add-to-list 'org-structure-template-alist '("jp" . "src jupyter-python"))
    ;; latex
    (setq org-latex-compiler "xelatex")
    (add-to-list 'org-export-backends 'beamer)
    )
#+END_SRC

#+begin_src emacs-lisp
(use-package org-reverse-datetree
:after org)
#+end_src

