readme.html

<div id="outline-container-org5ac3b37" class="outline-2">
<h2 id="org5ac3b37"><span class="section-number-2">9</span> Org mode</h2>
<div class="outline-text-2" id="text-9">
</div>
<div id="outline-container-org453e54f" class="outline-3">
<h3 id="org453e54f"><span class="section-number-3">9.1</span> org mode configuration</h3>
<div class="outline-text-3" id="text-9-1">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #ffffff;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">use-package</span> <span style="color: var(--clr-constant); background-color: var(--bg-constant);">org</span>
  <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:hook</span> <span style="color: #ff62d4;">(</span><span style="color: #3fdfd0;">(</span>org-mode . my/org-mode-setup<span style="color: #3fdfd0;">)</span>
         <span style="color: #3fdfd0;">(</span>org-mode . prettify-symbols-mode<span style="color: #3fdfd0;">)</span>
         <span style="color: #3fdfd0;">(</span>org-mode . <span style="color: #fba849;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">lambda</span> <span style="color: #9f80ff;">()</span> <span style="color: #9f80ff;">(</span>add-hook 'after-save-hook #'my/org-babel-tangle-config<span style="color: #9f80ff;">)</span><span style="color: #fba849;">)</span><span style="color: #3fdfd0;">)</span><span style="color: #ff62d4;">)</span>
  <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:general</span>
  <span style="color: #ff62d4;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">my/leader-keys</span>
    <span style="color: var(--clr-string); background-color: var(--bg-string);">"o c"</span> '<span style="color: #3fdfd0;">(</span>org-capture <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:wk</span> <span style="color: var(--clr-string); background-color: var(--bg-string);">"capture"</span><span style="color: #3fdfd0;">)</span>
    <span style="color: var(--clr-string); background-color: var(--bg-string);">"o a"</span> '<span style="color: #3fdfd0;">(</span>org-agenda-list <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:wk</span> <span style="color: var(--clr-string); background-color: var(--bg-string);">"agenda"</span><span style="color: #3fdfd0;">)</span>
    <span style="color: var(--clr-string); background-color: var(--bg-string);">"o t"</span> '<span style="color: #3fdfd0;">(</span>org-todo-list <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:wk</span> <span style="color: var(--clr-string); background-color: var(--bg-string);">"todo list"</span><span style="color: #3fdfd0;">)</span><span style="color: #ff62d4;">)</span>
  <span style="color: #ff62d4;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">my/local-leader-keys</span>
    <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:keymaps</span> 'org-mode-map
    <span style="color: var(--clr-string); background-color: var(--bg-string);">"e"</span> '<span style="color: #3fdfd0;">(</span>org-export-dispatch <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:wk</span> <span style="color: var(--clr-string); background-color: var(--bg-string);">"export"</span><span style="color: #3fdfd0;">)</span>
    <span style="color: var(--clr-string); background-color: var(--bg-string);">"l"</span> '<span style="color: #3fdfd0;">(</span><span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:ignore</span> true <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:wk</span> <span style="color: var(--clr-string); background-color: var(--bg-string);">"link"</span><span style="color: #3fdfd0;">)</span>
    <span style="color: var(--clr-string); background-color: var(--bg-string);">"l l"</span> '<span style="color: #3fdfd0;">(</span>org-insert-link <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:wk</span> <span style="color: var(--clr-string); background-color: var(--bg-string);">"insert link"</span><span style="color: #3fdfd0;">)</span>
    <span style="color: var(--clr-string); background-color: var(--bg-string);">"l s"</span> '<span style="color: #3fdfd0;">(</span>org-store-link <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:wk</span> <span style="color: var(--clr-string); background-color: var(--bg-string);">"store link"</span><span style="color: #3fdfd0;">)</span>
    <span style="color: var(--clr-string); background-color: var(--bg-string);">"n"</span> '<span style="color: #3fdfd0;">(</span>org-toggle-narrow-to-subtree <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:wk</span> <span style="color: var(--clr-string); background-color: var(--bg-string);">"narrow subtree"</span><span style="color: #3fdfd0;">)</span>
    <span style="color: var(--clr-string); background-color: var(--bg-string);">"t"</span> '<span style="color: #3fdfd0;">(</span>org-todo <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:wk</span> <span style="color: var(--clr-string); background-color: var(--bg-string);">"heading todo"</span><span style="color: #3fdfd0;">)</span><span style="color: #ff62d4;">)</span>
  <span style="color: #ff62d4;">(</span>org-mode-map
   <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:states</span> '<span style="color: #3fdfd0;">(</span>normal<span style="color: #3fdfd0;">)</span>
   <span style="color: var(--clr-string); background-color: var(--bg-string);">"z i"</span> '<span style="color: #3fdfd0;">(</span>org-toggle-inline-images <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:wk</span> <span style="color: var(--clr-string); background-color: var(--bg-string);">"inline images"</span><span style="color: #3fdfd0;">)</span><span style="color: #ff62d4;">)</span>
  <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:init</span>
  <span style="color: var(--clr-comment-delimiter); background-color: var(--bg-comment-delimiter);">;; </span><span style="color: var(--clr-comment); background-color: var(--bg-comment);">general settings</span>
  <span style="color: #ff62d4;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">setq</span> org-directory <span style="color: var(--clr-string); background-color: var(--bg-string);">"~/Dropbox/org"</span>
        org-image-actual-width nil
        +org-export-directory <span style="color: var(--clr-string); background-color: var(--bg-string);">"~/Dropbox/org/export"</span>
        org-default-notes-file <span style="color: var(--clr-string); background-color: var(--bg-string);">"~/Dropbox/org/personal/tasks/todo.org"</span>
        org-id-locations-file <span style="color: var(--clr-string); background-color: var(--bg-string);">"~/Dropbox/org/.orgids"</span>
        org-agenda-files '<span style="color: #3fdfd0;">(</span><span style="color: var(--clr-string); background-color: var(--bg-string);">"~/dropbox/org/personal/tasks/birthdays.org"</span> <span style="color: var(--clr-string); background-color: var(--bg-string);">"~/dropbox/org/personal/tasks/todo.org"</span> <span style="color: var(--clr-string); background-color: var(--bg-string);">"~/dropbox/Notes/Test.inbox.org"</span><span style="color: #3fdfd0;">)</span>
        <span style="color: var(--clr-comment-delimiter); background-color: var(--bg-comment-delimiter);">;; </span><span style="color: var(--clr-comment); background-color: var(--bg-comment);">org-export-in-background t</span>
        org-catch-invisible-edits 'smart<span style="color: #ff62d4;">)</span>
  <span style="color: var(--clr-comment-delimiter); background-color: var(--bg-comment-delimiter);">;; </span><span style="color: var(--clr-comment); background-color: var(--bg-comment);">disable modules for faster startup</span>
  <span style="color: #ff62d4;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">setq</span> org-modules
        '<span style="color: #3fdfd0;">(</span><span style="color: var(--clr-comment-delimiter); background-color: var(--bg-comment-delimiter);">;; </span><span style="color: var(--clr-comment); background-color: var(--bg-comment);">ol-w3m</span>
          <span style="color: var(--clr-comment-delimiter); background-color: var(--bg-comment-delimiter);">;; </span><span style="color: var(--clr-comment); background-color: var(--bg-comment);">ol-bbdb</span>
          <span style="color: var(--clr-comment-delimiter); background-color: var(--bg-comment-delimiter);">;; </span><span style="color: var(--clr-comment); background-color: var(--bg-comment);">ol-bibtex</span>
          ol-docview
          <span style="color: var(--clr-comment-delimiter); background-color: var(--bg-comment-delimiter);">;; </span><span style="color: var(--clr-comment); background-color: var(--bg-comment);">ol-gnus</span>
          <span style="color: var(--clr-comment-delimiter); background-color: var(--bg-comment-delimiter);">;; </span><span style="color: var(--clr-comment); background-color: var(--bg-comment);">ol-info</span>
          <span style="color: var(--clr-comment-delimiter); background-color: var(--bg-comment-delimiter);">;; </span><span style="color: var(--clr-comment); background-color: var(--bg-comment);">ol-irc</span>
          <span style="color: var(--clr-comment-delimiter); background-color: var(--bg-comment-delimiter);">;; </span><span style="color: var(--clr-comment); background-color: var(--bg-comment);">ol-mhe</span>
          <span style="color: var(--clr-comment-delimiter); background-color: var(--bg-comment-delimiter);">;; </span><span style="color: var(--clr-comment); background-color: var(--bg-comment);">ol-rmail</span>
          <span style="color: var(--clr-comment-delimiter); background-color: var(--bg-comment-delimiter);">;; </span><span style="color: var(--clr-comment); background-color: var(--bg-comment);">ol-eww</span>
          <span style="color: #3fdfd0;">)</span><span style="color: #ff62d4;">)</span>
  <span style="color: #ff62d4;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">setq</span> org-todo-keywords
        '<span style="color: #3fdfd0;">(</span><span style="color: #fba849;">(</span>sequence <span style="color: var(--clr-string); background-color: var(--bg-string);">"</span><span style="color: #feacd0;">TODO</span><span style="color: var(--clr-string); background-color: var(--bg-string);">(t)"</span> <span style="color: var(--clr-string); background-color: var(--bg-string);">"PROJ(p)"</span> <span style="color: var(--clr-string); background-color: var(--bg-string);">"|"</span> <span style="color: var(--clr-string); background-color: var(--bg-string);">"</span><span style="color: #44bc44;">DONE</span><span style="color: var(--clr-string); background-color: var(--bg-string);">(d)"</span><span style="color: #fba849;">)</span><span style="color: #3fdfd0;">)</span><span style="color: #ff62d4;">)</span>
  <span style="color: #ff62d4;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">setq</span> org-capture-templates
        `<span style="color: #3fdfd0;">(</span><span style="color: #fba849;">(</span><span style="color: var(--clr-string); background-color: var(--bg-string);">"b"</span> <span style="color: var(--clr-string); background-color: var(--bg-string);">"Blog"</span> entry
           <span style="color: #9f80ff;">(</span>file+headline <span style="color: var(--clr-string); background-color: var(--bg-string);">"personal/tasks/todo.org"</span> <span style="color: var(--clr-string); background-color: var(--bg-string);">"Blog"</span><span style="color: #9f80ff;">)</span>
           ,<span style="color: #9f80ff;">(</span>concat <span style="color: var(--clr-string); background-color: var(--bg-string);">"* WRITE %^{Title} %^g\n"</span>
                    <span style="color: var(--clr-string); background-color: var(--bg-string);">"SCHEDULED: %^t\n"</span>
                    <span style="color: var(--clr-string); background-color: var(--bg-string);">":PROPERTIES:\n"</span>
                    <span style="color: var(--clr-string); background-color: var(--bg-string);">":CAPTURED: %U\n:END:\n\n"</span>
                    <span style="color: var(--clr-string); background-color: var(--bg-string);">"%i%?"</span><span style="color: #9f80ff;">)</span><span style="color: #fba849;">)</span>
          <span style="color: #fba849;">(</span><span style="color: var(--clr-string); background-color: var(--bg-string);">"d"</span> <span style="color: var(--clr-string); background-color: var(--bg-string);">"New Diary Entry"</span> entry<span style="color: #9f80ff;">(</span>file+olp+datetree<span style="color: var(--clr-string); background-color: var(--bg-string);">"~/Dropbox/org/personal/diary.org"</span> <span style="color: var(--clr-string); background-color: var(--bg-string);">"Daily Logs"</span><span style="color: #9f80ff;">)</span>
           <span style="color: var(--clr-string); background-color: var(--bg-string);">"* %^{thought for the day}</span>
<span style="color: var(--clr-string); background-color: var(--bg-string);">             :PROPERTIES:</span>
<span style="color: var(--clr-string); background-color: var(--bg-string);">             :CATEGORY: %^{category}</span>
<span style="color: var(--clr-string); background-color: var(--bg-string);">             :SUBJECT:  %^{subject}</span>
<span style="color: var(--clr-string); background-color: var(--bg-string);">             :MOOD:     %^{mood}</span>
<span style="color: var(--clr-string); background-color: var(--bg-string);">             :END:</span>
<span style="color: var(--clr-string); background-color: var(--bg-string);">             :RESOURCES:</span>
<span style="color: var(--clr-string); background-color: var(--bg-string);">             :END:</span>

<span style="color: var(--clr-string); background-color: var(--bg-string);">             </span><span style="color: #dbbe5f; background-color: var(--bg-string); font-weight: bold;">\</span><span style="color: var(--clr-string); background-color: var(--bg-string);">*What was one good thing you learned today?*:</span>
<span style="color: var(--clr-string); background-color: var(--bg-string);">             - %^{whatilearnedtoday}</span>

<span style="color: var(--clr-string); background-color: var(--bg-string);">             </span><span style="color: #dbbe5f; background-color: var(--bg-string); font-weight: bold;">\</span><span style="color: var(--clr-string); background-color: var(--bg-string);">*List one thing you could have done better*:</span>
<span style="color: var(--clr-string); background-color: var(--bg-string);">             - %^{onethingdobetter}</span>

<span style="color: var(--clr-string); background-color: var(--bg-string);">             </span><span style="color: #dbbe5f; background-color: var(--bg-string); font-weight: bold;">\</span><span style="color: var(--clr-string); background-color: var(--bg-string);">*Describe in your own words how your day was*:</span>
<span style="color: var(--clr-string); background-color: var(--bg-string);">             - %?"</span><span style="color: #fba849;">)</span>
          <span style="color: #fba849;">(</span><span style="color: var(--clr-string); background-color: var(--bg-string);">"i"</span> <span style="color: var(--clr-string); background-color: var(--bg-string);">"Inbox"</span> entry
           <span style="color: #9f80ff;">(</span>file+headline <span style="color: var(--clr-string); background-color: var(--bg-string);">"personal/tasks/todo.org"</span> <span style="color: var(--clr-string); background-color: var(--bg-string);">"Inbox"</span><span style="color: #9f80ff;">)</span>
           ,<span style="color: #9f80ff;">(</span>concat <span style="color: var(--clr-string); background-color: var(--bg-string);">"* %^{Title}\n"</span>
                    <span style="color: var(--clr-string); background-color: var(--bg-string);">":PROPERTIES:\n"</span>
                    <span style="color: var(--clr-string); background-color: var(--bg-string);">":CAPTURED: %U\n"</span>
                    <span style="color: var(--clr-string); background-color: var(--bg-string);">":END:\n\n"</span>
                    <span style="color: var(--clr-string); background-color: var(--bg-string);">"%i%l"</span><span style="color: #9f80ff;">)</span><span style="color: #fba849;">)</span>
          <span style="color: #fba849;">(</span><span style="color: var(--clr-string); background-color: var(--bg-string);">"u"</span> <span style="color: var(--clr-string); background-color: var(--bg-string);">"New URL Entry"</span> entry
           <span style="color: #9f80ff;">(</span>file+function <span style="color: var(--clr-string); background-color: var(--bg-string);">"~/Dropbox/org/personal/dailies.org"</span> org-reverse-datetree-goto-date-in-file<span style="color: #9f80ff;">)</span>
           <span style="color: var(--clr-string); background-color: var(--bg-string);">"* [[%^{URL}][%^{Description}]] %^g %?"</span><span style="color: #fba849;">)</span>
          <span style="color: #fba849;">(</span><span style="color: var(--clr-string); background-color: var(--bg-string);">"w"</span> <span style="color: var(--clr-string); background-color: var(--bg-string);">"Work"</span> entry
           <span style="color: #9f80ff;">(</span>file+headline <span style="color: var(--clr-string); background-color: var(--bg-string);">"personal/tasks/todo.org"</span> <span style="color: var(--clr-string); background-color: var(--bg-string);">"Work"</span><span style="color: #9f80ff;">)</span>
           ,<span style="color: #9f80ff;">(</span>concat <span style="color: var(--clr-string); background-color: var(--bg-string);">"* </span><span style="color: #feacd0;">TODO</span><span style="color: var(--clr-string); background-color: var(--bg-string);"> [#A] %^{Title} :@work:\n"</span>
                    <span style="color: var(--clr-string); background-color: var(--bg-string);">"SCHEDULED: %^t\n"</span>
                    <span style="color: var(--clr-string); background-color: var(--bg-string);">":PROPERTIES:\n:CAPTURED: %U\n:END:\n\n"</span>
                    <span style="color: var(--clr-string); background-color: var(--bg-string);">"%i%?"</span><span style="color: #9f80ff;">)</span><span style="color: #fba849;">)</span>

          <span style="color: #3fdfd0;">)</span><span style="color: #ff62d4;">)</span>
  <span style="color: #ff62d4;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">setq-default</span> prettify-symbols-alist '<span style="color: #3fdfd0;">(</span><span style="color: #fba849;">(</span><span style="color: var(--clr-string); background-color: var(--bg-string);">"#+BEGIN_SRC"</span> . <span style="color: var(--clr-string); background-color: var(--bg-string);">"&#187;"</span><span style="color: #fba849;">)</span>
                                         <span style="color: #fba849;">(</span><span style="color: var(--clr-string); background-color: var(--bg-string);">"#+END_SRC"</span> . <span style="color: var(--clr-string); background-color: var(--bg-string);">"&#171;"</span><span style="color: #fba849;">)</span>
                                         <span style="color: #fba849;">(</span><span style="color: var(--clr-string); background-color: var(--bg-string);">"#+begin_src"</span> . <span style="color: var(--clr-string); background-color: var(--bg-string);">"&#187;"</span><span style="color: #fba849;">)</span>
                                         <span style="color: #fba849;">(</span><span style="color: var(--clr-string); background-color: var(--bg-string);">"#+end_src"</span> . <span style="color: var(--clr-string); background-color: var(--bg-string);">"&#171;"</span><span style="color: #fba849;">)</span><span style="color: #3fdfd0;">)</span><span style="color: #ff62d4;">)</span>
  <span style="color: #ff62d4;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">setq</span> prettify-symbols-unprettify-at-point 'right-edge<span style="color: #ff62d4;">)</span>
  <span style="color: var(--clr-comment-delimiter); background-color: var(--bg-comment-delimiter);">;; </span><span style="color: var(--clr-comment); background-color: var(--bg-comment);">(setq org-agenda-custom-commands</span>
  <span style="color: var(--clr-comment-delimiter); background-color: var(--bg-comment-delimiter);">;;         </span><span style="color: var(--clr-comment); background-color: var(--bg-comment);">'(("d" "Dashboard"</span>
  <span style="color: var(--clr-comment-delimiter); background-color: var(--bg-comment-delimiter);">;;            </span><span style="color: var(--clr-comment); background-color: var(--bg-comment);">((agenda "" ((org-deadline-warning-days 7)))</span>
  <span style="color: var(--clr-comment-delimiter); background-color: var(--bg-comment-delimiter);">;;             </span><span style="color: var(--clr-comment); background-color: var(--bg-comment);">(todo "</span><span style="color: #b6a0ff;">NEXT</span><span style="color: var(--clr-comment); background-color: var(--bg-comment);">"</span>
  <span style="color: var(--clr-comment-delimiter); background-color: var(--bg-comment-delimiter);">;;                   </span><span style="color: var(--clr-comment); background-color: var(--bg-comment);">((org-agenda-overriding-header "Next Tasks")))</span>
  <span style="color: var(--clr-comment-delimiter); background-color: var(--bg-comment-delimiter);">;;             </span><span style="color: var(--clr-comment); background-color: var(--bg-comment);">(tags-todo "agenda/ACTIVE" ((org-agenda-overriding-header "Active Projects")))))</span>
  <span style="color: var(--clr-comment-delimiter); background-color: var(--bg-comment-delimiter);">;;           </span><span style="color: var(--clr-comment); background-color: var(--bg-comment);">("n" "Next Tasks"</span>
  <span style="color: var(--clr-comment-delimiter); background-color: var(--bg-comment-delimiter);">;;            </span><span style="color: var(--clr-comment); background-color: var(--bg-comment);">((todo "</span><span style="color: #b6a0ff;">NEXT</span><span style="color: var(--clr-comment); background-color: var(--bg-comment);">"</span>
  <span style="color: var(--clr-comment-delimiter); background-color: var(--bg-comment-delimiter);">;;                   </span><span style="color: var(--clr-comment); background-color: var(--bg-comment);">((org-agenda-overriding-header "Next Tasks")))))</span>
  <span style="color: var(--clr-comment-delimiter); background-color: var(--bg-comment-delimiter);">;;           </span><span style="color: var(--clr-comment); background-color: var(--bg-comment);">("W" "Work Tasks" tags-todo "+work-email")</span>
  <span style="color: var(--clr-comment-delimiter); background-color: var(--bg-comment-delimiter);">;;           </span><span style="color: var(--clr-comment); background-color: var(--bg-comment);">))</span>
  <span style="color: #ff62d4;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">defun</span> <span style="color: var(--function-clr-name); background-color: var(--function-bg-name);">my/org-mode-setup</span> <span style="color: #3fdfd0;">()</span>
    <span style="color: #3fdfd0;">(</span>org-indent-mode<span style="color: #3fdfd0;">)</span>
    <span style="color: #3fdfd0;">(</span>variable-pitch-mode 1<span style="color: #3fdfd0;">)</span>
    <span style="color: #3fdfd0;">(</span>visual-line-mode 1<span style="color: #3fdfd0;">)</span><span style="color: #ff62d4;">)</span>
  <span style="color: #ff62d4;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">defun</span> <span style="color: var(--function-clr-name); background-color: var(--function-bg-name);">my/org-babel-tangle-config</span> <span style="color: #3fdfd0;">()</span>
    <span style="color: #3fdfd0;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">when</span> <span style="color: #fba849;">(</span>string-equal <span style="color: #9f80ff;">(</span>file-name-directory <span style="color: #4fe42f;">(</span>buffer-file-name<span style="color: #4fe42f;">)</span><span style="color: #9f80ff;">)</span>
                        <span style="color: var(--clr-comment-delimiter); background-color: var(--bg-comment-delimiter);">;; </span><span style="color: var(--clr-comment); background-color: var(--bg-comment);">file-truename resolves symlinks</span>
                        <span style="color: #9f80ff;">(</span>file-truename <span style="color: #4fe42f;">(</span>expand-file-name user-emacs-directory<span style="color: #4fe42f;">)</span><span style="color: #9f80ff;">)</span><span style="color: #fba849;">)</span>
      <span style="color: var(--clr-comment-delimiter); background-color: var(--bg-comment-delimiter);">;; </span><span style="color: var(--clr-comment); background-color: var(--bg-comment);">Dynamic scoping to the rescue</span>
      <span style="color: #fba849;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">let</span> <span style="color: #9f80ff;">(</span><span style="color: #4fe42f;">(</span>org-confirm-babel-evaluate nil<span style="color: #4fe42f;">)</span><span style="color: #9f80ff;">)</span>
        <span style="color: #9f80ff;">(</span>org-babel-tangle<span style="color: #9f80ff;">)</span><span style="color: #fba849;">)</span><span style="color: #3fdfd0;">)</span><span style="color: #ff62d4;">)</span>
  <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:config</span>
  <span style="color: var(--clr-comment-delimiter); background-color: var(--bg-comment-delimiter);">;; </span><span style="color: var(--clr-comment); background-color: var(--bg-comment);">visual</span>
  <span style="color: #ff62d4;">(</span>org-indent-mode<span style="color: #ff62d4;">)</span>
  <span style="color: #ff62d4;">(</span>variable-pitch-mode 1<span style="color: #ff62d4;">)</span>
  <span style="color: #ff62d4;">(</span>visual-line-mode 1<span style="color: #ff62d4;">)</span>
  <span style="color: var(--clr-comment-delimiter); background-color: var(--bg-comment-delimiter);">;; </span><span style="color: var(--clr-comment); background-color: var(--bg-comment);">org habit</span>
  <span style="color: #ff62d4;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">require</span> '<span style="color: var(--clr-constant); background-color: var(--bg-constant);">org-habit</span><span style="color: #ff62d4;">)</span>
  <span style="color: #ff62d4;">(</span>add-to-list 'org-modules 'org-habit<span style="color: #ff62d4;">)</span>
  <span style="color: var(--clr-comment-delimiter); background-color: var(--bg-comment-delimiter);">;; </span><span style="color: var(--clr-comment); background-color: var(--bg-comment);">(efs/org-font-setup)</span>
  <span style="color: #ff62d4;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">require</span> '<span style="color: var(--clr-constant); background-color: var(--bg-constant);">org-tempo</span><span style="color: #ff62d4;">)</span>
  <span style="color: #ff62d4;">(</span>add-to-list 'org-structure-template-alist '<span style="color: #3fdfd0;">(</span><span style="color: var(--clr-string); background-color: var(--bg-string);">"sh"</span> . <span style="color: var(--clr-string); background-color: var(--bg-string);">"src shell"</span><span style="color: #3fdfd0;">)</span><span style="color: #ff62d4;">)</span>
  <span style="color: #ff62d4;">(</span>add-to-list 'org-structure-template-alist '<span style="color: #3fdfd0;">(</span><span style="color: var(--clr-string); background-color: var(--bg-string);">"el"</span> . <span style="color: var(--clr-string); background-color: var(--bg-string);">"src emacs-lisp"</span><span style="color: #3fdfd0;">)</span><span style="color: #ff62d4;">)</span>
  <span style="color: #ff62d4;">(</span>add-to-list 'org-structure-template-alist '<span style="color: #3fdfd0;">(</span><span style="color: var(--clr-string); background-color: var(--bg-string);">"py"</span> . <span style="color: var(--clr-string); background-color: var(--bg-string);">"src python"</span><span style="color: #3fdfd0;">)</span><span style="color: #ff62d4;">)</span>
  <span style="color: #ff62d4;">(</span>add-to-list 'org-structure-template-alist '<span style="color: #3fdfd0;">(</span><span style="color: var(--clr-string); background-color: var(--bg-string);">"clj"</span> . <span style="color: var(--clr-string); background-color: var(--bg-string);">"src clojure"</span><span style="color: #3fdfd0;">)</span><span style="color: #ff62d4;">)</span>
  <span style="color: #ff62d4;">(</span>add-to-list 'org-structure-template-alist '<span style="color: #3fdfd0;">(</span><span style="color: var(--clr-string); background-color: var(--bg-string);">"jp"</span> . <span style="color: var(--clr-string); background-color: var(--bg-string);">"src jupyter-python"</span><span style="color: #3fdfd0;">)</span><span style="color: #ff62d4;">)</span>
  <span style="color: var(--clr-comment-delimiter); background-color: var(--bg-comment-delimiter);">;; </span><span style="color: var(--clr-comment); background-color: var(--bg-comment);">latex</span>
  <span style="color: #ff62d4;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">setq</span> org-latex-compiler <span style="color: var(--clr-string); background-color: var(--bg-string);">"xelatex"</span><span style="color: #ff62d4;">)</span>
  <span style="color: #ff62d4;">(</span>add-to-list 'org-export-backends 'beamer<span style="color: #ff62d4;">)</span>
  <span style="color: #ffffff;">)</span>
</pre>
</div>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #ffffff;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">use-package</span> <span style="color: var(--clr-constant); background-color: var(--bg-constant);">org-reverse-datetree</span>
<span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:after</span> org<span style="color: #ffffff;">)</span>
</pre>
</div>
</div>
</div>
