readme.org
** better bullets
#+BEGIN_SRC emacs-lisp
    (use-package org-superstar
      :hook (org-mode . org-superstar-mode)
      :init
      (setq org-superstar-headline-bullets-list '("✖" "✚" "◆" "▶" "○")
            org-superstar-special-todo-items t
            ;; org-ellipsis "⤵"
            ;; org-ellipsis "▼"
            ;; org-ellipsis "..."
            org-ellipsis " ↴ "
            )
      )
#+END_SRC

** todo highlight
#+begin_src emacs-lisp
  (use-package hl-todo
    :hook (prog-mode . hl-todo-mode)
    :init
    (setq hl-todo-keyword-faces
          '(("TODO"   . "#FF4500")
            ("FIXME"  . "#FF0000")
            ("STRT"  . "#A020F0")
            ("PROJ"   . "#1E90FF")))
    )
#+end_src

** org babel
#+BEGIN_SRC emacs-lisp
  (use-package org
    :general
    (my/local-leader-keys
      :keymaps 'org-mode-map
      "," '(org-edit-special :wk "edit")
      "-" '(org-babel-demarcate-block :wk "split block"))
    (my/local-leader-keys
      :keymaps 'org-src-mode-map
      "," '(org-edit-src-exit :wk "exit")) ;;FIXME
    :init
    (setq org-confirm-babel-evaluate nil)
    :config
    (org-babel-do-load-languages
     'org-babel-load-languages
     '((emacs-lisp . t)
       (shell . t))))

  ;; enable mermaid diagram blocks
  ;; (use-package ob-mermaid
  ;;   :custom (ob-mermaid-cli-path "~/.asdf/shims/mmdc"))
#+END_SRC

** ob-async
#+begin_src emacs-lisp
  (use-package ob-async
    :hook (org-load . (lambda () (require 'ob-async)))
    :init
    (setq ob-async-no-async-languages-alist '("jupyter-python" "jupyter-R" "jupyter-julia")))
#+end_src

