readme.html

<div id="outline-container-org1c162ef" class="outline-3">
<h3 id="org1c162ef"><span class="section-number-3">9.2</span> better bullets</h3>
<div class="outline-text-3" id="text-9-2">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #ffffff;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">use-package</span> <span style="color: var(--clr-constant); background-color: var(--bg-constant);">org-superstar</span>
  <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:hook</span> <span style="color: #ff62d4;">(</span>org-mode . org-superstar-mode<span style="color: #ff62d4;">)</span>
  <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:init</span>
  <span style="color: #ff62d4;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">setq</span> org-superstar-headline-bullets-list '<span style="color: #3fdfd0;">(</span><span style="color: var(--clr-string); background-color: var(--bg-string);">"&#10006;"</span> <span style="color: var(--clr-string); background-color: var(--bg-string);">"&#10010;"</span> <span style="color: var(--clr-string); background-color: var(--bg-string);">"&#9670;"</span> <span style="color: var(--clr-string); background-color: var(--bg-string);">"&#9654;"</span> <span style="color: var(--clr-string); background-color: var(--bg-string);">"&#9675;"</span><span style="color: #3fdfd0;">)</span>
        org-superstar-special-todo-items t
        <span style="color: var(--clr-comment-delimiter); background-color: var(--bg-comment-delimiter);">;; </span><span style="color: var(--clr-comment); background-color: var(--bg-comment);">org-ellipsis "&#10549;"</span>
        <span style="color: var(--clr-comment-delimiter); background-color: var(--bg-comment-delimiter);">;; </span><span style="color: var(--clr-comment); background-color: var(--bg-comment);">org-ellipsis "&#9660;"</span>
        <span style="color: var(--clr-comment-delimiter); background-color: var(--bg-comment-delimiter);">;; </span><span style="color: var(--clr-comment); background-color: var(--bg-comment);">org-ellipsis "..."</span>
        org-ellipsis <span style="color: var(--clr-string); background-color: var(--bg-string);">" &#8628; "</span>
        <span style="color: #ff62d4;">)</span>
  <span style="color: #ffffff;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgfbe72c5" class="outline-3">
<h3 id="orgfbe72c5"><span class="section-number-3">9.3</span> todo highlight</h3>
<div class="outline-text-3" id="text-9-3">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #ffffff;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">use-package</span> <span style="color: var(--clr-constant); background-color: var(--bg-constant);">hl-todo</span>
  <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:hook</span> <span style="color: #ff62d4;">(</span>prog-mode . hl-todo-mode<span style="color: #ff62d4;">)</span>
  <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:init</span>
  <span style="color: #ff62d4;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">setq</span> hl-todo-keyword-faces
        '<span style="color: #3fdfd0;">(</span><span style="color: #fba849;">(</span><span style="color: var(--clr-string); background-color: var(--bg-string);">"</span><span style="color: #feacd0;">TODO</span><span style="color: var(--clr-string); background-color: var(--bg-string);">"</span>   . <span style="color: var(--clr-string); background-color: var(--bg-string);">"#FF4500"</span><span style="color: #fba849;">)</span>
          <span style="color: #fba849;">(</span><span style="color: var(--clr-string); background-color: var(--bg-string);">"</span><span style="color: #ff9977;">FIXME</span><span style="color: var(--clr-string); background-color: var(--bg-string);">"</span>  . <span style="color: var(--clr-string); background-color: var(--bg-string);">"#FF0000"</span><span style="color: #fba849;">)</span>
          <span style="color: #fba849;">(</span><span style="color: var(--clr-string); background-color: var(--bg-string);">"STRT"</span>  . <span style="color: var(--clr-string); background-color: var(--bg-string);">"#A020F0"</span><span style="color: #fba849;">)</span>
          <span style="color: #fba849;">(</span><span style="color: var(--clr-string); background-color: var(--bg-string);">"PROJ"</span>   . <span style="color: var(--clr-string); background-color: var(--bg-string);">"#1E90FF"</span><span style="color: #fba849;">)</span><span style="color: #3fdfd0;">)</span><span style="color: #ff62d4;">)</span>
  <span style="color: #ffffff;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org50e3f4c" class="outline-3">
<h3 id="org50e3f4c"><span class="section-number-3">9.4</span> org babel</h3>
<div class="outline-text-3" id="text-9-4">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #ffffff;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">use-package</span> <span style="color: var(--clr-constant); background-color: var(--bg-constant);">org</span>
  <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:general</span>
  <span style="color: #ff62d4;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">my/local-leader-keys</span>
    <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:keymaps</span> 'org-mode-map
    <span style="color: var(--clr-string); background-color: var(--bg-string);">","</span> '<span style="color: #3fdfd0;">(</span>org-edit-special <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:wk</span> <span style="color: var(--clr-string); background-color: var(--bg-string);">"edit"</span><span style="color: #3fdfd0;">)</span>
    <span style="color: var(--clr-string); background-color: var(--bg-string);">"-"</span> '<span style="color: #3fdfd0;">(</span>org-babel-demarcate-block <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:wk</span> <span style="color: var(--clr-string); background-color: var(--bg-string);">"split block"</span><span style="color: #3fdfd0;">)</span><span style="color: #ff62d4;">)</span>
  <span style="color: #ff62d4;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">my/local-leader-keys</span>
    <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:keymaps</span> 'org-src-mode-map
    <span style="color: var(--clr-string); background-color: var(--bg-string);">","</span> '<span style="color: #3fdfd0;">(</span>org-edit-src-exit <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:wk</span> <span style="color: var(--clr-string); background-color: var(--bg-string);">"exit"</span><span style="color: #3fdfd0;">)</span><span style="color: #ff62d4;">)</span> <span style="color: var(--clr-comment-delimiter); background-color: var(--bg-comment-delimiter);">;;</span><span style="color: #ff9977;">FIXME</span>
  <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:init</span>
  <span style="color: #ff62d4;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">setq</span> org-confirm-babel-evaluate nil<span style="color: #ff62d4;">)</span>
  <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:config</span>
  <span style="color: #ff62d4;">(</span>org-babel-do-load-languages
   'org-babel-load-languages
   '<span style="color: #3fdfd0;">(</span><span style="color: #fba849;">(</span>emacs-lisp . t<span style="color: #fba849;">)</span>
     <span style="color: #fba849;">(</span>shell . t<span style="color: #fba849;">)</span><span style="color: #3fdfd0;">)</span><span style="color: #ff62d4;">)</span><span style="color: #ffffff;">)</span>

<span style="color: var(--clr-comment-delimiter); background-color: var(--bg-comment-delimiter);">;; </span><span style="color: var(--clr-comment); background-color: var(--bg-comment);">enable mermaid diagram blocks</span>
<span style="color: var(--clr-comment-delimiter); background-color: var(--bg-comment-delimiter);">;; </span><span style="color: var(--clr-comment); background-color: var(--bg-comment);">(use-package ob-mermaid</span>
<span style="color: var(--clr-comment-delimiter); background-color: var(--bg-comment-delimiter);">;;   </span><span style="color: var(--clr-comment); background-color: var(--bg-comment);">:custom (ob-mermaid-cli-path "~/.asdf/shims/mmdc"))</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org1188c06" class="outline-3">
<h3 id="org1188c06"><span class="section-number-3">9.5</span> ob-async</h3>
<div class="outline-text-3" id="text-9-5">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #ffffff;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">use-package</span> <span style="color: var(--clr-constant); background-color: var(--bg-constant);">ob-async</span>
  <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:hook</span> <span style="color: #ff62d4;">(</span>org-load . <span style="color: #3fdfd0;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">lambda</span> <span style="color: #fba849;">()</span> <span style="color: #fba849;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">require</span> '<span style="color: var(--clr-constant); background-color: var(--bg-constant);">ob-async</span><span style="color: #fba849;">)</span><span style="color: #3fdfd0;">)</span><span style="color: #ff62d4;">)</span>
  <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:init</span>
  <span style="color: #ff62d4;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">setq</span> ob-async-no-async-languages-alist '<span style="color: #3fdfd0;">(</span><span style="color: var(--clr-string); background-color: var(--bg-string);">"jupyter-python"</span> <span style="color: var(--clr-string); background-color: var(--bg-string);">"jupyter-R"</span> <span style="color: var(--clr-string); background-color: var(--bg-string);">"jupyter-julia"</span><span style="color: #3fdfd0;">)</span><span style="color: #ff62d4;">)</span><span style="color: #ffffff;">)</span>
</pre>
</div>
</div>
</div>
