readme.org
** ob-jupyter
Note:
- We can only load ~ob-jupyter~ when we have ~jupyter~ on our ~PATH~.
  + We assume ~jupyter~ is always installed in a virtual env associated with an ~.envrc~ file
  + We load jupyter when we activate ~envrc-mode~ if ~jupyter~ is available

#+begin_src emacs-lisp
  (use-package jupyter
    :straight (:no-native-compile t :no-byte-compile t) ;; otherwise we get jupyter-channel void
    :hook ((envrc-mode . my/load-ob-jupyter)
           (jupyter-repl-persistent-mode . (lambda ()  ;; we activate org-interaction-mode ourselves
                                             (when (derived-mode-p 'org-mode)
                                               (jupyter-org-interaction-mode)))))
    :init
    (setq org-babel-default-header-args:jupyter-python '((:async . "yes")
                                                         (:pandoc t)
                                                         (:kernel . "python3")))
    (setq org-babel-default-header-args:jupyter-R '((:pandoc t)
                                                    (:async . "yes")
                                                    (:kernel . "ir")))
    (defun my/load-ob-jupyter ()
      ;; only try to load in org-mode
      (when (derived-mode-p 'org-mode)
        ;; skip if already loaded
        (unless (member '(jupyter . t) org-babel-load-languages)
          ;; only load if jupyter is available
          (when (executable-find "jupyter")
            (org-babel-do-load-languages 'org-babel-load-languages
                                         (append org-babel-load-languages
                                                 '((jupyter . t))))))))
    (cl-defmethod jupyter-org--insert-result (_req context result)
      (let ((str
             (org-element-interpret-data
              (jupyter-org--wrap-result-maybe
               context (if (jupyter-org--stream-result-p result)
                           (thread-last result
                             jupyter-org-strip-last-newline
                             jupyter-org-scalar)
                         result)))))
        (if (< (length str) 100000)
            (insert str)
          (insert (format ": Result was too long! Length was %d" (length str)))))
      (when (/= (point) (line-beginning-position))
        ;; Org objects such as file links do not have a newline added when
        ;; converting to their string representation by
        ;; `org-element-interpret-data' so insert one in these cases.
        (insert "\n")))
  :config
  ;;Remove text/html since it's not human readable
  ;; (delete :text/html jupyter-org-mime-types)
  ;; (require 'tramp)
  (with-eval-after-load 'org-src
    (add-to-list 'org-src-lang-modes '("jupyter-python" . python))
    (add-to-list 'org-src-lang-modes '("jupyter-R" . R))))
#+end_src

