readme.html

<div id="outline-container-org0888139" class="outline-3">
<h3 id="org0888139"><span class="section-number-3">9.6</span> ob-jupyter</h3>
<div class="outline-text-3" id="text-9-6">
<p>
Note:
</p>
<ul class="org-ul">
<li>We can only load <code>ob-jupyter</code> when we have <code>jupyter</code> on our <code>PATH</code>.
<ul class="org-ul">
<li>We assume <code>jupyter</code> is always installed in a virtual env associated with an <code>.envrc</code> file</li>
<li>We load jupyter when we activate <code>envrc-mode</code> if <code>jupyter</code> is available</li>
</ul></li>
</ul>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #ffffff;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">use-package</span> <span style="color: var(--clr-constant); background-color: var(--bg-constant);">jupyter</span>
  <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:straight</span> <span style="color: #ff62d4;">(</span><span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:no-native-compile</span> t <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:no-byte-compile</span> t<span style="color: #ff62d4;">)</span> <span style="color: var(--clr-comment-delimiter); background-color: var(--bg-comment-delimiter);">;; </span><span style="color: var(--clr-comment); background-color: var(--bg-comment);">otherwise we get jupyter-channel void</span>
  <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:hook</span> <span style="color: #ff62d4;">(</span><span style="color: #3fdfd0;">(</span>envrc-mode . my/load-ob-jupyter<span style="color: #3fdfd0;">)</span>
         <span style="color: #3fdfd0;">(</span>jupyter-repl-persistent-mode . <span style="color: #fba849;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">lambda</span> <span style="color: #9f80ff;">()</span>  <span style="color: var(--clr-comment-delimiter); background-color: var(--bg-comment-delimiter);">;; </span><span style="color: var(--clr-comment); background-color: var(--bg-comment);">we activate org-interaction-mode ourselves</span>
                                           <span style="color: #9f80ff;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">when</span> <span style="color: #4fe42f;">(</span>derived-mode-p 'org-mode<span style="color: #4fe42f;">)</span>
                                             <span style="color: #4fe42f;">(</span>jupyter-org-interaction-mode<span style="color: #4fe42f;">)</span><span style="color: #9f80ff;">)</span><span style="color: #fba849;">)</span><span style="color: #3fdfd0;">)</span><span style="color: #ff62d4;">)</span>
  <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:init</span>
  <span style="color: #ff62d4;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">setq</span> org-babel-default-header-args:jupyter-python '<span style="color: #3fdfd0;">(</span><span style="color: #fba849;">(</span><span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:async</span> . <span style="color: var(--clr-string); background-color: var(--bg-string);">"yes"</span><span style="color: #fba849;">)</span>
                                                       <span style="color: #fba849;">(</span><span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:pandoc</span> t<span style="color: #fba849;">)</span>
                                                       <span style="color: #fba849;">(</span><span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:kernel</span> . <span style="color: var(--clr-string); background-color: var(--bg-string);">"python3"</span><span style="color: #fba849;">)</span><span style="color: #3fdfd0;">)</span><span style="color: #ff62d4;">)</span>
  <span style="color: #ff62d4;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">setq</span> org-babel-default-header-args:jupyter-R '<span style="color: #3fdfd0;">(</span><span style="color: #fba849;">(</span><span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:pandoc</span> t<span style="color: #fba849;">)</span>
                                                  <span style="color: #fba849;">(</span><span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:async</span> . <span style="color: var(--clr-string); background-color: var(--bg-string);">"yes"</span><span style="color: #fba849;">)</span>
                                                  <span style="color: #fba849;">(</span><span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:kernel</span> . <span style="color: var(--clr-string); background-color: var(--bg-string);">"ir"</span><span style="color: #fba849;">)</span><span style="color: #3fdfd0;">)</span><span style="color: #ff62d4;">)</span>
  <span style="color: #ff62d4;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">defun</span> <span style="color: var(--function-clr-name); background-color: var(--function-bg-name);">my/load-ob-jupyter</span> <span style="color: #3fdfd0;">()</span>
    <span style="color: var(--clr-comment-delimiter); background-color: var(--bg-comment-delimiter);">;; </span><span style="color: var(--clr-comment); background-color: var(--bg-comment);">only try to load in org-mode</span>
    <span style="color: #3fdfd0;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">when</span> <span style="color: #fba849;">(</span>derived-mode-p 'org-mode<span style="color: #fba849;">)</span>
      <span style="color: var(--clr-comment-delimiter); background-color: var(--bg-comment-delimiter);">;; </span><span style="color: var(--clr-comment); background-color: var(--bg-comment);">skip if already loaded</span>
      <span style="color: #fba849;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">unless</span> <span style="color: #9f80ff;">(</span>member '<span style="color: #4fe42f;">(</span>jupyter . t<span style="color: #4fe42f;">)</span> org-babel-load-languages<span style="color: #9f80ff;">)</span>
        <span style="color: var(--clr-comment-delimiter); background-color: var(--bg-comment-delimiter);">;; </span><span style="color: var(--clr-comment); background-color: var(--bg-comment);">only load if jupyter is available</span>
        <span style="color: #9f80ff;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">when</span> <span style="color: #4fe42f;">(</span>executable-find <span style="color: var(--clr-string); background-color: var(--bg-string);">"jupyter"</span><span style="color: #4fe42f;">)</span>
          <span style="color: #4fe42f;">(</span>org-babel-do-load-languages 'org-babel-load-languages
                                       <span style="color: #fe6060;">(</span>append org-babel-load-languages
                                               '<span style="color: #4fafff;">(</span><span style="color: #f0dd60;">(</span>jupyter . t<span style="color: #f0dd60;">)</span><span style="color: #4fafff;">)</span><span style="color: #fe6060;">)</span><span style="color: #4fe42f;">)</span><span style="color: #9f80ff;">)</span><span style="color: #fba849;">)</span><span style="color: #3fdfd0;">)</span><span style="color: #ff62d4;">)</span>
  <span style="color: #ff62d4;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">cl-defmethod</span> <span style="color: var(--function-clr-name); background-color: var(--function-bg-name);">jupyter-org--insert-result</span> <span style="color: #3fdfd0;">(</span>_req context result<span style="color: #3fdfd0;">)</span>
    <span style="color: #3fdfd0;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">let</span> <span style="color: #fba849;">(</span><span style="color: #9f80ff;">(</span>str
           <span style="color: #4fe42f;">(</span>org-element-interpret-data
            <span style="color: #fe6060;">(</span>jupyter-org--wrap-result-maybe
             context <span style="color: #4fafff;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">if</span> <span style="color: #f0dd60;">(</span>jupyter-org--stream-result-p result<span style="color: #f0dd60;">)</span>
                         <span style="color: #f0dd60;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">thread-last</span> result
                           jupyter-org-strip-last-newline
                           jupyter-org-scalar<span style="color: #f0dd60;">)</span>
                       result<span style="color: #4fafff;">)</span><span style="color: #fe6060;">)</span><span style="color: #4fe42f;">)</span><span style="color: #9f80ff;">)</span><span style="color: #fba849;">)</span>
      <span style="color: #fba849;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">if</span> <span style="color: #9f80ff;">(</span>&lt; <span style="color: #4fe42f;">(</span>length str<span style="color: #4fe42f;">)</span> 100000<span style="color: #9f80ff;">)</span>
          <span style="color: #9f80ff;">(</span>insert str<span style="color: #9f80ff;">)</span>
        <span style="color: #9f80ff;">(</span>insert <span style="color: #4fe42f;">(</span>format <span style="color: var(--clr-string); background-color: var(--bg-string);">": Result was too long! Length was %d"</span> <span style="color: #fe6060;">(</span>length str<span style="color: #fe6060;">)</span><span style="color: #4fe42f;">)</span><span style="color: #9f80ff;">)</span><span style="color: #fba849;">)</span><span style="color: #3fdfd0;">)</span>
    <span style="color: #3fdfd0;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">when</span> <span style="color: #fba849;">(</span>/= <span style="color: #9f80ff;">(</span>point<span style="color: #9f80ff;">)</span> <span style="color: #9f80ff;">(</span>line-beginning-position<span style="color: #9f80ff;">)</span><span style="color: #fba849;">)</span>
      <span style="color: var(--clr-comment-delimiter); background-color: var(--bg-comment-delimiter);">;; </span><span style="color: var(--clr-comment); background-color: var(--bg-comment);">Org objects such as file links do not have a newline added when</span>
      <span style="color: var(--clr-comment-delimiter); background-color: var(--bg-comment-delimiter);">;; </span><span style="color: var(--clr-comment); background-color: var(--bg-comment);">converting to their string representation by</span>
      <span style="color: var(--clr-comment-delimiter); background-color: var(--bg-comment-delimiter);">;; </span><span style="color: var(--clr-comment); background-color: var(--bg-comment);">`</span><span style="color: var(--clr-constant); background-color: var(--bg-constant);">org-element-interpret-data</span><span style="color: var(--clr-comment); background-color: var(--bg-comment);">' so insert one in these cases.</span>
      <span style="color: #fba849;">(</span>insert <span style="color: var(--clr-string); background-color: var(--bg-string);">"\n"</span><span style="color: #fba849;">)</span><span style="color: #3fdfd0;">)</span><span style="color: #ff62d4;">)</span>
<span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:config</span>
<span style="color: var(--clr-comment-delimiter); background-color: var(--bg-comment-delimiter);">;;</span><span style="color: var(--clr-comment); background-color: var(--bg-comment);">Remove text/html since it's not human readable</span>
<span style="color: var(--clr-comment-delimiter); background-color: var(--bg-comment-delimiter);">;; </span><span style="color: var(--clr-comment); background-color: var(--bg-comment);">(delete :text/html jupyter-org-mime-types)</span>
<span style="color: var(--clr-comment-delimiter); background-color: var(--bg-comment-delimiter);">;; </span><span style="color: var(--clr-comment); background-color: var(--bg-comment);">(require 'tramp)</span>
<span style="color: #ff62d4;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">with-eval-after-load</span> 'org-src
  <span style="color: #3fdfd0;">(</span>add-to-list 'org-src-lang-modes '<span style="color: #fba849;">(</span><span style="color: var(--clr-string); background-color: var(--bg-string);">"jupyter-python"</span> . python<span style="color: #fba849;">)</span><span style="color: #3fdfd0;">)</span>
  <span style="color: #3fdfd0;">(</span>add-to-list 'org-src-lang-modes '<span style="color: #fba849;">(</span><span style="color: var(--clr-string); background-color: var(--bg-string);">"jupyter-R"</span> . R<span style="color: #fba849;">)</span><span style="color: #3fdfd0;">)</span><span style="color: #ff62d4;">)</span><span style="color: #ffffff;">)</span>
</pre>
</div>
</div>
</div>
