readme.org
** exporters
#+BEGIN_SRC emacs-lisp
  (use-package ox-gfm
    :after org)

  (use-package ox-ipynb
    :straight (ox-ipynb :type git :host github :repo "jkitchin/ox-ipynb")
    :after org)
#+END_SRC

** org-tree-slide
#+begin_src emacs-lisp
  (use-package org-tree-slide
    :after org
    :hook ((org-tree-slide-play . (lambda () (+remap-faces-at-start-present)))
           (org-tree-slide-stop . (lambda () (+remap-faces-at-stop-present))))
    :general
    (my/leader-keys
      "t p" '(org-tree-slide-mode :wk "present"))
    (general-nmap
      :keymaps '(org-tree-slide-mode-map org-mode-map)
      "C-j" 'org-tree-slide-move-next-tree
      "C-k" 'org-tree-slide-move-previous-tree)
    :init
    (setq org-tree-slide-activate-message "Presentation mode ON")
    (setq org-tree-slide-deactivate-message "Presentation mode OFF")
    (setq org-tree-slide-indicator nil)
    (defun +remap-faces-at-start-present ()
      ;; (setq-local face-remapping-alist '((default (:height 1.50) variable-pitch)
      ;;                                    (org-verbatim (:height 1.35) org-verbatim)
      ;;                                    (org-block (:height 1.25) org-block)))
      (hide-mode-line-mode 1)
      (diff-hl-mode 0)
      (centaur-tabs-mode 0))
    ;; TODO maybe also enable olivetti mode?
    (defun +remap-faces-at-start-present-term ()
      (interactive)
      (setq-local face-remapping-alist '((default (:height 1.50) variable-pitch)
                                         (org-verbatim (:height 1.35) org-verbatim)
                                         (org-block (:height 1.25) org-block))))
    (defun +remap-faces-at-stop-present ()
      (setq-local face-remapping-alist '((default variable-pitch default)))
      (hide-mode-line-mode 0)
      (diff-hl-mode 1)
      (centaur-tabs-mode 1))
    (setq org-tree-slide-breadcrumbs nil)
    (setq org-tree-slide-header nil)
    (setq org-tree-slide-slide-in-effect nil)
    (setq org-tree-slide-heading-emphasis nil)
    (setq org-tree-slide-cursor-init t)
    (setq org-tree-slide-modeline-display nil)
    (setq org-tree-slide-skip-done nil)
    (setq org-tree-slide-skip-comments t)
    (setq org-tree-slide-fold-subtrees-skipped t)
    (setq org-tree-slide-skip-outline-level 8) ;; or 0?
    (setq org-tree-slide-never-touch-face t)
    ;; :config
    ;; (org-tree-slide-presentation-profile)
    )
#+end_src

