readme.html

<div id="outline-container-orgc49bc1e" class="outline-3">
<h3 id="orgc49bc1e"><span class="section-number-3">9.7</span> exporters</h3>
<div class="outline-text-3" id="text-9-7">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #ffffff;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">use-package</span> <span style="color: var(--clr-constant); background-color: var(--bg-constant);">ox-gfm</span>
  <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:after</span> org<span style="color: #ffffff;">)</span>

<span style="color: #ffffff;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">use-package</span> <span style="color: var(--clr-constant); background-color: var(--bg-constant);">ox-ipynb</span>
  <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:straight</span> <span style="color: #ff62d4;">(</span>ox-ipynb <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:type</span> git <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:host</span> github <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:repo</span> <span style="color: var(--clr-string); background-color: var(--bg-string);">"jkitchin/ox-ipynb"</span><span style="color: #ff62d4;">)</span>
  <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:after</span> org<span style="color: #ffffff;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org045ca17" class="outline-3">
<h3 id="org045ca17"><span class="section-number-3">9.8</span> org-tree-slide</h3>
<div class="outline-text-3" id="text-9-8">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #ffffff;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">use-package</span> <span style="color: var(--clr-constant); background-color: var(--bg-constant);">org-tree-slide</span>
  <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:after</span> org
  <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:hook</span> <span style="color: #ff62d4;">(</span><span style="color: #3fdfd0;">(</span>org-tree-slide-play . <span style="color: #fba849;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">lambda</span> <span style="color: #9f80ff;">()</span> <span style="color: #9f80ff;">(</span>+remap-faces-at-start-present<span style="color: #9f80ff;">)</span><span style="color: #fba849;">)</span><span style="color: #3fdfd0;">)</span>
         <span style="color: #3fdfd0;">(</span>org-tree-slide-stop . <span style="color: #fba849;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">lambda</span> <span style="color: #9f80ff;">()</span> <span style="color: #9f80ff;">(</span>+remap-faces-at-stop-present<span style="color: #9f80ff;">)</span><span style="color: #fba849;">)</span><span style="color: #3fdfd0;">)</span><span style="color: #ff62d4;">)</span>
  <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:general</span>
  <span style="color: #ff62d4;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">my/leader-keys</span>
    <span style="color: var(--clr-string); background-color: var(--bg-string);">"t p"</span> '<span style="color: #3fdfd0;">(</span>org-tree-slide-mode <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:wk</span> <span style="color: var(--clr-string); background-color: var(--bg-string);">"present"</span><span style="color: #3fdfd0;">)</span><span style="color: #ff62d4;">)</span>
  <span style="color: #ff62d4;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">general-nmap</span>
    <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:keymaps</span> '<span style="color: #3fdfd0;">(</span>org-tree-slide-mode-map org-mode-map<span style="color: #3fdfd0;">)</span>
    <span style="color: var(--clr-string); background-color: var(--bg-string);">"C-j"</span> 'org-tree-slide-move-next-tree
    <span style="color: var(--clr-string); background-color: var(--bg-string);">"C-k"</span> 'org-tree-slide-move-previous-tree<span style="color: #ff62d4;">)</span>
  <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:init</span>
  <span style="color: #ff62d4;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">setq</span> org-tree-slide-activate-message <span style="color: var(--clr-string); background-color: var(--bg-string);">"Presentation mode ON"</span><span style="color: #ff62d4;">)</span>
  <span style="color: #ff62d4;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">setq</span> org-tree-slide-deactivate-message <span style="color: var(--clr-string); background-color: var(--bg-string);">"Presentation mode OFF"</span><span style="color: #ff62d4;">)</span>
  <span style="color: #ff62d4;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">setq</span> org-tree-slide-indicator nil<span style="color: #ff62d4;">)</span>
  <span style="color: #ff62d4;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">defun</span> <span style="color: var(--function-clr-name); background-color: var(--function-bg-name);">+remap-faces-at-start-present</span> <span style="color: #3fdfd0;">()</span>
    <span style="color: var(--clr-comment-delimiter); background-color: var(--bg-comment-delimiter);">;; </span><span style="color: var(--clr-comment); background-color: var(--bg-comment);">(setq-local face-remapping-alist '((default (:height 1.50) variable-pitch)</span>
    <span style="color: var(--clr-comment-delimiter); background-color: var(--bg-comment-delimiter);">;;                                    </span><span style="color: var(--clr-comment); background-color: var(--bg-comment);">(org-verbatim (:height 1.35) org-verbatim)</span>
    <span style="color: var(--clr-comment-delimiter); background-color: var(--bg-comment-delimiter);">;;                                    </span><span style="color: var(--clr-comment); background-color: var(--bg-comment);">(org-block (:height 1.25) org-block)))</span>
    <span style="color: #3fdfd0;">(</span>hide-mode-line-mode 1<span style="color: #3fdfd0;">)</span>
    <span style="color: #3fdfd0;">(</span>diff-hl-mode 0<span style="color: #3fdfd0;">)</span>
    <span style="color: #3fdfd0;">(</span>centaur-tabs-mode 0<span style="color: #3fdfd0;">)</span><span style="color: #ff62d4;">)</span>
  <span style="color: var(--clr-comment-delimiter); background-color: var(--bg-comment-delimiter);">;; </span><span style="color: #feacd0;">TODO</span><span style="color: var(--clr-comment); background-color: var(--bg-comment);"> maybe also enable olivetti mode?</span>
  <span style="color: #ff62d4;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">defun</span> <span style="color: var(--function-clr-name); background-color: var(--function-bg-name);">+remap-faces-at-start-present-term</span> <span style="color: #3fdfd0;">()</span>
    <span style="color: #3fdfd0;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">interactive</span><span style="color: #3fdfd0;">)</span>
    <span style="color: #3fdfd0;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">setq-local</span> face-remapping-alist '<span style="color: #fba849;">(</span><span style="color: #9f80ff;">(</span>default <span style="color: #4fe42f;">(</span><span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:height</span> 1.50<span style="color: #4fe42f;">)</span> variable-pitch<span style="color: #9f80ff;">)</span>
                                       <span style="color: #9f80ff;">(</span>org-verbatim <span style="color: #4fe42f;">(</span><span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:height</span> 1.35<span style="color: #4fe42f;">)</span> org-verbatim<span style="color: #9f80ff;">)</span>
                                       <span style="color: #9f80ff;">(</span>org-block <span style="color: #4fe42f;">(</span><span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:height</span> 1.25<span style="color: #4fe42f;">)</span> org-block<span style="color: #9f80ff;">)</span><span style="color: #fba849;">)</span><span style="color: #3fdfd0;">)</span><span style="color: #ff62d4;">)</span>
  <span style="color: #ff62d4;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">defun</span> <span style="color: var(--function-clr-name); background-color: var(--function-bg-name);">+remap-faces-at-stop-present</span> <span style="color: #3fdfd0;">()</span>
    <span style="color: #3fdfd0;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">setq-local</span> face-remapping-alist '<span style="color: #fba849;">(</span><span style="color: #9f80ff;">(</span>default variable-pitch default<span style="color: #9f80ff;">)</span><span style="color: #fba849;">)</span><span style="color: #3fdfd0;">)</span>
    <span style="color: #3fdfd0;">(</span>hide-mode-line-mode 0<span style="color: #3fdfd0;">)</span>
    <span style="color: #3fdfd0;">(</span>diff-hl-mode 1<span style="color: #3fdfd0;">)</span>
    <span style="color: #3fdfd0;">(</span>centaur-tabs-mode 1<span style="color: #3fdfd0;">)</span><span style="color: #ff62d4;">)</span>
  <span style="color: #ff62d4;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">setq</span> org-tree-slide-breadcrumbs nil<span style="color: #ff62d4;">)</span>
  <span style="color: #ff62d4;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">setq</span> org-tree-slide-header nil<span style="color: #ff62d4;">)</span>
  <span style="color: #ff62d4;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">setq</span> org-tree-slide-slide-in-effect nil<span style="color: #ff62d4;">)</span>
  <span style="color: #ff62d4;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">setq</span> org-tree-slide-heading-emphasis nil<span style="color: #ff62d4;">)</span>
  <span style="color: #ff62d4;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">setq</span> org-tree-slide-cursor-init t<span style="color: #ff62d4;">)</span>
  <span style="color: #ff62d4;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">setq</span> org-tree-slide-modeline-display nil<span style="color: #ff62d4;">)</span>
  <span style="color: #ff62d4;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">setq</span> org-tree-slide-skip-done nil<span style="color: #ff62d4;">)</span>
  <span style="color: #ff62d4;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">setq</span> org-tree-slide-skip-comments t<span style="color: #ff62d4;">)</span>
  <span style="color: #ff62d4;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">setq</span> org-tree-slide-fold-subtrees-skipped t<span style="color: #ff62d4;">)</span>
  <span style="color: #ff62d4;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">setq</span> org-tree-slide-skip-outline-level 8<span style="color: #ff62d4;">)</span> <span style="color: var(--clr-comment-delimiter); background-color: var(--bg-comment-delimiter);">;; </span><span style="color: var(--clr-comment); background-color: var(--bg-comment);">or 0?</span>
  <span style="color: #ff62d4;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">setq</span> org-tree-slide-never-touch-face t<span style="color: #ff62d4;">)</span>
  <span style="color: var(--clr-comment-delimiter); background-color: var(--bg-comment-delimiter);">;; </span><span style="color: var(--clr-comment); background-color: var(--bg-comment);">:config</span>
  <span style="color: var(--clr-comment-delimiter); background-color: var(--bg-comment-delimiter);">;; </span><span style="color: var(--clr-comment); background-color: var(--bg-comment);">(org-tree-slide-presentation-profile)</span>
  <span style="color: #ffffff;">)</span>
</pre>
</div>
</div>
</div>
