readme.html

<div id="outline-container-orgfd267ab" class="outline-3">
<h3 id="orgfd267ab"><span class="section-number-3">9.9</span> evil-org-mode</h3>
<div class="outline-text-3" id="text-9-9">
<p>
Taken from DOOM, mostly for the nice <code>+org/insert-item-below</code> and <code>+org/dwim-at-point</code> functions.
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #ffffff;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">use-package</span> <span style="color: var(--clr-constant); background-color: var(--bg-constant);">evil-org-mode</span>
  <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:straight</span> <span style="color: #ff62d4;">(</span>evil-org-mode <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:type</span> git <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:host</span> github <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:repo</span> <span style="color: var(--clr-string); background-color: var(--bg-string);">"hlissner/evil-org-mode"</span><span style="color: #ff62d4;">)</span>
  <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:hook</span> <span style="color: #ff62d4;">(</span>org-mode . evil-org-mode<span style="color: #ff62d4;">)</span>
  <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:general</span>
  <span style="color: #ff62d4;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">general-nmap</span>
    <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:keymaps</span> '<span style="color: #3fdfd0;">(</span>evil-org-mode-map org-mode-map <span style="color: #3fdfd0;">)</span>
    <span style="color: var(--clr-string); background-color: var(--bg-string);">"&lt;C-return&gt;"</span>      #'+org/insert-item-below
    <span style="color: var(--clr-string); background-color: var(--bg-string);">"&lt;C-S-return&gt;"</span>    #'+org/insert-item-above
    <span style="color: var(--clr-string); background-color: var(--bg-string);">"&lt;return&gt;"</span>   #'+org/dwim-at-point<span style="color: #ff62d4;">)</span>
  <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:init</span>
  <span style="color: #ff62d4;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">defun</span> <span style="color: var(--function-clr-name); background-color: var(--function-bg-name);">+org--insert-item</span> <span style="color: #3fdfd0;">(</span>direction<span style="color: #3fdfd0;">)</span>
    <span style="color: #3fdfd0;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">let</span> <span style="color: #fba849;">(</span><span style="color: #9f80ff;">(</span>context <span style="color: #4fe42f;">(</span>org-element-lineage
                    <span style="color: #fe6060;">(</span>org-element-context<span style="color: #fe6060;">)</span>
                    '<span style="color: #fe6060;">(</span>table table-row headline inlinetask item plain-list<span style="color: #fe6060;">)</span>
                    t<span style="color: #4fe42f;">)</span><span style="color: #9f80ff;">)</span><span style="color: #fba849;">)</span>
      <span style="color: #fba849;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">pcase</span> <span style="color: #9f80ff;">(</span>org-element-type context<span style="color: #9f80ff;">)</span>
        <span style="color: var(--clr-comment-delimiter); background-color: var(--bg-comment-delimiter);">;; </span><span style="color: var(--clr-comment); background-color: var(--bg-comment);">Add a new list item (carrying over checkboxes if necessary)</span>
        <span style="color: #9f80ff;">(</span><span style="color: #4fe42f;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">or</span> `item `plain-list<span style="color: #4fe42f;">)</span>
         <span style="color: var(--clr-comment-delimiter); background-color: var(--bg-comment-delimiter);">;; </span><span style="color: var(--clr-comment); background-color: var(--bg-comment);">Position determines where org-insert-todo-heading and org-insert-item</span>
         <span style="color: var(--clr-comment-delimiter); background-color: var(--bg-comment-delimiter);">;; </span><span style="color: var(--clr-comment); background-color: var(--bg-comment);">insert the new list item.</span>
         <span style="color: #4fe42f;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">if</span> <span style="color: #fe6060;">(</span>eq direction 'above<span style="color: #fe6060;">)</span>
             <span style="color: #fe6060;">(</span>org-beginning-of-item<span style="color: #fe6060;">)</span>
           <span style="color: #fe6060;">(</span>org-end-of-item<span style="color: #fe6060;">)</span>
           <span style="color: #fe6060;">(</span>backward-char<span style="color: #fe6060;">)</span><span style="color: #4fe42f;">)</span>
         <span style="color: #4fe42f;">(</span>org-insert-item <span style="color: #fe6060;">(</span>org-element-property <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:checkbox</span> context<span style="color: #fe6060;">)</span><span style="color: #4fe42f;">)</span>
         <span style="color: var(--clr-comment-delimiter); background-color: var(--bg-comment-delimiter);">;; </span><span style="color: var(--clr-comment); background-color: var(--bg-comment);">Handle edge case where current item is empty and bottom of list is</span>
         <span style="color: var(--clr-comment-delimiter); background-color: var(--bg-comment-delimiter);">;; </span><span style="color: var(--clr-comment); background-color: var(--bg-comment);">flush against a new heading.</span>
         <span style="color: #4fe42f;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">when</span> <span style="color: #fe6060;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">and</span> <span style="color: #4fafff;">(</span>eq direction 'below<span style="color: #4fafff;">)</span>
                    <span style="color: #4fafff;">(</span>eq <span style="color: #f0dd60;">(</span>org-element-property <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:contents-begin</span> context<span style="color: #f0dd60;">)</span>
                        <span style="color: #f0dd60;">(</span>org-element-property <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:contents-end</span> context<span style="color: #f0dd60;">)</span><span style="color: #4fafff;">)</span><span style="color: #fe6060;">)</span>
           <span style="color: #fe6060;">(</span>org-end-of-item<span style="color: #fe6060;">)</span>
           <span style="color: #fe6060;">(</span>org-end-of-line<span style="color: #fe6060;">)</span><span style="color: #4fe42f;">)</span><span style="color: #9f80ff;">)</span>

        <span style="color: var(--clr-comment-delimiter); background-color: var(--bg-comment-delimiter);">;; </span><span style="color: var(--clr-comment); background-color: var(--bg-comment);">Add a new table row</span>
        <span style="color: #9f80ff;">(</span><span style="color: #4fe42f;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">or</span> `table `table-row<span style="color: #4fe42f;">)</span>
         <span style="color: #4fe42f;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">pcase</span> direction
           <span style="color: #fe6060;">(</span>'below <span style="color: #4fafff;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">save-excursion</span> <span style="color: #f0dd60;">(</span>org-table-insert-row t<span style="color: #f0dd60;">)</span><span style="color: #4fafff;">)</span>
                   <span style="color: #4fafff;">(</span>org-table-next-row<span style="color: #4fafff;">)</span><span style="color: #fe6060;">)</span>
           <span style="color: #fe6060;">(</span>'above <span style="color: #4fafff;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">save-excursion</span> <span style="color: #f0dd60;">(</span>org-shiftmetadown<span style="color: #f0dd60;">)</span><span style="color: #4fafff;">)</span>
                   <span style="color: #4fafff;">(</span>+org/table-previous-row<span style="color: #4fafff;">)</span><span style="color: #fe6060;">)</span><span style="color: #4fe42f;">)</span><span style="color: #9f80ff;">)</span>

        <span style="color: var(--clr-comment-delimiter); background-color: var(--bg-comment-delimiter);">;; </span><span style="color: var(--clr-comment); background-color: var(--bg-comment);">Otherwise, add a new heading, carrying over any todo state, if</span>
        <span style="color: var(--clr-comment-delimiter); background-color: var(--bg-comment-delimiter);">;; </span><span style="color: var(--clr-comment); background-color: var(--bg-comment);">necessary.</span>
        <span style="color: #9f80ff;">(</span>_
         <span style="color: #4fe42f;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">let</span> <span style="color: #fe6060;">(</span><span style="color: #4fafff;">(</span>level <span style="color: #f0dd60;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">or</span> <span style="color: #ffffff;">(</span>org-current-level<span style="color: #ffffff;">)</span> 1<span style="color: #f0dd60;">)</span><span style="color: #4fafff;">)</span><span style="color: #fe6060;">)</span>
           <span style="color: var(--clr-comment-delimiter); background-color: var(--bg-comment-delimiter);">;; </span><span style="color: var(--clr-comment); background-color: var(--bg-comment);">I intentionally avoid `</span><span style="color: var(--clr-constant); background-color: var(--bg-constant);">org-insert-heading</span><span style="color: var(--clr-comment); background-color: var(--bg-comment);">' and the like because they</span>
           <span style="color: var(--clr-comment-delimiter); background-color: var(--bg-comment-delimiter);">;; </span><span style="color: var(--clr-comment); background-color: var(--bg-comment);">impose unpredictable whitespace rules depending on the cursor</span>
           <span style="color: var(--clr-comment-delimiter); background-color: var(--bg-comment-delimiter);">;; </span><span style="color: var(--clr-comment); background-color: var(--bg-comment);">position. It's simpler to express this command's responsibility at a</span>
           <span style="color: var(--clr-comment-delimiter); background-color: var(--bg-comment-delimiter);">;; </span><span style="color: var(--clr-comment); background-color: var(--bg-comment);">lower level than work around all the quirks in org's API.</span>
           <span style="color: #fe6060;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">pcase</span> direction
             <span style="color: #4fafff;">(</span>`below
              <span style="color: #f0dd60;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">let</span> <span style="color: #ffffff;">(</span>org-insert-heading-respect-content<span style="color: #ffffff;">)</span>
                <span style="color: #ffffff;">(</span>goto-char <span style="color: #ff62d4;">(</span>line-end-position<span style="color: #ff62d4;">)</span><span style="color: #ffffff;">)</span>
                <span style="color: #ffffff;">(</span>org-end-of-subtree<span style="color: #ffffff;">)</span>
                <span style="color: #ffffff;">(</span>insert <span style="color: var(--clr-string); background-color: var(--bg-string);">"\n"</span> <span style="color: #ff62d4;">(</span>make-string level ?*<span style="color: #ff62d4;">)</span> <span style="color: var(--clr-string); background-color: var(--bg-string);">" "</span><span style="color: #ffffff;">)</span><span style="color: #f0dd60;">)</span><span style="color: #4fafff;">)</span>
             <span style="color: #4fafff;">(</span>`above
              <span style="color: #f0dd60;">(</span>org-back-to-heading<span style="color: #f0dd60;">)</span>
              <span style="color: #f0dd60;">(</span>insert <span style="color: #ffffff;">(</span>make-string level ?*<span style="color: #ffffff;">)</span> <span style="color: var(--clr-string); background-color: var(--bg-string);">" "</span><span style="color: #f0dd60;">)</span>
              <span style="color: #f0dd60;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">save-excursion</span> <span style="color: #ffffff;">(</span>insert <span style="color: var(--clr-string); background-color: var(--bg-string);">"\n"</span><span style="color: #ffffff;">)</span><span style="color: #f0dd60;">)</span><span style="color: #4fafff;">)</span><span style="color: #fe6060;">)</span>
           <span style="color: #fe6060;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">when-let*</span> <span style="color: #4fafff;">(</span><span style="color: #f0dd60;">(</span>todo-keyword <span style="color: #ffffff;">(</span>org-element-property <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:todo-keyword</span> context<span style="color: #ffffff;">)</span><span style="color: #f0dd60;">)</span>
                       <span style="color: #f0dd60;">(</span>todo-type    <span style="color: #ffffff;">(</span>org-element-property <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:todo-type</span> context<span style="color: #ffffff;">)</span><span style="color: #f0dd60;">)</span><span style="color: #4fafff;">)</span>
             <span style="color: #4fafff;">(</span>org-todo
              <span style="color: #f0dd60;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">cond</span> <span style="color: #ffffff;">(</span><span style="color: #ff62d4;">(</span>eq todo-type 'done<span style="color: #ff62d4;">)</span>
                     <span style="color: var(--clr-comment-delimiter); background-color: var(--bg-comment-delimiter);">;; </span><span style="color: var(--clr-comment); background-color: var(--bg-comment);">Doesn't make sense to create more "</span><span style="color: #44bc44;">DONE</span><span style="color: var(--clr-comment); background-color: var(--bg-comment);">" headings</span>
                     <span style="color: #ff62d4;">(</span>car <span style="color: #3fdfd0;">(</span>+org-get-todo-keywords-for todo-keyword<span style="color: #3fdfd0;">)</span><span style="color: #ff62d4;">)</span><span style="color: #ffffff;">)</span>
                    <span style="color: #ffffff;">(</span>todo-keyword<span style="color: #ffffff;">)</span>
                    <span style="color: #ffffff;">(</span>'todo<span style="color: #ffffff;">)</span><span style="color: #f0dd60;">)</span><span style="color: #4fafff;">)</span><span style="color: #fe6060;">)</span><span style="color: #4fe42f;">)</span><span style="color: #9f80ff;">)</span><span style="color: #fba849;">)</span>

      <span style="color: #fba849;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">when</span> <span style="color: #9f80ff;">(</span>org-invisible-p<span style="color: #9f80ff;">)</span>
        <span style="color: #9f80ff;">(</span>org-show-hidden-entry<span style="color: #9f80ff;">)</span><span style="color: #fba849;">)</span>
      <span style="color: #fba849;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">when</span> <span style="color: #9f80ff;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">and</span> <span style="color: #4fe42f;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">bound-and-true-p</span> evil-local-mode<span style="color: #4fe42f;">)</span>
                 <span style="color: #4fe42f;">(</span>not <span style="color: #fe6060;">(</span>evil-emacs-state-p<span style="color: #fe6060;">)</span><span style="color: #4fe42f;">)</span><span style="color: #9f80ff;">)</span>
        <span style="color: #9f80ff;">(</span>evil-insert 1<span style="color: #9f80ff;">)</span><span style="color: #fba849;">)</span><span style="color: #3fdfd0;">)</span><span style="color: #ff62d4;">)</span>

  <span style="color: #ff62d4;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">defun</span> <span style="color: var(--function-clr-name); background-color: var(--function-bg-name);">+org/insert-item-below</span> <span style="color: #3fdfd0;">(</span>count<span style="color: #3fdfd0;">)</span>
    <span style="color: var(--clr-doc); background-color: var(--bg-doc);">"Inserts a new heading, table cell or item below the current one."</span>
    <span style="color: #3fdfd0;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">interactive</span> <span style="color: var(--clr-string); background-color: var(--bg-string);">"p"</span><span style="color: #3fdfd0;">)</span>
    <span style="color: #3fdfd0;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">dotimes</span> <span style="color: #fba849;">(</span>_ count<span style="color: #fba849;">)</span> <span style="color: #fba849;">(</span>+org--insert-item 'below<span style="color: #fba849;">)</span><span style="color: #3fdfd0;">)</span><span style="color: #ff62d4;">)</span>

  <span style="color: #ff62d4;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">defun</span> <span style="color: var(--function-clr-name); background-color: var(--function-bg-name);">+org/insert-item-above</span> <span style="color: #3fdfd0;">(</span>count<span style="color: #3fdfd0;">)</span>
    <span style="color: var(--clr-doc); background-color: var(--bg-doc);">"Inserts a new heading, table cell or item above the current one."</span>
    <span style="color: #3fdfd0;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">interactive</span> <span style="color: var(--clr-string); background-color: var(--bg-string);">"p"</span><span style="color: #3fdfd0;">)</span>
    <span style="color: #3fdfd0;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">dotimes</span> <span style="color: #fba849;">(</span>_ count<span style="color: #fba849;">)</span> <span style="color: #fba849;">(</span>+org--insert-item 'above<span style="color: #fba849;">)</span><span style="color: #3fdfd0;">)</span><span style="color: #ff62d4;">)</span>

  <span style="color: #ff62d4;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">defun</span> <span style="color: var(--function-clr-name); background-color: var(--function-bg-name);">+org/dwim-at-point</span> <span style="color: #3fdfd0;">(</span><span style="color: #6ae4b9; font-weight: bold;">&amp;optional</span> arg<span style="color: #3fdfd0;">)</span>
    <span style="color: var(--clr-doc); background-color: var(--bg-doc);">"Do-what-I-mean at point.</span>
<span style="color: var(--clr-doc); background-color: var(--bg-doc);">  If on a:</span>
<span style="color: var(--clr-doc); background-color: var(--bg-doc);">  - checkbox list item or todo heading: toggle it.</span>
<span style="color: var(--clr-doc); background-color: var(--bg-doc);">  - clock: update its time.</span>
<span style="color: var(--clr-doc); background-color: var(--bg-doc);">  - headline: cycle ARCHIVE subtrees, toggle latex fragments and inline images in</span>
<span style="color: var(--clr-doc); background-color: var(--bg-doc);">    subtree; update statistics cookies/checkboxes and ToCs.</span>
<span style="color: var(--clr-doc); background-color: var(--bg-doc);">  - footnote reference: jump to the footnote's definition</span>
<span style="color: var(--clr-doc); background-color: var(--bg-doc);">  - footnote definition: jump to the first reference of this footnote</span>
<span style="color: var(--clr-doc); background-color: var(--bg-doc);">  - table-row or a TBLFM: recalculate the table's formulas</span>
<span style="color: var(--clr-doc); background-color: var(--bg-doc);">  - table-cell: clear it and go into insert mode. If this is a formula cell,</span>
<span style="color: var(--clr-doc); background-color: var(--bg-doc);">    recaluclate it instead.</span>
<span style="color: var(--clr-doc); background-color: var(--bg-doc);">  - babel-call: execute the source block</span>
<span style="color: var(--clr-doc); background-color: var(--bg-doc);">  - statistics-cookie: update it.</span>
<span style="color: var(--clr-doc); background-color: var(--bg-doc);">  - latex fragment: toggle it.</span>
<span style="color: var(--clr-doc); background-color: var(--bg-doc);">  - link: follow it</span>
<span style="color: var(--clr-doc); background-color: var(--bg-doc);">  - otherwise, refresh all inline images in current tree."</span>
    <span style="color: #3fdfd0;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">interactive</span> <span style="color: var(--clr-string); background-color: var(--bg-string);">"P"</span><span style="color: #3fdfd0;">)</span>
    <span style="color: #3fdfd0;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">let*</span> <span style="color: #fba849;">(</span><span style="color: #9f80ff;">(</span>context <span style="color: #4fe42f;">(</span>org-element-context<span style="color: #4fe42f;">)</span><span style="color: #9f80ff;">)</span>
           <span style="color: #9f80ff;">(</span>type <span style="color: #4fe42f;">(</span>org-element-type context<span style="color: #4fe42f;">)</span><span style="color: #9f80ff;">)</span><span style="color: #fba849;">)</span>
      <span style="color: var(--clr-comment-delimiter); background-color: var(--bg-comment-delimiter);">;; </span><span style="color: var(--clr-comment); background-color: var(--bg-comment);">skip over unimportant contexts</span>
      <span style="color: #fba849;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">while</span> <span style="color: #9f80ff;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">and</span> context <span style="color: #4fe42f;">(</span>memq type '<span style="color: #fe6060;">(</span>verbatim code bold italic underline strike-through subscript superscript<span style="color: #fe6060;">)</span><span style="color: #4fe42f;">)</span><span style="color: #9f80ff;">)</span>
        <span style="color: #9f80ff;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">setq</span> context <span style="color: #4fe42f;">(</span>org-element-property <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:parent</span> context<span style="color: #4fe42f;">)</span>
              type <span style="color: #4fe42f;">(</span>org-element-type context<span style="color: #4fe42f;">)</span><span style="color: #9f80ff;">)</span><span style="color: #fba849;">)</span>
      <span style="color: #fba849;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">pcase</span> type
        <span style="color: #9f80ff;">(</span>`headline
         <span style="color: #4fe42f;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">cond</span> <span style="color: #fe6060;">(</span><span style="color: #4fafff;">(</span>memq <span style="color: #f0dd60;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">bound-and-true-p</span> org-goto-map<span style="color: #f0dd60;">)</span>
                      <span style="color: #f0dd60;">(</span>current-active-maps<span style="color: #f0dd60;">)</span><span style="color: #4fafff;">)</span>
                <span style="color: #4fafff;">(</span>org-goto-ret<span style="color: #4fafff;">)</span><span style="color: #fe6060;">)</span>
               <span style="color: #fe6060;">(</span><span style="color: #4fafff;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">and</span> <span style="color: #f0dd60;">(</span>fboundp 'toc-org-insert-toc<span style="color: #f0dd60;">)</span>
                     <span style="color: #f0dd60;">(</span>member <span style="color: var(--clr-string); background-color: var(--bg-string);">"TOC"</span> <span style="color: #ffffff;">(</span>org-get-tags<span style="color: #ffffff;">)</span><span style="color: #f0dd60;">)</span><span style="color: #4fafff;">)</span>
                <span style="color: #4fafff;">(</span>toc-org-insert-toc<span style="color: #4fafff;">)</span>
                <span style="color: #4fafff;">(</span>message <span style="color: var(--clr-string); background-color: var(--bg-string);">"Updating table of contents"</span><span style="color: #4fafff;">)</span><span style="color: #fe6060;">)</span>
               <span style="color: #fe6060;">(</span><span style="color: #4fafff;">(</span>string= <span style="color: var(--clr-string); background-color: var(--bg-string);">"ARCHIVE"</span> <span style="color: #f0dd60;">(</span>car-safe <span style="color: #ffffff;">(</span>org-get-tags<span style="color: #ffffff;">)</span><span style="color: #f0dd60;">)</span><span style="color: #4fafff;">)</span>
                <span style="color: #4fafff;">(</span>org-force-cycle-archived<span style="color: #4fafff;">)</span><span style="color: #fe6060;">)</span>
               <span style="color: #fe6060;">(</span><span style="color: #4fafff;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">or</span> <span style="color: #f0dd60;">(</span>org-element-property <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:todo-type</span> context<span style="color: #f0dd60;">)</span>
                    <span style="color: #f0dd60;">(</span>org-element-property <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:scheduled</span> context<span style="color: #f0dd60;">)</span><span style="color: #4fafff;">)</span>
                <span style="color: #4fafff;">(</span>org-todo
                 <span style="color: #f0dd60;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">if</span> <span style="color: #ffffff;">(</span>eq <span style="color: #ff62d4;">(</span>org-element-property <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:todo-type</span> context<span style="color: #ff62d4;">)</span> 'done<span style="color: #ffffff;">)</span>
                     <span style="color: #ffffff;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">or</span> <span style="color: #ff62d4;">(</span>car <span style="color: #3fdfd0;">(</span>+org-get-todo-keywords-for <span style="color: #fba849;">(</span>org-element-property <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:todo-keyword</span> context<span style="color: #fba849;">)</span><span style="color: #3fdfd0;">)</span><span style="color: #ff62d4;">)</span>
                         'todo<span style="color: #ffffff;">)</span>
                   'done<span style="color: #f0dd60;">)</span><span style="color: #4fafff;">)</span><span style="color: #fe6060;">)</span><span style="color: #4fe42f;">)</span>
         <span style="color: var(--clr-comment-delimiter); background-color: var(--bg-comment-delimiter);">;; </span><span style="color: var(--clr-comment); background-color: var(--bg-comment);">Update any metadata or inline previews in this subtree</span>
         <span style="color: #4fe42f;">(</span>org-update-checkbox-count<span style="color: #4fe42f;">)</span>
         <span style="color: #4fe42f;">(</span>org-update-parent-todo-statistics<span style="color: #4fe42f;">)</span>
         <span style="color: #4fe42f;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">when</span> <span style="color: #fe6060;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">and</span> <span style="color: #4fafff;">(</span>fboundp 'toc-org-insert-toc<span style="color: #4fafff;">)</span>
                    <span style="color: #4fafff;">(</span>member <span style="color: var(--clr-string); background-color: var(--bg-string);">"TOC"</span> <span style="color: #f0dd60;">(</span>org-get-tags<span style="color: #f0dd60;">)</span><span style="color: #4fafff;">)</span><span style="color: #fe6060;">)</span>
           <span style="color: #fe6060;">(</span>toc-org-insert-toc<span style="color: #fe6060;">)</span>
           <span style="color: #fe6060;">(</span>message <span style="color: var(--clr-string); background-color: var(--bg-string);">"Updating table of contents"</span><span style="color: #fe6060;">)</span><span style="color: #4fe42f;">)</span>
         <span style="color: #4fe42f;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">let*</span> <span style="color: #fe6060;">(</span><span style="color: #4fafff;">(</span>beg <span style="color: #f0dd60;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">if</span> <span style="color: #ffffff;">(</span>org-before-first-heading-p<span style="color: #ffffff;">)</span>
                         <span style="color: #ffffff;">(</span>line-beginning-position<span style="color: #ffffff;">)</span>
                       <span style="color: #ffffff;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">save-excursion</span> <span style="color: #ff62d4;">(</span>org-back-to-heading<span style="color: #ff62d4;">)</span> <span style="color: #ff62d4;">(</span>point<span style="color: #ff62d4;">)</span><span style="color: #ffffff;">)</span><span style="color: #f0dd60;">)</span><span style="color: #4fafff;">)</span>
                <span style="color: #4fafff;">(</span>end <span style="color: #f0dd60;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">if</span> <span style="color: #ffffff;">(</span>org-before-first-heading-p<span style="color: #ffffff;">)</span>
                         <span style="color: #ffffff;">(</span>line-end-position<span style="color: #ffffff;">)</span>
                       <span style="color: #ffffff;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">save-excursion</span> <span style="color: #ff62d4;">(</span>org-end-of-subtree<span style="color: #ff62d4;">)</span> <span style="color: #ff62d4;">(</span>point<span style="color: #ff62d4;">)</span><span style="color: #ffffff;">)</span><span style="color: #f0dd60;">)</span><span style="color: #4fafff;">)</span>
                <span style="color: #4fafff;">(</span>overlays <span style="color: #f0dd60;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">ignore-errors</span> <span style="color: #ffffff;">(</span>overlays-in beg end<span style="color: #ffffff;">)</span><span style="color: #f0dd60;">)</span><span style="color: #4fafff;">)</span>
                <span style="color: #4fafff;">(</span>latex-overlays
                 <span style="color: #f0dd60;">(</span>cl-find-if <span style="color: #ffffff;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">lambda</span> <span style="color: #ff62d4;">(</span>o<span style="color: #ff62d4;">)</span> <span style="color: #ff62d4;">(</span>eq <span style="color: #3fdfd0;">(</span>overlay-get o 'org-overlay-type<span style="color: #3fdfd0;">)</span> 'org-latex-overlay<span style="color: #ff62d4;">)</span><span style="color: #ffffff;">)</span>
                             overlays<span style="color: #f0dd60;">)</span><span style="color: #4fafff;">)</span>
                <span style="color: #4fafff;">(</span>image-overlays
                 <span style="color: #f0dd60;">(</span>cl-find-if <span style="color: #ffffff;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">lambda</span> <span style="color: #ff62d4;">(</span>o<span style="color: #ff62d4;">)</span> <span style="color: #ff62d4;">(</span>overlay-get o 'org-image-overlay<span style="color: #ff62d4;">)</span><span style="color: #ffffff;">)</span>
                             overlays<span style="color: #f0dd60;">)</span><span style="color: #4fafff;">)</span><span style="color: #fe6060;">)</span>
           <span style="color: #fe6060;">(</span>+org--toggle-inline-images-in-subtree beg end<span style="color: #fe6060;">)</span>
           <span style="color: #fe6060;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">if</span> <span style="color: #4fafff;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">or</span> image-overlays latex-overlays<span style="color: #4fafff;">)</span>
               <span style="color: #4fafff;">(</span>org-clear-latex-preview beg end<span style="color: #4fafff;">)</span>
             <span style="color: #4fafff;">(</span>org--latex-preview-region beg end<span style="color: #4fafff;">)</span><span style="color: #fe6060;">)</span><span style="color: #4fe42f;">)</span><span style="color: #9f80ff;">)</span>

        <span style="color: #9f80ff;">(</span>`clock <span style="color: #4fe42f;">(</span>org-clock-update-time-maybe<span style="color: #4fe42f;">)</span><span style="color: #9f80ff;">)</span>

        <span style="color: #9f80ff;">(</span>`footnote-reference
         <span style="color: #4fe42f;">(</span>org-footnote-goto-definition <span style="color: #fe6060;">(</span>org-element-property <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:label</span> context<span style="color: #fe6060;">)</span><span style="color: #4fe42f;">)</span><span style="color: #9f80ff;">)</span>

        <span style="color: #9f80ff;">(</span>`footnote-definition
         <span style="color: #4fe42f;">(</span>org-footnote-goto-previous-reference <span style="color: #fe6060;">(</span>org-element-property <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:label</span> context<span style="color: #fe6060;">)</span><span style="color: #4fe42f;">)</span><span style="color: #9f80ff;">)</span>

        <span style="color: #9f80ff;">(</span><span style="color: #4fe42f;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">or</span> `planning `timestamp<span style="color: #4fe42f;">)</span>
         <span style="color: #4fe42f;">(</span>org-follow-timestamp-link<span style="color: #4fe42f;">)</span><span style="color: #9f80ff;">)</span>

        <span style="color: #9f80ff;">(</span><span style="color: #4fe42f;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">or</span> `table `table-row<span style="color: #4fe42f;">)</span>
         <span style="color: #4fe42f;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">if</span> <span style="color: #fe6060;">(</span>org-at-TBLFM-p<span style="color: #fe6060;">)</span>
             <span style="color: #fe6060;">(</span>org-table-calc-current-TBLFM<span style="color: #fe6060;">)</span>
           <span style="color: #fe6060;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">ignore-errors</span>
             <span style="color: #4fafff;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">save-excursion</span>
               <span style="color: #f0dd60;">(</span>goto-char <span style="color: #ffffff;">(</span>org-element-property <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:contents-begin</span> context<span style="color: #ffffff;">)</span><span style="color: #f0dd60;">)</span>
               <span style="color: #f0dd60;">(</span>org-call-with-arg 'org-table-recalculate <span style="color: #ffffff;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">or</span> arg t<span style="color: #ffffff;">)</span><span style="color: #f0dd60;">)</span><span style="color: #4fafff;">)</span><span style="color: #fe6060;">)</span><span style="color: #4fe42f;">)</span><span style="color: #9f80ff;">)</span>

        <span style="color: #9f80ff;">(</span>`table-cell
         <span style="color: #4fe42f;">(</span>org-table-blank-field<span style="color: #4fe42f;">)</span>
         <span style="color: #4fe42f;">(</span>org-table-recalculate arg<span style="color: #4fe42f;">)</span>
         <span style="color: #4fe42f;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">when</span> <span style="color: #fe6060;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">and</span> <span style="color: #4fafff;">(</span>string-empty-p <span style="color: #f0dd60;">(</span>string-trim <span style="color: #ffffff;">(</span>org-table-get-field<span style="color: #ffffff;">)</span><span style="color: #f0dd60;">)</span><span style="color: #4fafff;">)</span>
                    <span style="color: #4fafff;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">bound-and-true-p</span> evil-local-mode<span style="color: #4fafff;">)</span><span style="color: #fe6060;">)</span>
           <span style="color: #fe6060;">(</span>evil-change-state 'insert<span style="color: #fe6060;">)</span><span style="color: #4fe42f;">)</span><span style="color: #9f80ff;">)</span>

        <span style="color: #9f80ff;">(</span>`babel-call
         <span style="color: #4fe42f;">(</span>org-babel-lob-execute-maybe<span style="color: #4fe42f;">)</span><span style="color: #9f80ff;">)</span>

        <span style="color: #9f80ff;">(</span>`statistics-cookie
         <span style="color: #4fe42f;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">save-excursion</span> <span style="color: #fe6060;">(</span>org-update-statistics-cookies arg<span style="color: #fe6060;">)</span><span style="color: #4fe42f;">)</span><span style="color: #9f80ff;">)</span>

        <span style="color: #9f80ff;">(</span><span style="color: #4fe42f;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">or</span> `src-block `inline-src-block<span style="color: #4fe42f;">)</span>
         <span style="color: #4fe42f;">(</span>org-babel-execute-src-block arg<span style="color: #4fe42f;">)</span><span style="color: #9f80ff;">)</span>

        <span style="color: #9f80ff;">(</span><span style="color: #4fe42f;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">or</span> `latex-fragment `latex-environment<span style="color: #4fe42f;">)</span>
         <span style="color: #4fe42f;">(</span>org-latex-preview arg<span style="color: #4fe42f;">)</span><span style="color: #9f80ff;">)</span>

        <span style="color: #9f80ff;">(</span>`link
         <span style="color: #4fe42f;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">let*</span> <span style="color: #fe6060;">(</span><span style="color: #4fafff;">(</span>lineage <span style="color: #f0dd60;">(</span>org-element-lineage context '<span style="color: #ffffff;">(</span>link<span style="color: #ffffff;">)</span> t<span style="color: #f0dd60;">)</span><span style="color: #4fafff;">)</span>
                <span style="color: #4fafff;">(</span>path <span style="color: #f0dd60;">(</span>org-element-property <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:path</span> lineage<span style="color: #f0dd60;">)</span><span style="color: #4fafff;">)</span><span style="color: #fe6060;">)</span>
           <span style="color: #fe6060;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">if</span> <span style="color: #4fafff;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">or</span> <span style="color: #f0dd60;">(</span>equal <span style="color: #ffffff;">(</span>org-element-property <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:type</span> lineage<span style="color: #ffffff;">)</span> <span style="color: var(--clr-string); background-color: var(--bg-string);">"img"</span><span style="color: #f0dd60;">)</span>
                   <span style="color: #f0dd60;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">and</span> path <span style="color: #ffffff;">(</span>image-type-from-file-name path<span style="color: #ffffff;">)</span><span style="color: #f0dd60;">)</span><span style="color: #4fafff;">)</span>
               <span style="color: #4fafff;">(</span>+org--toggle-inline-images-in-subtree
                <span style="color: #f0dd60;">(</span>org-element-property <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:begin</span> lineage<span style="color: #f0dd60;">)</span>
                <span style="color: #f0dd60;">(</span>org-element-property <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:end</span> lineage<span style="color: #f0dd60;">)</span><span style="color: #4fafff;">)</span>
             <span style="color: #4fafff;">(</span>org-open-at-point arg<span style="color: #4fafff;">)</span><span style="color: #fe6060;">)</span><span style="color: #4fe42f;">)</span><span style="color: #9f80ff;">)</span>

        <span style="color: #9f80ff;">(</span><span style="color: #4fe42f;">(</span>guard <span style="color: #fe6060;">(</span>org-element-property <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:checkbox</span> <span style="color: #4fafff;">(</span>org-element-lineage context '<span style="color: #f0dd60;">(</span>item<span style="color: #f0dd60;">)</span> t<span style="color: #4fafff;">)</span><span style="color: #fe6060;">)</span><span style="color: #4fe42f;">)</span>
         <span style="color: #4fe42f;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">let</span> <span style="color: #fe6060;">(</span><span style="color: #4fafff;">(</span>match <span style="color: #f0dd60;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">and</span> <span style="color: #ffffff;">(</span>org-at-item-checkbox-p<span style="color: #ffffff;">)</span> <span style="color: #ffffff;">(</span>match-string 1<span style="color: #ffffff;">)</span><span style="color: #f0dd60;">)</span><span style="color: #4fafff;">)</span><span style="color: #fe6060;">)</span>
           <span style="color: #fe6060;">(</span>org-toggle-checkbox <span style="color: #4fafff;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">if</span> <span style="color: #f0dd60;">(</span>equal match <span style="color: var(--clr-string); background-color: var(--bg-string);">"[ ]"</span><span style="color: #f0dd60;">)</span> '<span style="color: #f0dd60;">(</span>16<span style="color: #f0dd60;">)</span><span style="color: #4fafff;">)</span><span style="color: #fe6060;">)</span><span style="color: #4fe42f;">)</span><span style="color: #9f80ff;">)</span>

        <span style="color: #9f80ff;">(</span>_
         <span style="color: #4fe42f;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">if</span> <span style="color: #fe6060;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">or</span> <span style="color: #4fafff;">(</span>org-in-regexp org-ts-regexp-both nil t<span style="color: #4fafff;">)</span>
                 <span style="color: #4fafff;">(</span>org-in-regexp org-tsr-regexp-both nil  t<span style="color: #4fafff;">)</span>
                 <span style="color: #4fafff;">(</span>org-in-regexp org-link-any-re nil t<span style="color: #4fafff;">)</span><span style="color: #fe6060;">)</span>
             <span style="color: #fe6060;">(</span>call-interactively #'org-open-at-point<span style="color: #fe6060;">)</span>
           <span style="color: #fe6060;">(</span>+org--toggle-inline-images-in-subtree
            <span style="color: #4fafff;">(</span>org-element-property <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:begin</span> context<span style="color: #4fafff;">)</span>
            <span style="color: #4fafff;">(</span>org-element-property <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:end</span> context<span style="color: #4fafff;">)</span><span style="color: #fe6060;">)</span><span style="color: #4fe42f;">)</span><span style="color: #9f80ff;">)</span><span style="color: #fba849;">)</span><span style="color: #3fdfd0;">)</span><span style="color: #ff62d4;">)</span>

  <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:config</span>
  <span style="color: #ff62d4;">(</span>add-hook 'evil-org-mode-hook #'evil-normalize-keymaps<span style="color: #ff62d4;">)</span>
  <span style="color: #ffffff;">)</span>
</pre>
</div>
</div>
</div>
