readme.org
** org-html-themify
#+begin_src emacs-lisp
(use-package org-html-themify
  :straight
  (org-html-themify
   :type git
   :host github
   :repo "DogLooksGood/org-html-themify"
   :files ("*.el" "*.js" "*.css"))
  :hook (org-mode . org-html-themify-mode)
  :init
  (setq org-html-themify-themes
   '((dark . modus-vivendi)
     (light . modus-operandi))))
#+end_src

* Programming languages
** lsp mode
#+BEGIN_SRC emacs-lisp
  (use-package lsp-mode
    :commands (lsp lsp-deferred)
    :hook (lsp-mode . (lambda ()
                        (setq-local evil-lookup-func #'lsp-describe-thing-at-point)))
    :general
    (my/leader-keys
      "c" '(:keymap lsp-command-map))
    (my/local-leader-keys
      :keymaps 'lsp-mode-map
      "r" '(lsp-rename :wk "rename")
      "i" '(:ignore t :which-key "import")
      "i o" '(lsp-rename :wk "optimize"))
    (lsp-mode-map
     :states '(normal)
     "gd" 'lsp-find-definition
     "gD" 'lsp-find-references)
    :init
    (setq lsp-restart 'ignore)
    (setq lsp-eldoc-enable-hover nil)
    (setq lsp-enable-file-watchers nil)
    (setq lsp-signature-auto-activate nil)
    :config
    (lsp-enable-which-key-integration t))

  (use-package lsp-ui
    :hook ((lsp-mode . lsp-ui-mode))
    :init
    (setq lsp-ui-doc-show-with-cursor nil)
    (setq lsp-ui-doc-show-with-mouse nil)
    )
#+END_SRC

