readme.html

<div id="outline-container-orgfcf8dab" class="outline-3">
<h3 id="orgfcf8dab"><span class="section-number-3">9.10</span> org-html-themify</h3>
<div class="outline-text-3" id="text-9-10">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #ffffff;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">use-package</span> <span style="color: var(--clr-constant); background-color: var(--bg-constant);">org-html-themify</span>
  <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:straight</span>
  <span style="color: #ff62d4;">(</span>org-html-themify
   <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:type</span> git
   <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:host</span> github
   <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:repo</span> <span style="color: var(--clr-string); background-color: var(--bg-string);">"DogLooksGood/org-html-themify"</span>
   <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:files</span> <span style="color: #3fdfd0;">(</span><span style="color: var(--clr-string); background-color: var(--bg-string);">"*.el"</span> <span style="color: var(--clr-string); background-color: var(--bg-string);">"*.js"</span> <span style="color: var(--clr-string); background-color: var(--bg-string);">"*.css"</span><span style="color: #3fdfd0;">)</span><span style="color: #ff62d4;">)</span>
  <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:hook</span> <span style="color: #ff62d4;">(</span>org-mode . org-html-themify-mode<span style="color: #ff62d4;">)</span>
  <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:init</span>
  <span style="color: #ff62d4;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">setq</span> org-html-themify-themes
   '<span style="color: #3fdfd0;">(</span><span style="color: #fba849;">(</span>dark . modus-vivendi<span style="color: #fba849;">)</span>
     <span style="color: #fba849;">(</span>light . modus-operandi<span style="color: #fba849;">)</span><span style="color: #3fdfd0;">)</span><span style="color: #ff62d4;">)</span><span style="color: #ffffff;">)</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org4eb8250" class="outline-2">
<h2 id="org4eb8250"><span class="section-number-2">10</span> Programming languages</h2>
<div class="outline-text-2" id="text-10">
</div>
<div id="outline-container-orgb676243" class="outline-3">
<h3 id="orgb676243"><span class="section-number-3">10.1</span> lsp mode</h3>
<div class="outline-text-3" id="text-10-1">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #ffffff;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">use-package</span> <span style="color: var(--clr-constant); background-color: var(--bg-constant);">lsp-mode</span>
  <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:commands</span> <span style="color: #ff62d4;">(</span>lsp lsp-deferred<span style="color: #ff62d4;">)</span>
  <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:hook</span> <span style="color: #ff62d4;">(</span>lsp-mode . <span style="color: #3fdfd0;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">lambda</span> <span style="color: #fba849;">()</span>
                      <span style="color: #fba849;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">setq-local</span> evil-lookup-func #'lsp-describe-thing-at-point<span style="color: #fba849;">)</span><span style="color: #3fdfd0;">)</span><span style="color: #ff62d4;">)</span>
  <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:general</span>
  <span style="color: #ff62d4;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">my/leader-keys</span>
    <span style="color: var(--clr-string); background-color: var(--bg-string);">"c"</span> '<span style="color: #3fdfd0;">(</span><span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:keymap</span> lsp-command-map<span style="color: #3fdfd0;">)</span><span style="color: #ff62d4;">)</span>
  <span style="color: #ff62d4;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">my/local-leader-keys</span>
    <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:keymaps</span> 'lsp-mode-map
    <span style="color: var(--clr-string); background-color: var(--bg-string);">"r"</span> '<span style="color: #3fdfd0;">(</span>lsp-rename <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:wk</span> <span style="color: var(--clr-string); background-color: var(--bg-string);">"rename"</span><span style="color: #3fdfd0;">)</span>
    <span style="color: var(--clr-string); background-color: var(--bg-string);">"i"</span> '<span style="color: #3fdfd0;">(</span><span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:ignore</span> t <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:which-key</span> <span style="color: var(--clr-string); background-color: var(--bg-string);">"import"</span><span style="color: #3fdfd0;">)</span>
    <span style="color: var(--clr-string); background-color: var(--bg-string);">"i o"</span> '<span style="color: #3fdfd0;">(</span>lsp-rename <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:wk</span> <span style="color: var(--clr-string); background-color: var(--bg-string);">"optimize"</span><span style="color: #3fdfd0;">)</span><span style="color: #ff62d4;">)</span>
  <span style="color: #ff62d4;">(</span>lsp-mode-map
   <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:states</span> '<span style="color: #3fdfd0;">(</span>normal<span style="color: #3fdfd0;">)</span>
   <span style="color: var(--clr-string); background-color: var(--bg-string);">"gd"</span> 'lsp-find-definition
   <span style="color: var(--clr-string); background-color: var(--bg-string);">"gD"</span> 'lsp-find-references<span style="color: #ff62d4;">)</span>
  <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:init</span>
  <span style="color: #ff62d4;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">setq</span> lsp-restart 'ignore<span style="color: #ff62d4;">)</span>
  <span style="color: #ff62d4;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">setq</span> lsp-eldoc-enable-hover nil<span style="color: #ff62d4;">)</span>
  <span style="color: #ff62d4;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">setq</span> lsp-enable-file-watchers nil<span style="color: #ff62d4;">)</span>
  <span style="color: #ff62d4;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">setq</span> lsp-signature-auto-activate nil<span style="color: #ff62d4;">)</span>
  <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:config</span>
  <span style="color: #ff62d4;">(</span>lsp-enable-which-key-integration t<span style="color: #ff62d4;">)</span><span style="color: #ffffff;">)</span>

<span style="color: #ffffff;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">use-package</span> <span style="color: var(--clr-constant); background-color: var(--bg-constant);">lsp-ui</span>
  <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:hook</span> <span style="color: #ff62d4;">(</span><span style="color: #3fdfd0;">(</span>lsp-mode . lsp-ui-mode<span style="color: #3fdfd0;">)</span><span style="color: #ff62d4;">)</span>
  <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:init</span>
  <span style="color: #ff62d4;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">setq</span> lsp-ui-doc-show-with-cursor nil<span style="color: #ff62d4;">)</span>
  <span style="color: #ff62d4;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">setq</span> lsp-ui-doc-show-with-mouse nil<span style="color: #ff62d4;">)</span>
  <span style="color: #ffffff;">)</span>
</pre>
</div>
</div>
</div>
