readme.org
** dap-mode
#+BEGIN_SRC emacs-lisp
  (use-package dap-mode
    :hook
    (dap-terminated . my/hide-debug-windows)
    :general
    (my/local-leader-keys
      :keymaps 'python-mode-map
      "d d" '(dap-debug :wk "debug")
      "d b" '(dap-breakpoint-toggle :wk "breakpoint")
      "d c" '(dap-continue :wk "continue")
      "d e" '(dap-eval-thing-at-point :wk "eval")
      "d i" '(dap-step-in :wk "step in")
      "d q" '(dap-disconnect :wk "quit")
      "d r" '(dap-ui-repl :wk "repl")
      "d h" '(dap-hydra :wk "hydra"))
    :init
    (setq dap-auto-configure-features '(locals repl))
    (setq dap-python-debugger 'debugpy)
    ;; show stdout
    (setq dap-auto-show-output t)
    (setq dap-output-window-max-height 50)
    (setq dap-output-window-min-height 50)
    ;; hide stdout window  when done
    (defun my/hide-debug-windows (session)
      "Hide debug windows when all debug sessions are dead."
      (unless (-filter 'dap--session-running (dap--get-sessions))
        (kill-buffer (dap--debug-session-output-buffer (dap--cur-session-or-die)))))
    (defun my/dap-python--executable-find (orig-fun &rest args)
      (executable-find "python"))
    :config
    ;; configure windows
    (require 'dap-ui)
    (setq dap-ui-buffer-configurations
          `((,dap-ui--locals-buffer . ((side . right) (slot . 1) (window-width . 0.50)))
            ;; (,dap-ui--breakpoints-buffer . ((side . left) (slot . 1) (window-width . ,treemacs-width)))
            ;; (,dap-ui--sessions-buffer . ((side . left) (slot . 2) (window-width . ,treemacs-width)))
            (,dap-ui--repl-buffer . ((side . right) (slot . 2) (window-width . 0.50)))))
    (dap-ui-mode 1)
    ;; python virtualenv
    (require 'dap-python)
    (advice-add 'dap-python--pyenv-executable-find :around #'my/dap-python--executable-find)
    ;; debug templates
    (defvar dap-script-args (list :type "python"
                                  :args []
                                  :cwd "${workspaceFolder}"
                                  :justMyCode :json-false
                                  :request "launch"
                                  :debugger 'debugpy
                                  :name "dap-debug-script"))
    (defvar dap-test-args (list :type "python-test-at-point"
                                :args ""
                                :justMyCode :json-false
                                ;; :cwd "${workspaceFolder}"
                                :request "launch"
                                :module "pytest"
                                :debugger 'debugpy
                                :name "dap-debug-test-at-point"))
    (defvar empties-forecast (list
                              :name "empties forecast"
                              :type "python"
                              :request "launch"
                              :program "./src/empties/forecasting/predict.py"
                              :env '(("NO_JSON_LOG" . "true"))
                              :args ["--source01" "./data/empties-history-sample.parquet"
                                     "--source02" "./data/model_selection.files"
                                     "--source03" "./data/booking-feature-sample.parquet"
                                     "--source04" "./data/holiday-2019-05-24-1558683595"
                                     "--output-data" "./data/predictions.parquet"
                                     "--output-metrics" "./data/metrics.json"]
                              ))
    (dap-register-debug-template "dap-debug-script" dap-script-args)
    (dap-register-debug-template "dap-debug-test-at-point" dap-test-args)
    ;; bind the templates
    (my/local-leader-keys
      :keymaps 'python-mode-map
      "d t" '((lambda () (interactive) (dap-debug dap-test-args)) :wk "test")
      "d s" '((lambda () (interactive) (dap-debug dap-script-args)) :wk "script")
      )
    )
#+END_SRC

