readme.html

<div id="outline-container-org97438c0" class="outline-3">
<h3 id="org97438c0"><span class="section-number-3">10.2</span> dap-mode</h3>
<div class="outline-text-3" id="text-10-2">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #ffffff;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">use-package</span> <span style="color: var(--clr-constant); background-color: var(--bg-constant);">dap-mode</span>
  <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:hook</span>
  <span style="color: #ff62d4;">(</span>dap-terminated . my/hide-debug-windows<span style="color: #ff62d4;">)</span>
  <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:general</span>
  <span style="color: #ff62d4;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">my/local-leader-keys</span>
    <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:keymaps</span> 'python-mode-map
    <span style="color: var(--clr-string); background-color: var(--bg-string);">"d d"</span> '<span style="color: #3fdfd0;">(</span>dap-debug <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:wk</span> <span style="color: var(--clr-string); background-color: var(--bg-string);">"debug"</span><span style="color: #3fdfd0;">)</span>
    <span style="color: var(--clr-string); background-color: var(--bg-string);">"d b"</span> '<span style="color: #3fdfd0;">(</span>dap-breakpoint-toggle <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:wk</span> <span style="color: var(--clr-string); background-color: var(--bg-string);">"breakpoint"</span><span style="color: #3fdfd0;">)</span>
    <span style="color: var(--clr-string); background-color: var(--bg-string);">"d c"</span> '<span style="color: #3fdfd0;">(</span>dap-continue <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:wk</span> <span style="color: var(--clr-string); background-color: var(--bg-string);">"continue"</span><span style="color: #3fdfd0;">)</span>
    <span style="color: var(--clr-string); background-color: var(--bg-string);">"d e"</span> '<span style="color: #3fdfd0;">(</span>dap-eval-thing-at-point <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:wk</span> <span style="color: var(--clr-string); background-color: var(--bg-string);">"eval"</span><span style="color: #3fdfd0;">)</span>
    <span style="color: var(--clr-string); background-color: var(--bg-string);">"d i"</span> '<span style="color: #3fdfd0;">(</span>dap-step-in <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:wk</span> <span style="color: var(--clr-string); background-color: var(--bg-string);">"step in"</span><span style="color: #3fdfd0;">)</span>
    <span style="color: var(--clr-string); background-color: var(--bg-string);">"d q"</span> '<span style="color: #3fdfd0;">(</span>dap-disconnect <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:wk</span> <span style="color: var(--clr-string); background-color: var(--bg-string);">"quit"</span><span style="color: #3fdfd0;">)</span>
    <span style="color: var(--clr-string); background-color: var(--bg-string);">"d r"</span> '<span style="color: #3fdfd0;">(</span>dap-ui-repl <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:wk</span> <span style="color: var(--clr-string); background-color: var(--bg-string);">"repl"</span><span style="color: #3fdfd0;">)</span>
    <span style="color: var(--clr-string); background-color: var(--bg-string);">"d h"</span> '<span style="color: #3fdfd0;">(</span>dap-hydra <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:wk</span> <span style="color: var(--clr-string); background-color: var(--bg-string);">"hydra"</span><span style="color: #3fdfd0;">)</span><span style="color: #ff62d4;">)</span>
  <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:init</span>
  <span style="color: #ff62d4;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">setq</span> dap-auto-configure-features '<span style="color: #3fdfd0;">(</span>locals repl<span style="color: #3fdfd0;">)</span><span style="color: #ff62d4;">)</span>
  <span style="color: #ff62d4;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">setq</span> dap-python-debugger 'debugpy<span style="color: #ff62d4;">)</span>
  <span style="color: var(--clr-comment-delimiter); background-color: var(--bg-comment-delimiter);">;; </span><span style="color: var(--clr-comment); background-color: var(--bg-comment);">show stdout</span>
  <span style="color: #ff62d4;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">setq</span> dap-auto-show-output t<span style="color: #ff62d4;">)</span>
  <span style="color: #ff62d4;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">setq</span> dap-output-window-max-height 50<span style="color: #ff62d4;">)</span>
  <span style="color: #ff62d4;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">setq</span> dap-output-window-min-height 50<span style="color: #ff62d4;">)</span>
  <span style="color: var(--clr-comment-delimiter); background-color: var(--bg-comment-delimiter);">;; </span><span style="color: var(--clr-comment); background-color: var(--bg-comment);">hide stdout window  when done</span>
  <span style="color: #ff62d4;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">defun</span> <span style="color: var(--function-clr-name); background-color: var(--function-bg-name);">my/hide-debug-windows</span> <span style="color: #3fdfd0;">(</span>session<span style="color: #3fdfd0;">)</span>
    <span style="color: var(--clr-doc); background-color: var(--bg-doc);">"Hide debug windows when all debug sessions are dead."</span>
    <span style="color: #3fdfd0;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">unless</span> <span style="color: #fba849;">(</span>-filter 'dap--session-running <span style="color: #9f80ff;">(</span>dap--get-sessions<span style="color: #9f80ff;">)</span><span style="color: #fba849;">)</span>
      <span style="color: #fba849;">(</span>kill-buffer <span style="color: #9f80ff;">(</span>dap--debug-session-output-buffer <span style="color: #4fe42f;">(</span>dap--cur-session-or-die<span style="color: #4fe42f;">)</span><span style="color: #9f80ff;">)</span><span style="color: #fba849;">)</span><span style="color: #3fdfd0;">)</span><span style="color: #ff62d4;">)</span>
  <span style="color: #ff62d4;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">defun</span> <span style="color: var(--function-clr-name); background-color: var(--function-bg-name);">my/dap-python--executable-find</span> <span style="color: #3fdfd0;">(</span>orig-fun <span style="color: #6ae4b9; font-weight: bold;">&amp;rest</span> args<span style="color: #3fdfd0;">)</span>
    <span style="color: #3fdfd0;">(</span>executable-find <span style="color: var(--clr-string); background-color: var(--bg-string);">"python"</span><span style="color: #3fdfd0;">)</span><span style="color: #ff62d4;">)</span>
  <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:config</span>
  <span style="color: var(--clr-comment-delimiter); background-color: var(--bg-comment-delimiter);">;; </span><span style="color: var(--clr-comment); background-color: var(--bg-comment);">configure windows</span>
  <span style="color: #ff62d4;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">require</span> '<span style="color: var(--clr-constant); background-color: var(--bg-constant);">dap-ui</span><span style="color: #ff62d4;">)</span>
  <span style="color: #ff62d4;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">setq</span> dap-ui-buffer-configurations
        `<span style="color: #3fdfd0;">(</span><span style="color: #fba849;">(</span>,dap-ui--locals-buffer . <span style="color: #9f80ff;">(</span><span style="color: #4fe42f;">(</span>side . right<span style="color: #4fe42f;">)</span> <span style="color: #4fe42f;">(</span>slot . 1<span style="color: #4fe42f;">)</span> <span style="color: #4fe42f;">(</span>window-width . 0.50<span style="color: #4fe42f;">)</span><span style="color: #9f80ff;">)</span><span style="color: #fba849;">)</span>
          <span style="color: var(--clr-comment-delimiter); background-color: var(--bg-comment-delimiter);">;; </span><span style="color: var(--clr-comment); background-color: var(--bg-comment);">(,dap-ui--breakpoints-buffer . ((side . left) (slot . 1) (window-width . ,treemacs-width)))</span>
          <span style="color: var(--clr-comment-delimiter); background-color: var(--bg-comment-delimiter);">;; </span><span style="color: var(--clr-comment); background-color: var(--bg-comment);">(,dap-ui--sessions-buffer . ((side . left) (slot . 2) (window-width . ,treemacs-width)))</span>
          <span style="color: #fba849;">(</span>,dap-ui--repl-buffer . <span style="color: #9f80ff;">(</span><span style="color: #4fe42f;">(</span>side . right<span style="color: #4fe42f;">)</span> <span style="color: #4fe42f;">(</span>slot . 2<span style="color: #4fe42f;">)</span> <span style="color: #4fe42f;">(</span>window-width . 0.50<span style="color: #4fe42f;">)</span><span style="color: #9f80ff;">)</span><span style="color: #fba849;">)</span><span style="color: #3fdfd0;">)</span><span style="color: #ff62d4;">)</span>
  <span style="color: #ff62d4;">(</span>dap-ui-mode 1<span style="color: #ff62d4;">)</span>
  <span style="color: var(--clr-comment-delimiter); background-color: var(--bg-comment-delimiter);">;; </span><span style="color: var(--clr-comment); background-color: var(--bg-comment);">python virtualenv</span>
  <span style="color: #ff62d4;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">require</span> '<span style="color: var(--clr-constant); background-color: var(--bg-constant);">dap-python</span><span style="color: #ff62d4;">)</span>
  <span style="color: #ff62d4;">(</span>advice-add 'dap-python--pyenv-executable-find <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:around</span> #'my/dap-python--executable-find<span style="color: #ff62d4;">)</span>
  <span style="color: var(--clr-comment-delimiter); background-color: var(--bg-comment-delimiter);">;; </span><span style="color: var(--clr-comment); background-color: var(--bg-comment);">debug templates</span>
  <span style="color: #ff62d4;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">defvar</span> <span style="color: var(--clr-variable); background-color: var(--bg-variable);">dap-script-args</span> <span style="color: #3fdfd0;">(</span>list <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:type</span> <span style="color: var(--clr-string); background-color: var(--bg-string);">"python"</span>
                                <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:args</span> <span style="color: #fba849;">[]</span>
                                <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:cwd</span> <span style="color: var(--clr-string); background-color: var(--bg-string);">"${workspaceFolder}"</span>
                                <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:justMyCode</span> <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:json-false</span>
                                <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:request</span> <span style="color: var(--clr-string); background-color: var(--bg-string);">"launch"</span>
                                <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:debugger</span> 'debugpy
                                <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:name</span> <span style="color: var(--clr-string); background-color: var(--bg-string);">"dap-debug-script"</span><span style="color: #3fdfd0;">)</span><span style="color: #ff62d4;">)</span>
  <span style="color: #ff62d4;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">defvar</span> <span style="color: var(--clr-variable); background-color: var(--bg-variable);">dap-test-args</span> <span style="color: #3fdfd0;">(</span>list <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:type</span> <span style="color: var(--clr-string); background-color: var(--bg-string);">"python-test-at-point"</span>
                              <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:args</span> <span style="color: var(--clr-string); background-color: var(--bg-string);">""</span>
                              <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:justMyCode</span> <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:json-false</span>
                              <span style="color: var(--clr-comment-delimiter); background-color: var(--bg-comment-delimiter);">;; </span><span style="color: var(--clr-comment); background-color: var(--bg-comment);">:cwd "${workspaceFolder}"</span>
                              <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:request</span> <span style="color: var(--clr-string); background-color: var(--bg-string);">"launch"</span>
                              <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:module</span> <span style="color: var(--clr-string); background-color: var(--bg-string);">"pytest"</span>
                              <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:debugger</span> 'debugpy
                              <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:name</span> <span style="color: var(--clr-string); background-color: var(--bg-string);">"dap-debug-test-at-point"</span><span style="color: #3fdfd0;">)</span><span style="color: #ff62d4;">)</span>
  <span style="color: #ff62d4;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">defvar</span> <span style="color: var(--clr-variable); background-color: var(--bg-variable);">empties-forecast</span> <span style="color: #3fdfd0;">(</span>list
                            <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:name</span> <span style="color: var(--clr-string); background-color: var(--bg-string);">"empties forecast"</span>
                            <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:type</span> <span style="color: var(--clr-string); background-color: var(--bg-string);">"python"</span>
                            <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:request</span> <span style="color: var(--clr-string); background-color: var(--bg-string);">"launch"</span>
                            <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:program</span> <span style="color: var(--clr-string); background-color: var(--bg-string);">"./src/empties/forecasting/predict.py"</span>
                            <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:env</span> '<span style="color: #fba849;">(</span><span style="color: #9f80ff;">(</span><span style="color: var(--clr-string); background-color: var(--bg-string);">"NO_JSON_LOG"</span> . <span style="color: var(--clr-string); background-color: var(--bg-string);">"true"</span><span style="color: #9f80ff;">)</span><span style="color: #fba849;">)</span>
                            <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:args</span> <span style="color: #fba849;">[</span><span style="color: var(--clr-string); background-color: var(--bg-string);">"--source01"</span> <span style="color: var(--clr-string); background-color: var(--bg-string);">"./data/empties-history-sample.parquet"</span>
                                   <span style="color: var(--clr-string); background-color: var(--bg-string);">"--source02"</span> <span style="color: var(--clr-string); background-color: var(--bg-string);">"./data/model_selection.files"</span>
                                   <span style="color: var(--clr-string); background-color: var(--bg-string);">"--source03"</span> <span style="color: var(--clr-string); background-color: var(--bg-string);">"./data/booking-feature-sample.parquet"</span>
                                   <span style="color: var(--clr-string); background-color: var(--bg-string);">"--source04"</span> <span style="color: var(--clr-string); background-color: var(--bg-string);">"./data/holiday-2019-05-24-1558683595"</span>
                                   <span style="color: var(--clr-string); background-color: var(--bg-string);">"--output-data"</span> <span style="color: var(--clr-string); background-color: var(--bg-string);">"./data/predictions.parquet"</span>
                                   <span style="color: var(--clr-string); background-color: var(--bg-string);">"--output-metrics"</span> <span style="color: var(--clr-string); background-color: var(--bg-string);">"./data/metrics.json"</span><span style="color: #fba849;">]</span>
                            <span style="color: #3fdfd0;">)</span><span style="color: #ff62d4;">)</span>
  <span style="color: #ff62d4;">(</span>dap-register-debug-template <span style="color: var(--clr-string); background-color: var(--bg-string);">"dap-debug-script"</span> dap-script-args<span style="color: #ff62d4;">)</span>
  <span style="color: #ff62d4;">(</span>dap-register-debug-template <span style="color: var(--clr-string); background-color: var(--bg-string);">"dap-debug-test-at-point"</span> dap-test-args<span style="color: #ff62d4;">)</span>
  <span style="color: var(--clr-comment-delimiter); background-color: var(--bg-comment-delimiter);">;; </span><span style="color: var(--clr-comment); background-color: var(--bg-comment);">bind the templates</span>
  <span style="color: #ff62d4;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">my/local-leader-keys</span>
    <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:keymaps</span> 'python-mode-map
    <span style="color: var(--clr-string); background-color: var(--bg-string);">"d t"</span> '<span style="color: #3fdfd0;">(</span><span style="color: #fba849;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">lambda</span> <span style="color: #9f80ff;">()</span> <span style="color: #9f80ff;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">interactive</span><span style="color: #9f80ff;">)</span> <span style="color: #9f80ff;">(</span>dap-debug dap-test-args<span style="color: #9f80ff;">)</span><span style="color: #fba849;">)</span> <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:wk</span> <span style="color: var(--clr-string); background-color: var(--bg-string);">"test"</span><span style="color: #3fdfd0;">)</span>
    <span style="color: var(--clr-string); background-color: var(--bg-string);">"d s"</span> '<span style="color: #3fdfd0;">(</span><span style="color: #fba849;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">lambda</span> <span style="color: #9f80ff;">()</span> <span style="color: #9f80ff;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">interactive</span><span style="color: #9f80ff;">)</span> <span style="color: #9f80ff;">(</span>dap-debug dap-script-args<span style="color: #9f80ff;">)</span><span style="color: #fba849;">)</span> <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:wk</span> <span style="color: var(--clr-string); background-color: var(--bg-string);">"script"</span><span style="color: #3fdfd0;">)</span>
    <span style="color: #ff62d4;">)</span>
  <span style="color: #ffffff;">)</span>
</pre>
</div>
</div>
</div>
