readme.org
** Python
*** python mode
#+BEGIN_SRC emacs-lisp
  (use-package python-mode
    ;; :init
    ;; (defun my/ipython-use-venv (orig-fun &rest args)
    ;;   (when (getenv "VIRTUAL_ENV")
    ;;     (when-let ((python-shell-interpreter (executable-find "ipython")))
    ;;       (apply orig-fun args)))
    ;;   (apply orig-fun args))
    ;; (advice-add 'run-python :around #'my/ipython-use-venv)
    :hook (envrc-mode . (lambda ()
                          (when (executable-find "ipython")
                            (setq python-shell-interpreter (executable-find "ipython")))))
    :config
    (setq python-shell-interpreter (executable-find "ipython")     ;; FIXME
          python-shell-interpreter-args "-i --simple-prompt --no-color-info"
          python-shell-prompt-regexp "In \\[[0-9]+\\]: "
          python-shell-prompt-block-regexp "\\.\\.\\.\\.: "
          python-shell-prompt-output-regexp "Out\\[[0-9]+\\]: "
          python-shell-completion-setup-code
          "from IPython.core.completerlib import module_completion"
          python-shell-completion-string-code
          "';'.join(get_ipython().Completer.all_completions('''%s'''))\n"))
#+END_SRC

*** lsp-pyright
Here the configuration options: https://github.com/emacs-lsp/lsp-pyright#configuration
#+BEGIN_SRC emacs-lisp
  (use-package lsp-pyright
    :init
    (setq lsp-pyright-typechecking-mode "basic") ;; too much noise in "real" projects
    :hook (python-mode . (lambda ()
                           (require 'lsp-pyright)
                           (lsp-deferred))))
#+END_SRC

*** pytest
#+begin_src emacs-lisp
  (use-package python-pytest
    :general
    (my/local-leader-keys
      :keymaps 'python-mode-map
      "t t" '(python-pytest-dispatch :wk "dispatch")
      "t d" '(python-pytest-function :wk "defun"))
    :init
    (setq python-pytest-arguments '("--color" "--failed-first"))
    (defun my/pytest-use-venv (orig-fun &rest args)
      (if-let ((python-pytest-executable (executable-find "pytest")))
          (apply orig-fun args)
        (apply orig-fun args)))
    :config
    (advice-add 'python-pytest--run :around #'my/pytest-use-venv)
    )
#+end_src

*** flymake 
#+begin_src emacs-lisp
  (use-package flymake
    :straight (:type built-in)
    :hook (emacs-lisp-mode . flymake-mode)
    :init
    (setq python-flymake-command (executable-find "flake8"))
    (setq flymake-fringe-indicator-position 'right-fringe)
    :general
    (general-nmap "] !" 'flymake-goto-next-error)
    (general-nmap "[ !" 'flymake-goto-prev-error)
    )
#+end_src

