readme.html

<div id="outline-container-org09ec5c2" class="outline-3">
<h3 id="org09ec5c2"><span class="section-number-3">10.3</span> Python</h3>
<div class="outline-text-3" id="text-10-3">
</div>
<div id="outline-container-orgcd37cf4" class="outline-4">
<h4 id="orgcd37cf4"><span class="section-number-4">10.3.1</span> python mode</h4>
<div class="outline-text-4" id="text-10-3-1">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #ffffff;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">use-package</span> <span style="color: var(--clr-constant); background-color: var(--bg-constant);">python-mode</span>
  <span style="color: var(--clr-comment-delimiter); background-color: var(--bg-comment-delimiter);">;; </span><span style="color: var(--clr-comment); background-color: var(--bg-comment);">:init</span>
  <span style="color: var(--clr-comment-delimiter); background-color: var(--bg-comment-delimiter);">;; </span><span style="color: var(--clr-comment); background-color: var(--bg-comment);">(defun my/ipython-use-venv (orig-fun &amp;rest args)</span>
  <span style="color: var(--clr-comment-delimiter); background-color: var(--bg-comment-delimiter);">;;   </span><span style="color: var(--clr-comment); background-color: var(--bg-comment);">(when (getenv "VIRTUAL_ENV")</span>
  <span style="color: var(--clr-comment-delimiter); background-color: var(--bg-comment-delimiter);">;;     </span><span style="color: var(--clr-comment); background-color: var(--bg-comment);">(when-let ((python-shell-interpreter (executable-find "ipython")))</span>
  <span style="color: var(--clr-comment-delimiter); background-color: var(--bg-comment-delimiter);">;;       </span><span style="color: var(--clr-comment); background-color: var(--bg-comment);">(apply orig-fun args)))</span>
  <span style="color: var(--clr-comment-delimiter); background-color: var(--bg-comment-delimiter);">;;   </span><span style="color: var(--clr-comment); background-color: var(--bg-comment);">(apply orig-fun args))</span>
  <span style="color: var(--clr-comment-delimiter); background-color: var(--bg-comment-delimiter);">;; </span><span style="color: var(--clr-comment); background-color: var(--bg-comment);">(advice-add 'run-python :around #'my/ipython-use-venv)</span>
  <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:hook</span> <span style="color: #ff62d4;">(</span>envrc-mode . <span style="color: #3fdfd0;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">lambda</span> <span style="color: #fba849;">()</span>
                        <span style="color: #fba849;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">when</span> <span style="color: #9f80ff;">(</span>executable-find <span style="color: var(--clr-string); background-color: var(--bg-string);">"ipython"</span><span style="color: #9f80ff;">)</span>
                          <span style="color: #9f80ff;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">setq</span> python-shell-interpreter <span style="color: #4fe42f;">(</span>executable-find <span style="color: var(--clr-string); background-color: var(--bg-string);">"ipython"</span><span style="color: #4fe42f;">)</span><span style="color: #9f80ff;">)</span><span style="color: #fba849;">)</span><span style="color: #3fdfd0;">)</span><span style="color: #ff62d4;">)</span>
  <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:config</span>
  <span style="color: #ff62d4;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">setq</span> python-shell-interpreter <span style="color: #3fdfd0;">(</span>executable-find <span style="color: var(--clr-string); background-color: var(--bg-string);">"ipython"</span><span style="color: #3fdfd0;">)</span>     <span style="color: var(--clr-comment-delimiter); background-color: var(--bg-comment-delimiter);">;; </span><span style="color: #ff9977;">FIXME</span>
        python-shell-interpreter-args <span style="color: var(--clr-string); background-color: var(--bg-string);">"-i --simple-prompt --no-color-info"</span>
        python-shell-prompt-regexp <span style="color: var(--clr-string); background-color: var(--bg-string);">"In \\[[0-9]+\\]: "</span>
        python-shell-prompt-block-regexp <span style="color: var(--clr-string); background-color: var(--bg-string);">"\\.\\.\\.\\.: "</span>
        python-shell-prompt-output-regexp <span style="color: var(--clr-string); background-color: var(--bg-string);">"Out\\[[0-9]+\\]: "</span>
        python-shell-completion-setup-code
        <span style="color: var(--clr-string); background-color: var(--bg-string);">"from IPython.core.completerlib import module_completion"</span>
        python-shell-completion-string-code
        <span style="color: var(--clr-string); background-color: var(--bg-string);">"';'.join(get_ipython().Completer.all_completions('''%s'''))\n"</span><span style="color: #ff62d4;">)</span><span style="color: #ffffff;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orged19ee5" class="outline-4">
<h4 id="orged19ee5"><span class="section-number-4">10.3.2</span> lsp-pyright</h4>
<div class="outline-text-4" id="text-10-3-2">
<p>
Here the configuration options: <a href="https://github.com/emacs-lsp/lsp-pyright#configuration">https://github.com/emacs-lsp/lsp-pyright#configuration</a>
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #ffffff;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">use-package</span> <span style="color: var(--clr-constant); background-color: var(--bg-constant);">lsp-pyright</span>
  <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:init</span>
  <span style="color: #ff62d4;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">setq</span> lsp-pyright-typechecking-mode <span style="color: var(--clr-string); background-color: var(--bg-string);">"basic"</span><span style="color: #ff62d4;">)</span> <span style="color: var(--clr-comment-delimiter); background-color: var(--bg-comment-delimiter);">;; </span><span style="color: var(--clr-comment); background-color: var(--bg-comment);">too much noise in "real" projects</span>
  <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:hook</span> <span style="color: #ff62d4;">(</span>python-mode . <span style="color: #3fdfd0;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">lambda</span> <span style="color: #fba849;">()</span>
                         <span style="color: #fba849;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">require</span> '<span style="color: var(--clr-constant); background-color: var(--bg-constant);">lsp-pyright</span><span style="color: #fba849;">)</span>
                         <span style="color: #fba849;">(</span>lsp-deferred<span style="color: #fba849;">)</span><span style="color: #3fdfd0;">)</span><span style="color: #ff62d4;">)</span><span style="color: #ffffff;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgacbcf93" class="outline-4">
<h4 id="orgacbcf93"><span class="section-number-4">10.3.3</span> pytest</h4>
<div class="outline-text-4" id="text-10-3-3">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #ffffff;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">use-package</span> <span style="color: var(--clr-constant); background-color: var(--bg-constant);">python-pytest</span>
  <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:general</span>
  <span style="color: #ff62d4;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">my/local-leader-keys</span>
    <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:keymaps</span> 'python-mode-map
    <span style="color: var(--clr-string); background-color: var(--bg-string);">"t t"</span> '<span style="color: #3fdfd0;">(</span>python-pytest-dispatch <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:wk</span> <span style="color: var(--clr-string); background-color: var(--bg-string);">"dispatch"</span><span style="color: #3fdfd0;">)</span>
    <span style="color: var(--clr-string); background-color: var(--bg-string);">"t d"</span> '<span style="color: #3fdfd0;">(</span>python-pytest-function <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:wk</span> <span style="color: var(--clr-string); background-color: var(--bg-string);">"defun"</span><span style="color: #3fdfd0;">)</span><span style="color: #ff62d4;">)</span>
  <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:init</span>
  <span style="color: #ff62d4;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">setq</span> python-pytest-arguments '<span style="color: #3fdfd0;">(</span><span style="color: var(--clr-string); background-color: var(--bg-string);">"--color"</span> <span style="color: var(--clr-string); background-color: var(--bg-string);">"--failed-first"</span><span style="color: #3fdfd0;">)</span><span style="color: #ff62d4;">)</span>
  <span style="color: #ff62d4;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">defun</span> <span style="color: var(--function-clr-name); background-color: var(--function-bg-name);">my/pytest-use-venv</span> <span style="color: #3fdfd0;">(</span>orig-fun <span style="color: #6ae4b9; font-weight: bold;">&amp;rest</span> args<span style="color: #3fdfd0;">)</span>
    <span style="color: #3fdfd0;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">if-let</span> <span style="color: #fba849;">(</span><span style="color: #9f80ff;">(</span>python-pytest-executable <span style="color: #4fe42f;">(</span>executable-find <span style="color: var(--clr-string); background-color: var(--bg-string);">"pytest"</span><span style="color: #4fe42f;">)</span><span style="color: #9f80ff;">)</span><span style="color: #fba849;">)</span>
        <span style="color: #fba849;">(</span>apply orig-fun args<span style="color: #fba849;">)</span>
      <span style="color: #fba849;">(</span>apply orig-fun args<span style="color: #fba849;">)</span><span style="color: #3fdfd0;">)</span><span style="color: #ff62d4;">)</span>
  <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:config</span>
  <span style="color: #ff62d4;">(</span>advice-add 'python-pytest--run <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:around</span> #'my/pytest-use-venv<span style="color: #ff62d4;">)</span>
  <span style="color: #ffffff;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgb25f5b2" class="outline-4">
<h4 id="orgb25f5b2"><span class="section-number-4">10.3.4</span> flymake</h4>
<div class="outline-text-4" id="text-10-3-4">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #ffffff;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">use-package</span> <span style="color: var(--clr-constant); background-color: var(--bg-constant);">flymake</span>
  <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:straight</span> <span style="color: #ff62d4;">(</span><span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:type</span> built-in<span style="color: #ff62d4;">)</span>
  <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:hook</span> <span style="color: #ff62d4;">(</span>emacs-lisp-mode . flymake-mode<span style="color: #ff62d4;">)</span>
  <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:init</span>
  <span style="color: #ff62d4;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">setq</span> python-flymake-command <span style="color: #3fdfd0;">(</span>executable-find <span style="color: var(--clr-string); background-color: var(--bg-string);">"flake8"</span><span style="color: #3fdfd0;">)</span><span style="color: #ff62d4;">)</span>
  <span style="color: #ff62d4;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">setq</span> flymake-fringe-indicator-position 'right-fringe<span style="color: #ff62d4;">)</span>
  <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:general</span>
  <span style="color: #ff62d4;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">general-nmap</span> <span style="color: var(--clr-string); background-color: var(--bg-string);">"] !"</span> 'flymake-goto-next-error<span style="color: #ff62d4;">)</span>
  <span style="color: #ff62d4;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">general-nmap</span> <span style="color: var(--clr-string); background-color: var(--bg-string);">"[ !"</span> 'flymake-goto-prev-error<span style="color: #ff62d4;">)</span>
  <span style="color: #ffffff;">)</span>
</pre>
</div>
</div>
</div>
