readme.org
*** jupyter
#+begin_src emacs-lisp
  (use-package jupyter
    :straight (:no-native-compile t :no-byte-compile t) ;; otherwise we get jupyter-channel void
    :general
    (my/local-leader-keys
      :keymaps 'python-mode-map
      "'" '(my/jupyter-repl :wk "jupyter REPL")
      "e e" '(jupyter-eval-line-or-region :wk "line")
      "e d" '(jupyter-eval-defun :wk "defun")
      "e b" '((call-interactively 'my/jupyter-eval-buffer) :wk "buffer"))
    (my/local-leader-keys
      :keymaps 'jupyter-repl-interaction-mode-map
      "k r" '(jupyter-repl-restart-kernel :wk "restart kernel"))
    :init
    (setq jupyter-repl-prompt-margin-width 4)
    (defun jupyter-command-venv (&rest args)
      "This overrides jupyter-command to use the virtualenv's jupyter"
      (let ((jupyter-executable (executable-find "jupyter")))
        (with-temp-buffer
          (when (zerop (apply #'process-file jupyter-executable nil t nil args))
            (string-trim-right (buffer-string))))))
    (defun my/jupyter-eval-buffer ()
      "Send the contents of BUFFER using `jupyter-current-client'."
      (interactive)
      (jupyter-eval-string (jupyter-load-file-code (buffer-file-name))))
    (defun my/jupyter-repl ()
      "If a buffer is already associated with a jupyter buffer, then pop to it. Otherwise start a jupyter kernel."
      (interactive)
      (if (bound-and-true-p jupyter-current-client)
          (jupyter-repl-pop-to-buffer)
        (call-interactively 'jupyter-repl-associate-buffer)))
    (advice-add 'jupyter-command :override #'jupyter-command-venv))
#+end_src

*** auto-import
#+begin_src emacs-lisp
  (use-package pyimport
    :general
    (my/local-leader-keys
      :keymaps 'python-mode-map
      "i i" '(pyimport-insert-missing :wk "autoimport")))
#+end_src

** R
*** ess
#+begin_src emacs-lisp
    (use-package ess
    :init
  (setq ess-eval-visibly 'nowait)
(setq ess-R-font-lock-keywords '((ess-R-fl-keyword:keywords . t)
                                   (ess-R-fl-keyword:constants . t)
                                   (ess-R-fl-keyword:modifiers . t)
                                   (ess-R-fl-keyword:fun-defs . t)
                                   (ess-R-fl-keyword:assign-ops . t)
                                   (ess-R-fl-keyword:%op% . t)
                                   (ess-fl-keyword:fun-calls . t)
                                   (ess-fl-keyword:numbers . t)
                                   (ess-fl-keyword:operators . t)
                                   (ess-fl-keyword:delimiters . t)
                                   (ess-fl-keyword:= . t)
                                   (ess-R-fl-keyword:F&T . t)))
      )
    
#+end_src

** emacs-lisp
