readme.html

<div id="outline-container-org430d114" class="outline-4">
<h4 id="org430d114"><span class="section-number-4">10.3.5</span> jupyter</h4>
<div class="outline-text-4" id="text-10-3-5">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #ffffff;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">use-package</span> <span style="color: var(--clr-constant); background-color: var(--bg-constant);">jupyter</span>
  <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:straight</span> <span style="color: #ff62d4;">(</span><span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:no-native-compile</span> t <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:no-byte-compile</span> t<span style="color: #ff62d4;">)</span> <span style="color: var(--clr-comment-delimiter); background-color: var(--bg-comment-delimiter);">;; </span><span style="color: var(--clr-comment); background-color: var(--bg-comment);">otherwise we get jupyter-channel void</span>
  <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:general</span>
  <span style="color: #ff62d4;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">my/local-leader-keys</span>
    <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:keymaps</span> 'python-mode-map
    <span style="color: var(--clr-string); background-color: var(--bg-string);">"'"</span> '<span style="color: #3fdfd0;">(</span>my/jupyter-repl <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:wk</span> <span style="color: var(--clr-string); background-color: var(--bg-string);">"jupyter REPL"</span><span style="color: #3fdfd0;">)</span>
    <span style="color: var(--clr-string); background-color: var(--bg-string);">"e e"</span> '<span style="color: #3fdfd0;">(</span>jupyter-eval-line-or-region <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:wk</span> <span style="color: var(--clr-string); background-color: var(--bg-string);">"line"</span><span style="color: #3fdfd0;">)</span>
    <span style="color: var(--clr-string); background-color: var(--bg-string);">"e d"</span> '<span style="color: #3fdfd0;">(</span>jupyter-eval-defun <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:wk</span> <span style="color: var(--clr-string); background-color: var(--bg-string);">"defun"</span><span style="color: #3fdfd0;">)</span>
    <span style="color: var(--clr-string); background-color: var(--bg-string);">"e b"</span> '<span style="color: #3fdfd0;">(</span><span style="color: #fba849;">(</span>call-interactively 'my/jupyter-eval-buffer<span style="color: #fba849;">)</span> <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:wk</span> <span style="color: var(--clr-string); background-color: var(--bg-string);">"buffer"</span><span style="color: #3fdfd0;">)</span><span style="color: #ff62d4;">)</span>
  <span style="color: #ff62d4;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">my/local-leader-keys</span>
    <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:keymaps</span> 'jupyter-repl-interaction-mode-map
    <span style="color: var(--clr-string); background-color: var(--bg-string);">"k r"</span> '<span style="color: #3fdfd0;">(</span>jupyter-repl-restart-kernel <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:wk</span> <span style="color: var(--clr-string); background-color: var(--bg-string);">"restart kernel"</span><span style="color: #3fdfd0;">)</span><span style="color: #ff62d4;">)</span>
  <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:init</span>
  <span style="color: #ff62d4;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">setq</span> jupyter-repl-prompt-margin-width 4<span style="color: #ff62d4;">)</span>
  <span style="color: #ff62d4;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">defun</span> <span style="color: var(--function-clr-name); background-color: var(--function-bg-name);">jupyter-command-venv</span> <span style="color: #3fdfd0;">(</span><span style="color: #6ae4b9; font-weight: bold;">&amp;rest</span> args<span style="color: #3fdfd0;">)</span>
    <span style="color: var(--clr-doc); background-color: var(--bg-doc);">"This overrides jupyter-command to use the virtualenv's jupyter"</span>
    <span style="color: #3fdfd0;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">let</span> <span style="color: #fba849;">(</span><span style="color: #9f80ff;">(</span>jupyter-executable <span style="color: #4fe42f;">(</span>executable-find <span style="color: var(--clr-string); background-color: var(--bg-string);">"jupyter"</span><span style="color: #4fe42f;">)</span><span style="color: #9f80ff;">)</span><span style="color: #fba849;">)</span>
      <span style="color: #fba849;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">with-temp-buffer</span>
        <span style="color: #9f80ff;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">when</span> <span style="color: #4fe42f;">(</span>zerop <span style="color: #fe6060;">(</span>apply #'process-file jupyter-executable nil t nil args<span style="color: #fe6060;">)</span><span style="color: #4fe42f;">)</span>
          <span style="color: #4fe42f;">(</span>string-trim-right <span style="color: #fe6060;">(</span>buffer-string<span style="color: #fe6060;">)</span><span style="color: #4fe42f;">)</span><span style="color: #9f80ff;">)</span><span style="color: #fba849;">)</span><span style="color: #3fdfd0;">)</span><span style="color: #ff62d4;">)</span>
  <span style="color: #ff62d4;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">defun</span> <span style="color: var(--function-clr-name); background-color: var(--function-bg-name);">my/jupyter-eval-buffer</span> <span style="color: #3fdfd0;">()</span>
    <span style="color: var(--clr-doc); background-color: var(--bg-doc);">"Send the contents of BUFFER using `</span><span style="color: var(--clr-constant); background-color: var(--bg-constant);">jupyter-current-client</span><span style="color: var(--clr-doc); background-color: var(--bg-doc);">'."</span>
    <span style="color: #3fdfd0;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">interactive</span><span style="color: #3fdfd0;">)</span>
    <span style="color: #3fdfd0;">(</span>jupyter-eval-string <span style="color: #fba849;">(</span>jupyter-load-file-code <span style="color: #9f80ff;">(</span>buffer-file-name<span style="color: #9f80ff;">)</span><span style="color: #fba849;">)</span><span style="color: #3fdfd0;">)</span><span style="color: #ff62d4;">)</span>
  <span style="color: #ff62d4;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">defun</span> <span style="color: var(--function-clr-name); background-color: var(--function-bg-name);">my/jupyter-repl</span> <span style="color: #3fdfd0;">()</span>
    <span style="color: var(--clr-doc); background-color: var(--bg-doc);">"If a buffer is already associated with a jupyter buffer, then pop to it. Otherwise start a jupyter kernel."</span>
    <span style="color: #3fdfd0;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">interactive</span><span style="color: #3fdfd0;">)</span>
    <span style="color: #3fdfd0;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">if</span> <span style="color: #fba849;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">bound-and-true-p</span> jupyter-current-client<span style="color: #fba849;">)</span>
        <span style="color: #fba849;">(</span>jupyter-repl-pop-to-buffer<span style="color: #fba849;">)</span>
      <span style="color: #fba849;">(</span>call-interactively 'jupyter-repl-associate-buffer<span style="color: #fba849;">)</span><span style="color: #3fdfd0;">)</span><span style="color: #ff62d4;">)</span>
  <span style="color: #ff62d4;">(</span>advice-add 'jupyter-command <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:override</span> #'jupyter-command-venv<span style="color: #ff62d4;">)</span><span style="color: #ffffff;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgc9ad385" class="outline-4">
<h4 id="orgc9ad385"><span class="section-number-4">10.3.6</span> auto-import</h4>
<div class="outline-text-4" id="text-10-3-6">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #ffffff;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">use-package</span> <span style="color: var(--clr-constant); background-color: var(--bg-constant);">pyimport</span>
  <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:general</span>
  <span style="color: #ff62d4;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">my/local-leader-keys</span>
    <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:keymaps</span> 'python-mode-map
    <span style="color: var(--clr-string); background-color: var(--bg-string);">"i i"</span> '<span style="color: #3fdfd0;">(</span>pyimport-insert-missing <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:wk</span> <span style="color: var(--clr-string); background-color: var(--bg-string);">"autoimport"</span><span style="color: #3fdfd0;">)</span><span style="color: #ff62d4;">)</span><span style="color: #ffffff;">)</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org3f5607f" class="outline-3">
<h3 id="org3f5607f"><span class="section-number-3">10.4</span> R</h3>
<div class="outline-text-3" id="text-10-4">
</div>
<div id="outline-container-org322e435" class="outline-4">
<h4 id="org322e435"><span class="section-number-4">10.4.1</span> ess</h4>
<div class="outline-text-4" id="text-10-4-1">
<div class="org-src-container">
<pre class="src src-emacs-lisp">    <span style="color: #ffffff;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">use-package</span> <span style="color: var(--clr-constant); background-color: var(--bg-constant);">ess</span>
    <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:init</span>
  <span style="color: #ff62d4;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">setq</span> ess-eval-visibly 'nowait<span style="color: #ff62d4;">)</span>
<span style="color: #ff62d4;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">setq</span> ess-R-font-lock-keywords '<span style="color: #3fdfd0;">(</span><span style="color: #fba849;">(</span>ess-R-fl-keyword:keywords . t<span style="color: #fba849;">)</span>
                                   <span style="color: #fba849;">(</span>ess-R-fl-keyword:constants . t<span style="color: #fba849;">)</span>
                                   <span style="color: #fba849;">(</span>ess-R-fl-keyword:modifiers . t<span style="color: #fba849;">)</span>
                                   <span style="color: #fba849;">(</span>ess-R-fl-keyword:fun-defs . t<span style="color: #fba849;">)</span>
                                   <span style="color: #fba849;">(</span>ess-R-fl-keyword:assign-ops . t<span style="color: #fba849;">)</span>
                                   <span style="color: #fba849;">(</span>ess-R-fl-keyword:%op% . t<span style="color: #fba849;">)</span>
                                   <span style="color: #fba849;">(</span>ess-fl-keyword:fun-calls . t<span style="color: #fba849;">)</span>
                                   <span style="color: #fba849;">(</span>ess-fl-keyword:numbers . t<span style="color: #fba849;">)</span>
                                   <span style="color: #fba849;">(</span>ess-fl-keyword:operators . t<span style="color: #fba849;">)</span>
                                   <span style="color: #fba849;">(</span>ess-fl-keyword:delimiters . t<span style="color: #fba849;">)</span>
                                   <span style="color: #fba849;">(</span>ess-fl-keyword:= . t<span style="color: #fba849;">)</span>
                                   <span style="color: #fba849;">(</span>ess-R-fl-keyword:F&amp;T . t<span style="color: #fba849;">)</span><span style="color: #3fdfd0;">)</span><span style="color: #ff62d4;">)</span>
      <span style="color: #ffffff;">)</span>

</pre>
</div>
</div>
</div>
</div>
