readme.org
*** elisp-mode
#+begin_src emacs-lisp
  (use-package elisp-mode
    :straight (:type built-in)
    :general
    (my/local-leader-keys
      :keymaps '(org-mode-map emacs-lisp-mode-map lisp-interaction-mode-map)
      "e l" '(eval-last-sexp :wk "last sexp")
      ;; "e" '(eval-last-sexp :states 'visual :wk "sexp")
      )
    (my/local-leader-keys
      :keymaps '(org-mode-map emacs-lisp-mode-map lisp-interaction-mode-map)
      :states 'visual
      "e" '(eval-last-sexp :wk "sexp"))
    )
#+end_src

*** evil-lisp state
#+begin_src emacs-lisp
  (use-package evil-lisp-state
    :after evil
    :demand
    :init
    ;; (setq evil-lisp-state-enter-lisp-state-on-command nil)
    (setq evil-lisp-state-global t)
    (setq evil-lisp-state-major-modes '(emacs-lisp-mode clojure-mode))
    :config
    (evil-lisp-state-leader "SPC l")
    )

#+end_src

** Nix
*** nix mode
#+begin_src emacs-lisp
(use-package nix-mode
:commands (nix-mode) ;;FIXME
:mode "\\.nix\\'")
#+end_src

** Clojure
*** Clojure mode
#+begin_src emacs-lisp
  (use-package clojure-mode
    :mode "\\.clj$"
    :init
    (setq clojure-align-forms-automatically t))
#+end_src

*** Cider
#+begin_src emacs-lisp
  (use-package cider
    :hook ((cider-repl-mode . evil-normalize-keymaps)
           (cider-mode . eldoc-mode))
    :general
    (my/local-leader-keys
      :keymaps 'clojure-mode-map
      "'" '(cider-jack-in :wk "jack in")
      "e l" 'cider-eval-last-sexp
      "e E" 'cider-pprint-eval-last-sexp-to-comment
      "e d" '(cider-eval-defun-at-point :wk "defun")
      "e D" 'cider-pprint-eval-defun-to-comment)
    (my/local-leader-keys
      :keymaps 'clojure-mode-map
      :states 'visual
      "e" 'cider-eval-region)
    :init
    (setq nrepl-hide-special-buffers t)
    (setq nrepl-sync-request-timeout nil)
    )
#+end_src

*** ob-clojure
#+begin_src emacs-lisp
(use-package org
:config
(require 'ob-clojure)
(setq org-babel-clojure-backend 'cider))
#+end_src

