readme.html

<div id="outline-container-orgf511180" class="outline-3">
<h3 id="orgf511180"><span class="section-number-3">10.5</span> emacs-lisp</h3>
<div class="outline-text-3" id="text-10-5">
</div>
<div id="outline-container-org383c154" class="outline-4">
<h4 id="org383c154"><span class="section-number-4">10.5.1</span> elisp-mode</h4>
<div class="outline-text-4" id="text-10-5-1">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #ffffff;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">use-package</span> <span style="color: var(--clr-constant); background-color: var(--bg-constant);">elisp-mode</span>
  <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:straight</span> <span style="color: #ff62d4;">(</span><span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:type</span> built-in<span style="color: #ff62d4;">)</span>
  <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:general</span>
  <span style="color: #ff62d4;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">my/local-leader-keys</span>
    <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:keymaps</span> '<span style="color: #3fdfd0;">(</span>org-mode-map emacs-lisp-mode-map lisp-interaction-mode-map<span style="color: #3fdfd0;">)</span>
    <span style="color: var(--clr-string); background-color: var(--bg-string);">"e l"</span> '<span style="color: #3fdfd0;">(</span>eval-last-sexp <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:wk</span> <span style="color: var(--clr-string); background-color: var(--bg-string);">"last sexp"</span><span style="color: #3fdfd0;">)</span>
    <span style="color: var(--clr-comment-delimiter); background-color: var(--bg-comment-delimiter);">;; </span><span style="color: var(--clr-comment); background-color: var(--bg-comment);">"e" '(eval-last-sexp :states 'visual :wk "sexp")</span>
    <span style="color: #ff62d4;">)</span>
  <span style="color: #ff62d4;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">my/local-leader-keys</span>
    <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:keymaps</span> '<span style="color: #3fdfd0;">(</span>org-mode-map emacs-lisp-mode-map lisp-interaction-mode-map<span style="color: #3fdfd0;">)</span>
    <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:states</span> 'visual
    <span style="color: var(--clr-string); background-color: var(--bg-string);">"e"</span> '<span style="color: #3fdfd0;">(</span>eval-last-sexp <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:wk</span> <span style="color: var(--clr-string); background-color: var(--bg-string);">"sexp"</span><span style="color: #3fdfd0;">)</span><span style="color: #ff62d4;">)</span>
  <span style="color: #ffffff;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org31456d0" class="outline-4">
<h4 id="org31456d0"><span class="section-number-4">10.5.2</span> evil-lisp state</h4>
<div class="outline-text-4" id="text-10-5-2">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #ffffff;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">use-package</span> <span style="color: var(--clr-constant); background-color: var(--bg-constant);">evil-lisp-state</span>
  <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:after</span> evil
  <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:demand</span>
  <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:init</span>
  <span style="color: var(--clr-comment-delimiter); background-color: var(--bg-comment-delimiter);">;; </span><span style="color: var(--clr-comment); background-color: var(--bg-comment);">(setq evil-lisp-state-enter-lisp-state-on-command nil)</span>
  <span style="color: #ff62d4;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">setq</span> evil-lisp-state-global t<span style="color: #ff62d4;">)</span>
  <span style="color: #ff62d4;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">setq</span> evil-lisp-state-major-modes '<span style="color: #3fdfd0;">(</span>emacs-lisp-mode clojure-mode<span style="color: #3fdfd0;">)</span><span style="color: #ff62d4;">)</span>
  <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:config</span>
  <span style="color: #ff62d4;">(</span>evil-lisp-state-leader <span style="color: var(--clr-string); background-color: var(--bg-string);">"SPC l"</span><span style="color: #ff62d4;">)</span>
  <span style="color: #ffffff;">)</span>

</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org763f646" class="outline-3">
<h3 id="org763f646"><span class="section-number-3">10.6</span> Nix</h3>
<div class="outline-text-3" id="text-10-6">
</div>
<div id="outline-container-org644e335" class="outline-4">
<h4 id="org644e335"><span class="section-number-4">10.6.1</span> nix mode</h4>
<div class="outline-text-4" id="text-10-6-1">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #ffffff;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">use-package</span> <span style="color: var(--clr-constant); background-color: var(--bg-constant);">nix-mode</span>
<span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:commands</span> <span style="color: #ff62d4;">(</span>nix-mode<span style="color: #ff62d4;">)</span> <span style="color: var(--clr-comment-delimiter); background-color: var(--bg-comment-delimiter);">;;</span><span style="color: #ff9977;">FIXME</span>
<span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:mode</span> <span style="color: var(--clr-string); background-color: var(--bg-string);">"\\.nix\\'"</span><span style="color: #ffffff;">)</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org3b45733" class="outline-3">
<h3 id="org3b45733"><span class="section-number-3">10.7</span> Clojure</h3>
<div class="outline-text-3" id="text-10-7">
</div>
<div id="outline-container-org2d58209" class="outline-4">
<h4 id="org2d58209"><span class="section-number-4">10.7.1</span> Clojure mode</h4>
<div class="outline-text-4" id="text-10-7-1">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #ffffff;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">use-package</span> <span style="color: var(--clr-constant); background-color: var(--bg-constant);">clojure-mode</span>
  <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:mode</span> <span style="color: var(--clr-string); background-color: var(--bg-string);">"\\.clj$"</span>
  <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:init</span>
  <span style="color: #ff62d4;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">setq</span> clojure-align-forms-automatically t<span style="color: #ff62d4;">)</span><span style="color: #ffffff;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgce4137c" class="outline-4">
<h4 id="orgce4137c"><span class="section-number-4">10.7.2</span> Cider</h4>
<div class="outline-text-4" id="text-10-7-2">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #ffffff;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">use-package</span> <span style="color: var(--clr-constant); background-color: var(--bg-constant);">cider</span>
  <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:hook</span> <span style="color: #ff62d4;">(</span><span style="color: #3fdfd0;">(</span>cider-repl-mode . evil-normalize-keymaps<span style="color: #3fdfd0;">)</span>
         <span style="color: #3fdfd0;">(</span>cider-mode . eldoc-mode<span style="color: #3fdfd0;">)</span><span style="color: #ff62d4;">)</span>
  <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:general</span>
  <span style="color: #ff62d4;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">my/local-leader-keys</span>
    <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:keymaps</span> 'clojure-mode-map
    <span style="color: var(--clr-string); background-color: var(--bg-string);">"'"</span> '<span style="color: #3fdfd0;">(</span>cider-jack-in <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:wk</span> <span style="color: var(--clr-string); background-color: var(--bg-string);">"jack in"</span><span style="color: #3fdfd0;">)</span>
    <span style="color: var(--clr-string); background-color: var(--bg-string);">"e l"</span> 'cider-eval-last-sexp
    <span style="color: var(--clr-string); background-color: var(--bg-string);">"e E"</span> 'cider-pprint-eval-last-sexp-to-comment
    <span style="color: var(--clr-string); background-color: var(--bg-string);">"e d"</span> '<span style="color: #3fdfd0;">(</span>cider-eval-defun-at-point <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:wk</span> <span style="color: var(--clr-string); background-color: var(--bg-string);">"defun"</span><span style="color: #3fdfd0;">)</span>
    <span style="color: var(--clr-string); background-color: var(--bg-string);">"e D"</span> 'cider-pprint-eval-defun-to-comment<span style="color: #ff62d4;">)</span>
  <span style="color: #ff62d4;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">my/local-leader-keys</span>
    <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:keymaps</span> 'clojure-mode-map
    <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:states</span> 'visual
    <span style="color: var(--clr-string); background-color: var(--bg-string);">"e"</span> 'cider-eval-region<span style="color: #ff62d4;">)</span>
  <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:init</span>
  <span style="color: #ff62d4;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">setq</span> nrepl-hide-special-buffers t<span style="color: #ff62d4;">)</span>
  <span style="color: #ff62d4;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">setq</span> nrepl-sync-request-timeout nil<span style="color: #ff62d4;">)</span>
  <span style="color: #ffffff;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org9b429e7" class="outline-4">
<h4 id="org9b429e7"><span class="section-number-4">10.7.3</span> ob-clojure</h4>
<div class="outline-text-4" id="text-10-7-3">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #ffffff;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">use-package</span> <span style="color: var(--clr-constant); background-color: var(--bg-constant);">org</span>
<span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:config</span>
<span style="color: #ff62d4;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">require</span> '<span style="color: var(--clr-constant); background-color: var(--bg-constant);">ob-clojure</span><span style="color: #ff62d4;">)</span>
<span style="color: #ff62d4;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">setq</span> org-babel-clojure-backend 'cider<span style="color: #ff62d4;">)</span><span style="color: #ffffff;">)</span>
</pre>
</div>
</div>
</div>
