readme.org
*** evil-cleverparens
This package provides additional text objects for LISPs.
For example, you can mark the outer form with =v a d=.
#+begin_src emacs-lisp
  (use-package evil-cleverparens
    :hook
    ((emacs-lisp-mode . evil-cleverparens-mode)
     (clojure-mode . evil-cleverparens-mode))
    :init
    (setq evil-move-beyond-eol t
          evil-cleverparens-use-additional-bindings nil
          evil-cleverparens-use-s-and-S nil
          ;; evil-cleverparens-swap-move-by-word-and-symbol t
          ;; evil-cleverparens-use-regular-insert t
          )
    ;; :config
    ;; (sp-local-pair 'emacs-lisp-mode "'" nil :actions nil)
    )
#+end_src

*** aggressive-indent
#+begin_src emacs-lisp
  ;; keep the file indented
  (use-package aggressive-indent
    :hook ((clojure-mode . aggressive-indent-mode)
           (emacs-lisp-mode . aggressive-indent-mode)))
#+end_src

** markdown
*** markdown-mode
#+begin_src emacs-lisp
(use-package markdown-mode
  :commands (markdown-mode gfm-mode)
  :mode (("README\\.md\\'" . gfm-mode)
         ("\\.md\\'" . markdown-mode)
         ("\\.markdown\\'" . markdown-mode))
  :init (setq markdown-command "multimarkdown"))
#+end_src

* TODO missing / to fix
** Missing
*** Make different font configurations (toggle big font)
*** org-encrypt
https://beorgapp.com/learning/emacs-encryption/
** Half done
*** TODO ox-reveal
#+begin_src emacs-lisp :tangle no
(use-package! org-re-reveal
  :after ox
  :config
  ;; (setq org-re-reveal-root (expand-file-name "../../" (locate-library "dist/reveal.js" t))
  ;;       org-re-reveal-revealjs-version "4")
  (setq org-re-reveal-root "./reveal.js"
        org-re-reveal-revealjs-version "3.8"
        org-re-reveal-external-plugins  '((progress . "{ src: '%s/plugin/toc-progress/toc-progress.js', async: true, callback: function() { toc_progress.initialize(); toc_progress.create();} }"))
        ))
#+end_src

