readme.html

<div id="outline-container-org5073a58" class="outline-4">
<h4 id="org5073a58"><span class="section-number-4">10.7.4</span> evil-cleverparens</h4>
<div class="outline-text-4" id="text-10-7-4">
<p>
This package provides additional text objects for LISPs.
For example, you can mark the outer form with <code>v a d</code>.
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #ffffff;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">use-package</span> <span style="color: var(--clr-constant); background-color: var(--bg-constant);">evil-cleverparens</span>
  <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:hook</span>
  <span style="color: #ff62d4;">(</span><span style="color: #3fdfd0;">(</span>emacs-lisp-mode . evil-cleverparens-mode<span style="color: #3fdfd0;">)</span>
   <span style="color: #3fdfd0;">(</span>clojure-mode . evil-cleverparens-mode<span style="color: #3fdfd0;">)</span><span style="color: #ff62d4;">)</span>
  <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:init</span>
  <span style="color: #ff62d4;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">setq</span> evil-move-beyond-eol t
        evil-cleverparens-use-additional-bindings nil
        evil-cleverparens-use-s-and-S nil
        <span style="color: var(--clr-comment-delimiter); background-color: var(--bg-comment-delimiter);">;; </span><span style="color: var(--clr-comment); background-color: var(--bg-comment);">evil-cleverparens-swap-move-by-word-and-symbol t</span>
        <span style="color: var(--clr-comment-delimiter); background-color: var(--bg-comment-delimiter);">;; </span><span style="color: var(--clr-comment); background-color: var(--bg-comment);">evil-cleverparens-use-regular-insert t</span>
        <span style="color: #ff62d4;">)</span>
  <span style="color: var(--clr-comment-delimiter); background-color: var(--bg-comment-delimiter);">;; </span><span style="color: var(--clr-comment); background-color: var(--bg-comment);">:config</span>
  <span style="color: var(--clr-comment-delimiter); background-color: var(--bg-comment-delimiter);">;; </span><span style="color: var(--clr-comment); background-color: var(--bg-comment);">(sp-local-pair 'emacs-lisp-mode "'" nil :actions nil)</span>
  <span style="color: #ffffff;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org01132cd" class="outline-4">
<h4 id="org01132cd"><span class="section-number-4">10.7.5</span> aggressive-indent</h4>
<div class="outline-text-4" id="text-10-7-5">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: var(--clr-comment-delimiter); background-color: var(--bg-comment-delimiter);">;; </span><span style="color: var(--clr-comment); background-color: var(--bg-comment);">keep the file indented</span>
<span style="color: #ffffff;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">use-package</span> <span style="color: var(--clr-constant); background-color: var(--bg-constant);">aggressive-indent</span>
  <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:hook</span> <span style="color: #ff62d4;">(</span><span style="color: #3fdfd0;">(</span>clojure-mode . aggressive-indent-mode<span style="color: #3fdfd0;">)</span>
         <span style="color: #3fdfd0;">(</span>emacs-lisp-mode . aggressive-indent-mode<span style="color: #3fdfd0;">)</span><span style="color: #ff62d4;">)</span><span style="color: #ffffff;">)</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org33ca1c5" class="outline-3">
<h3 id="org33ca1c5"><span class="section-number-3">10.8</span> markdown</h3>
<div class="outline-text-3" id="text-10-8">
</div>
<div id="outline-container-orgc3161f3" class="outline-4">
<h4 id="orgc3161f3"><span class="section-number-4">10.8.1</span> markdown-mode</h4>
<div class="outline-text-4" id="text-10-8-1">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #ffffff;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">use-package</span> <span style="color: var(--clr-constant); background-color: var(--bg-constant);">markdown-mode</span>
  <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:commands</span> <span style="color: #ff62d4;">(</span>markdown-mode gfm-mode<span style="color: #ff62d4;">)</span>
  <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:mode</span> <span style="color: #ff62d4;">(</span><span style="color: #3fdfd0;">(</span><span style="color: var(--clr-string); background-color: var(--bg-string);">"README\\.md\\'"</span> . gfm-mode<span style="color: #3fdfd0;">)</span>
         <span style="color: #3fdfd0;">(</span><span style="color: var(--clr-string); background-color: var(--bg-string);">"\\.md\\'"</span> . markdown-mode<span style="color: #3fdfd0;">)</span>
         <span style="color: #3fdfd0;">(</span><span style="color: var(--clr-string); background-color: var(--bg-string);">"\\.markdown\\'"</span> . markdown-mode<span style="color: #3fdfd0;">)</span><span style="color: #ff62d4;">)</span>
  <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:init</span> <span style="color: #ff62d4;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">setq</span> markdown-command <span style="color: var(--clr-string); background-color: var(--bg-string);">"multimarkdown"</span><span style="color: #ff62d4;">)</span><span style="color: #ffffff;">)</span>
</pre>
</div>
</div>
</div>
</div>
</div>

<div id="outline-container-orgb4cd338" class="outline-2">
<h2 id="orgb4cd338"><span class="section-number-2">11</span> <span class="todo TODO">TODO</span> missing / to fix</h2>
<div class="outline-text-2" id="text-11">
</div>
<div id="outline-container-org0029231" class="outline-3">
<h3 id="org0029231"><span class="section-number-3">11.1</span> Missing</h3>
<div class="outline-text-3" id="text-11-1">
</div>
<div id="outline-container-orge001b15" class="outline-4">
<h4 id="orge001b15"><span class="section-number-4">11.1.1</span> Make different font configurations (toggle big font)</h4>
</div>
<div id="outline-container-org9c0d749" class="outline-4">
<h4 id="org9c0d749"><span class="section-number-4">11.1.2</span> org-encrypt</h4>
<div class="outline-text-4" id="text-11-1-2">
<p>
<a href="https://beorgapp.com/learning/emacs-encryption/">https://beorgapp.com/learning/emacs-encryption/</a>
</p>
</div>
</div>
</div>
<div id="outline-container-org2c8e6ed" class="outline-3">
<h3 id="org2c8e6ed"><span class="section-number-3">11.2</span> Half done</h3>
<div class="outline-text-3" id="text-11-2">
</div>
<div id="outline-container-orgcef2419" class="outline-4">
<h4 id="orgcef2419"><span class="section-number-4">11.2.1</span> <span class="todo TODO">TODO</span> ox-reveal</h4>
<div class="outline-text-4" id="text-11-2-1">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #ffffff;">(</span>use-package! org-re-reveal
  <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:after</span> ox
  <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:config</span>
  <span style="color: var(--clr-comment-delimiter); background-color: var(--bg-comment-delimiter);">;; </span><span style="color: var(--clr-comment); background-color: var(--bg-comment);">(setq org-re-reveal-root (expand-file-name "../../" (locate-library "dist/reveal.js" t))</span>
  <span style="color: var(--clr-comment-delimiter); background-color: var(--bg-comment-delimiter);">;;       </span><span style="color: var(--clr-comment); background-color: var(--bg-comment);">org-re-reveal-revealjs-version "4")</span>
  <span style="color: #ff62d4;">(</span><span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">setq</span> org-re-reveal-root <span style="color: var(--clr-string); background-color: var(--bg-string);">"./reveal.js"</span>
        org-re-reveal-revealjs-version <span style="color: var(--clr-string); background-color: var(--bg-string);">"3.8"</span>
        org-re-reveal-external-plugins  '<span style="color: #3fdfd0;">(</span><span style="color: #fba849;">(</span>progress . <span style="color: var(--clr-string); background-color: var(--bg-string);">"{ src: '%s/plugin/toc-progress/toc-progress.js', async: true, callback: function() { toc_progress.initialize(); toc_progress.create();} }"</span><span style="color: #fba849;">)</span><span style="color: #3fdfd0;">)</span>
        <span style="color: #ff62d4;">)</span><span style="color: #ffffff;">)</span>
</pre>
</div>
</div>
</div>
